{
  "paper": {
    "paper_id": "arxiv:1410.0637v2",
    "title": "Bounds on the attractor dimension for magnetohydrodynamic channel flow with parallel magnetic field at low magnetic Reynolds number",
    "authors": [
      "Robert Low",
      "Alban Potherat"
    ],
    "year": 2014,
    "venue": "arXiv",
    "source": "arxiv",
    "abstract": "We investigate aspects of low-magnetic-Reynolds-number flow between two parallel, perfectly insulating walls, in the presence of an imposed magnetic field parallel to the bounding walls. We find a functional basis to describe the flow, well adapted to the problem of finding the attractor dimension, and which is also used in subsequent direct numerical simulation of these flows. For given Reynolds and Hartmann numbers, we obtain an upper bound for the dimension of the attractor by means of known bounds on the nonlinear inertial term and this functional basis for the flow. Three distinct flow regimes emerge: a quasi-isotropic 3D flow, a non-isotropic three-dimensional (3D) flow, and a 2D flow. We find the transition curves between these regimes in the space parameterized by Hartmann number Ha and attractor dimension $d_\\text{att}$. We find how the attractor dimension scales as a function of Reynolds and Hartmann numbers (Re and Ha) in each regime. We also investigate the thickness of the boundary layer along the bounding wall, and find that in all regimes this scales as 1/Re, independently of the value of Ha, unlike Hartmann boundary layers found when the field is normal to the channel. The structure of the set of least dissipative modes is indeed quite different between these two cases but the properties of turbulence far from the walls (smallest scales and number of degrees of freedom) are found to be very similar.",
    "pdf_path": "data/automation/papers/arxiv_1410.0637v2.pdf",
    "url": "https://arxiv.org/pdf/1410.0637v2",
    "doi": null,
    "arxiv_id": "1410.0637v2",
    "openalex_id": null,
    "citation_count": 0,
    "is_open_access": true,
    "sync_timestamp": "2026-02-20 18:11:02.788521+00:00"
  },
  "snippets": [
    {
      "snippet_id": "Parxiv_1410_0637v2:S1",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "arXiv:1410.0637v2 [physics.flu-dyn] 13 May 2015 Bounds on the attractor dimension for magnetohydrodynamic channel ﬂow with parallel magnetic ﬁeld at low magnetic Reynolds number R Low ∗ and A Poth´ erat † Applied Mathematics Research Centre Coventry University (Dated: June 28, 2021) We investigate aspects of low-magnetic-Reynolds-number ﬂ ow between two parallel, perfectly insulating walls, in the presence of an imposed magnetic ﬁel d parallel to the bounding walls. We ﬁnd a functional basis to describe the ﬂow, well adapted to th e problem of ﬁnding the attractor dimension, and which is also used in subsequent direct numer ical simulation of these ﬂows. For given Reynolds and Hartmann numbers, we obtain an upper bound for t he dimension of the attractor",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S2",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "by means of known bounds on the nonlinear inertial term and this functional basis for the ﬂow. Three distinct ﬂow regimes emerge: a quasi-isotropic 3D ﬂow, a non -isotropic three-dimensional (3D) ﬂow, and a 2D ﬂow. We ﬁnd the transition curves between these regim es in the space parameterized by Hartmann number Ha and attractor dimension datt. We ﬁnd how the attractor dimension scales as a function of Reynolds and Hartmann numbers (Re and Ha) in eac h regime. We also investigate the thickness of the boundary layer along the bounding wall, and ﬁnd that in all regimes this scales as 1/Re, independently of the value of Ha, unlike Hartmann boun dary layers found when the ﬁeld is normal to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S3",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "the channel. The structure of the set of least dissi pative modes is indeed quite diﬀerent between these two cases but the properties of turbulence far from the walls (smallest scales and number of degrees of freedom) are found to be very similar. I. INTRODUCTION This paper focuses on ﬂows of electrically con- ducting ﬂuids in channels pervaded by a span- wise (i.e. parallel to the bounding walls, rather than perpendicular as in the more familiar case of Hartmann ﬂow) magnetic ﬁeld with a double aim: 1) to determine the properties of the associated dynamical system, and in particular, an upper bound for the dimension of its attractor, and 2) to derive a functional basis that tightly encompasses the attractor",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S4",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "of the system, for subsequent use in highly eﬃcient spectral direct numerical simula- tions (DNS). Both aims are achieved by deriving the set of least dissipative eigenmodes of the dis- sipative part of the governing equations. Before setting out on this task, we familiarize the reader with the key role played by this slightly unusual functional basis in this particular problem and a number of potential others. The physical problem is one of the generic conﬁg- urations where liquid metals ﬂow in devices per- vaded by a strong externally imposed magnetic ﬁeld. It concerns a number of engineering applica- tions in the ﬁeld of metallurgy and in the nuclear industry, where liquid metals ﬂows are controlled and diagnosed with such",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S5",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "ﬁelds, or are used to ex- tract heat from nuclear fusion or ﬁssion reactors ∗ mtx014@coventry.ac.uk † aa4111@coventry.ac.uk [1]. In these engineering problems and small scale laboratory experiments, the ﬂow falls within the low magnetic Reynolds number (Rm) approxima- tion, where the externally imposed magnetic ﬁeld is considered constant [2]. Its main eﬀect is then to induce electric eddy currents and a Lorentz force that acts to eliminate variations of velocity along the magnetic ﬁeld lines. This process has been extensively studied in [3–9]. It manifest itself through the presence of very ﬁne boundary layers (Hartmann layers) and highly anisotropic struc- tures. The numerical resolution of the bound- ary layers incurs prohibitive computational costs when the magnetic ﬁelds becomes high.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S6",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "Further- more, because of the strong anisotropy and Joule dissipation that characterises these ﬂows, Kol- mogorov laws for the smallest scales are no longer valid and must be replaced by diﬀerent scalings for the smallest scales along and across the mag- netic ﬁeld [10]. On the other hand, at low Rm, stronger ﬁelds incur higher dissipation: this re- duces the number of degrees of freedom in the sys- tem and therefore, potentially, the computational cost of resolving these ﬂows completely [11, 12]. Recently, a new type of spectral numerical method taking advantage of this property, [13, 14], was developed. The number of degrees of freedom is estimated from an upper bound for the dimension of the attractor for the dynamical",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S7",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "system associ- ated to the governing equation [15]. This more ef- ﬁcient spectral method was constructed in such a way that the ﬂow is represented with a functional basis that encompasses the attractor signiﬁcantly 2 more tightly than classical bases such as Fourier or Tchebychev bases. Because in low-Rm mag- netohydrodynamics (MHD), the Lorentz force is exclusively dissipative and linear, such a basis can be found by seeking the eigenmodes of the oper- ator arising from the dissipative part of the gov- erning equations, with the boundary conditions of the considered problem [11, 12]. In periodic do- mains and in channels with a transverse magnetic ﬁeld, the derivation of this basis provided an up- per bound for the attractor dimension,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S8",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "scalings for the smallest scales and the thickness of wall boundary layers that could be veriﬁed heuristi- cally and numerically. Most importantly, it made it possible to calculate turbulent MHD ﬂows in almost arbitrarily high magnetic ﬁelds at a mod- erate computational cost [14, 16]. The problem of channel ﬂows with a uniform spanwise magnetic ﬁeld has received much recent attention [17, 18] but no such basis is yet known for it. Consequently, upper bounds for the at- tractor dimension, scalings for the smallest scales and the thickness of the boundary layers along the channel walls and are not available. Nor is it possible to perform eﬃcient spectral DNS at high magnetic ﬁeld. We therefore set out to answer these",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S9",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "question for this geometry by deriving the basis of least dissipative modes and analysing its properties. We ﬁrst derive analytically the least dissipative eigenmodes (Sec. II), then numerically calcu- late their associated eigenvalues (Sec. III). From these, we deduce an upper bound for the attrac- tor dimension of the system and distinguish three possible regimes: weakly 3D, strongly 3D and 2D (Sec. IV). Finally from the set of least dissipa- tive modes, we shall extract scalings for the thick- ness of the boundary layer that develops along the channel walls and for the size of the smallest scale present in the ﬂow (Sec. V). II. GOVERNING EQUATIONS AND PROCEDURE FOR OBTAINING BOUNDS ON THE ATTRACTOR DIMENSION A. Governing equations To",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S10",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "evaluate the attractor dimension, let us consider the time evolution of the ﬂow as given by a dynamical system whose phase space is the space of all solenoidal vector-valued functions on the ﬂuid containing region. This time evolution is speciﬁed by the Navier-Stokes equations. We proceed by considering the time evolution of an inﬁnitesimal perturbation to a ﬂow, UUU, that evolves in the neighbourhood of the attractor ( UUU follows the attractor itself). To obtain an upper bound for the attractor dimension, we note that such a perturbation, which we denoteuuu, spans a n-dimensional inﬁnitesimal volume, which should asymptotically contract to 0 as soon as n is larger than the embedding dimension of the attractor [15]. Denoting byuuu this perturbation,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S11",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "and ig- noring higher-order terms, we then ﬁnd the trace of the linearized Navier-Stokes equations, which determine the contraction or expansion rate of this volume. Making use of an estimate obtained in earlier work for the part of the trace due to inertia [15], we then obtain an upper bound to the attractor dimension of this dynamical system at various Reynolds and Hartmann numbers. Note that since the trace of the operator is independent of the basis, the basis of eigenvectors ofDHa need not be orthogonal, and in general, it isn’t. The physical problem we consider is that of the ﬂow of a ﬂuid of density ρ, conductivity σ, and kinematic viscosity ν, which is conﬁned between impermeable perfectly electrically",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S12",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "insulating walls atz = ±L, and subject to periodic boundary con- ditions in the x and y directions at x = ±πL and y = ±πL in the presence of an applied magnetic ﬁeld BBB = Beeex. We consider the usual Navier- Stokes equation for MHD within the quasi-static MHD approximation, which is valid as long as the induced magnetic ﬁeld remains small compared to the externally imposed one [2]. TakingL to be the typical distance, and U the typical velocity, the evolution of UUU within this approximation is written nondimensionally as ∂tUUU = −∇p − UUU · ∇UUU + Re−1 ( ∆ − Ha2∆ −1∂xx ) UUU, ∇.UUU = 0 , (1) and the evolution of uuu is given",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S13",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "by [11, 12]: ∂tuuu = −∇p − UUU · ∇uuu − uuu · ∇UUU + Re−1 ( ∆ − Ha2∆ −1∂xx ) uuu, ∇.uuu = 0 , (2) where p is the perturbation to the pressure, and ∆ is the Laplacian operator, whose inverse is well- deﬁned for functions satisfying the boundary con- ditions of interest here, namely uuu(x, y, ±1) = 0 , uuu(x, y, z ) = uuu(x + 2π, y + 2π, z ). (3) 3 The problem is governed by two non-dimensional parameters, the Hartmann and Reynolds numbers Ha = √ σ/ (ρν)BL and Re = UL/ν respectively. The perturbation to the current, jjj, is given by Ohm’s law: jjj = ( −∇φ + uuu ×",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S14",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "eeex). (4) Taking the curl of this twice, and using the fact that∇ · jjj = 0 yields jjj = −∆ −1∂x∇ × uuu = −∆ −1∂xωωω, (5) where ωωω is the vorticity. Finally, jjj satisﬁes the boundary condition jz (x, y, ±1) = 0 . (6) We now consider a space spanned by n mutually orthogonal perturbations, and the behaviour of this space as it evolves. Denoting byA the lin- earised evolution operator, and by Pn the projec- tion to this space, it can be shown [11, 19] that the trace ofAPn satisﬁes the inequality Tr(APn) ≤ Tr ([ 1 2∆ − Ha2∆ −1∂xx ] Pn ) + n 2 Re2. (7) To ﬁnd the attractor dimension, we ﬁnd",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S15",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "the eigen- values of the operatorDHa = 1 / 2∆ −Ha2∆ −1∂xx, listed in decreasing order (bearing in mind that the eigenvalues of this operator are real and neg- ative, as expected from a purely dissipative oper- ator). Then the lowest value ofn which gives a negative value for the upper bound of the trace ofAPn provides an upper bound on the attrac- tor dimension for a given value of the Reynolds number. Finding the eigenmodes and eigenval- ues ofDHa in order to obtain these bounds is our next aim. We therefore require the solution of the eigenvalue problem for the operatorDHa in a closed box with periodic boundary conditions of period 2π in the x and y directions, and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S16",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "with im- permeable, perfectly insulating walls at z = ±1. In terms of the non-dimensional variables, this yields the eigenvalue problem DHauuu = λuuu, (8) where the symmetry of the operator DHa guaran- tees that the eigenvalues are real. As the Lapla- cian operator is invertible for these boundary con- ditions, we can instead take the Laplacian of both sides and consider the problem (∆ 2 − 2Ha2∂xx)uuu = 2 λ∆ uuu (9) where uuu satisﬁes the incompressibility condition ∇ · uuu = 0. From the periodicity in x, y , we can consider uuu to be a sum of terms of the form uuu = eik.xk.xk.x ∑ i∈{x,y,z} Zi(z)eeei, (10) where kkk = kxeeex + kyeeey, ( kx, k",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S17",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "y) ∈ Z2, and xxx = xeeex + yeeey. Now consider a single component of uuu, denoted by eik.xk.xk.xZi(z). For this to be a solution to the eigenvalue problem ( 9), we must have Z′′′′ i − 2(λ + k2)Z′′ i + (k4 + 2λk2 + 2Ha2k2 x)Zi = 0 , (11) where a prime denotes diﬀerentiation with respect toz. We seek a solution of the form Zi(z) = eKz , resulting in the auxiliary quartic equation K4−2(λ+k2)K2+(k4+2λk2+2Ha2k2 x) = 0 . (12) Solving this quadratic equation in K2 yields the two roots K2 1 = λ + k2 + √ λ2 − 2Ha2k2x, K2 2 = λ + k2 − √ λ2 − 2Ha2k2x, (13) and eliminating λ from",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S18",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "these gives the relation K2 1 K2 2 = k2(K2 1 + K2 2 ) − k4 + 2Ha2k2 x. (14) This relation gives one constraint on the allowed roots of the auxiliary equation: other constraints are provided by the boundary conditions on the ﬂow. Once these constraints have been solved to giveK1 and K2, we obtain the corresponding eigenvalue from ( 12): λ = 1 2 (K2 1 + K2 2 ) − k2. (15) From the impermeability and non-slip condi- tions at z = ±1, together with incompressibility, we have Zi(±1) = 0 = Z′ z(±1), (16) and ikxZx(z) + ikyZy(z) + Z′ z(z) = 0 . (17) In addition, we obtain electrical boundary condi- tions from the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S19",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "current ﬁeldjjj, which is determined by ∆ jjj = −∂xωωω ( 5). Taking the curl of ( 9) and considering the z-component of jjj ﬁnally gives the boundary condition kyZ′′ x (x, y, ±1) = kxZ′′ y (x, y, ±1), (18) 4 since we must have jz(x, y, ±1) = 0. Modes can conveniently be divided into two classes: those for which Zz(z) is not identically zero, and so the boundary conditions ( 16) must be underdetermined, and those for which Zz(z) is identically zero, so that non-zero Zx(z) and Zy(z) must satisfy the electric boundary condition ( 18). By analogy with linear stability theory in hydro- dynamics, we call these the Orr-Sommerfeld (OS) and Squire modes, respectively.λ is the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S20",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "exponen- tial decay rate of the corresponding eigenmode under the sole eﬀect of dissipation (viscous and Joule). Such a decay would, however, only be observed on individual modes and in the absence of inertia. The evolution of more complex linear ﬂows can still be expressed as a combination of exponential decays [13]. B. Expressions of modes and eigenvalues We can now solve the eigenvalue problem to ﬁnd the modes and corresponding eigenvalues ex- plicitly. In addition to providing an upper bound on the attractor dimension, the basis formed with these modes can be used to carry out numerical simulations of the ﬂows under consideration by means of spectral methods so they constitute an important result of their own [14]. A",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S21",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "laborious calculation shows that the only signiﬁcant possi- bilities are 1. OS-type modes where one of K2 1 and K2 2 is positive, and the other negative, and where kx and ky are not both zero, 2. OS-type modes where both K2 1 and K2 2 are negative, and kx and ky are not both zero , 3. Squire type modes with kx = ky = 0. In each case above, |K1| is diﬀerent from |K2|. Other possible cases are those in which |K1| = |K2|, or K2 1 and K2 2 are complex. In each of these cases, either there is no non-trivial mode at all, or for any given choice ofkx and ky there is a mode for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S22",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "just one precisely tuned value of Ha. These singular cases are of lesser importance for our pur- pose but are an interesting property of this prob- lem, which is absent when the magnetic ﬁeld is perpendicular to the walls for instance [12]. They are brieﬂy described in appendix A. We now re- strict our attention to the generic case where for a chosen Hartmann number there is a set of solu- tions to the constraints. In case (1), we denote the roots of the aux- iliary quartic by K1 = ±1/δ and K2 = ±iκz, where 1 /δ ̸= κz. This reﬂects that real roots cor- respond to the exponential proﬁle of a boundary layer of thicknessδ near the walls,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S23",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "whereas imagi- nary ones induce spatial oscillations of wavelength in the bulk of the ﬂow. In this case, in order to have a non-trivialZz mode, we require 1/δ tanh 1/δ = −κz tan κz or (19) 1/δ tan κz = κz tanh 1/δ (20) and − κ2 z δ2 = k2(1/δ 2 − κ2 z) − k4 + 2Ha2k2 x. (21) If neither kx nor ky is zero, then the two possibil- ities are Zz(z) = − cos κz cosh(z/δ ) + cosh(1 /δ ) cos(κz z) Zx(z) = i kx(κ3 zcosh(1/δ ) sin κz − 1/δ 3 cos κz sinh(1/δ )) (1/δ 2 + κ2 z)(k2x + k2y) × ( sinh(z/δ ) sinh(1/δ ) − sin(κzz) sin κz )",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S24",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "Zy(z) = 1 ky (iZ′ z(z) − kxZx(z)) (22) and Zz(z) = − sin κz sinh(κz z) + sinh(1 /δ ) sin(κzz) Zx(z) = i kx(1/δ 3 sin κz cosh(1/δ ) + κ3 zsinh(1/δ ) cos κz) (k2x + k2y)(1/δ 2 + κ2 z) × ( cos(κzz) cos κz − cosh(z/δ ) cosh(1/δ ) ) Zy(z) = 1 ky (iZ′ z(z) − kxZx(z)). (23) If kx = 0 then from ( 18) we immediately have Zx(z) = 0, and from ( 17) we then obtain Zy(z) = iZ′ z(z)/k y (24) and similarly if ky = 0. In case (1), for each interval of the form [nπ/ 2, (n + 1) π/ 2] there is one value of κz and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S25",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "a corresponding value of 1 /δ satisfying the con- straints, as for the analogous modes in the case where the magnetic ﬁeld is perpendicular to the walls. In this case, ( 15) gives λ = 1 2 ( 1 δ2 − κ2 z ) − k2. (25) 5 In case (2), we have K1 = i˜κz, and K2 = iκz, where ˜κz ̸= κz. This time the non-trivial Zz modes are given by ˜κz tan ˜κz = κz tan κz or (26) ˜κz tan κz = κz tan ˜κz. (27) This yields: Zz(z) = − cos κz cos(˜κzz) + cos ˜κz cos(κz z) Zx(z) = i kx(˜κ3 zcos κz sin ˜κz − κ3 zcos ˜κz sin κz) (k2x + k2y)(˜κ2",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S26",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "z− κ2 z) × ( sin(˜κzz) sin ˜κz − sin(κz z) sin κz ) Zy(z) = 1 ky (iZ′ z(z) − kxZx(z)) (28) or Zz(z) = − sin(κz) sin(˜κzz) + sin(˜κz ) sin(κzz) Zx(z) = i kx(κ3 zsin ˜κz cos κz − ˜κ3 zsin κz cos ˜κz) (k2x + k2y)(˜κ2 z− κ2 z) × ( cos(˜κz z) cos ˜κz − cos(κzz) cos κz ) Zy(z) = 1 ky (iZ′ z(z) − kxZx(z)) (29) when neither of kx not ky are zero, and obtain the Zz and Zy modes as before if one of them is zero. This time ( 15) gives λ = − 1 2(κ2 z+ ˜κz 2) − k2. (30) In case (2), however, the roots are not",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S27",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "as con- veniently located as in the previous case; asκz increases, they can become arbitrarily close to- gether. We will consider the consequences of this in the next subsection. Finally, we have the Squire modes (case (3)), which occur only when kx = ky = 0. In this case we have Zz(z) = 0, and if n is a positive integer, Zx(z) and Zy(z) are given either by Zx,y(z) = cos(( n + 1/ 2)πz ), (31) where λ = − 1 2 (n + 1/ 2)2π2 or by Zx,y(z) sin(nπz ), (32) where λ = − 1 2 n2π2. These functions Zx, Zy and Zz then provide a functional basis for consid- eration of ﬂows, which will be be",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S28",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "applied in DNSs analogous to those in [13, 14]. The full expression of the functional basis is given in appendix B. III. NUMERICAL METHOD AND V ALIDATION In order to ﬁnd the eigenvalues of the modes and the corresponding values of kx, ky , κz, and 1/δ , a numerical approach was required. The ap- proach taken was to ﬁnd, for each of an increasing family of values of Ha, all the modes and eigen- values up to a limiting value. In case (1) (one real and one imaginary root), ﬁnding the eigenvalues was straightforward; the roots are located in known intervals so that it is easy to ﬁnd the root in each interval by means of a bisection method.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S29",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "In the case (2), the roots are not spread out in such a convenient manner. In fact, as the Hart- mann number grows and the relevant values ofκz become larger, the roots can become arbitrarily close together. It is therefore necessary to use a much smaller step length, use Eq. ( 14) to express (26) and ( 27) in terms of just one of the roots, and check for a sign change. The number of roots found as the step length is decreased is shown in Fig 1. We found that to an excellent degree of approximation the number of roots varied linearly with step length: a linear ﬁt gives n = 5 . 01 × 105 − 9. 644",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S30",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "× 104s (33) with goodness of ﬁt measure R2 = 0 . 9996, where n is the number of roots and s is the step length. Extrapolating to s = 0, we ﬁnd that the fraction of roots omitted with s = 0 . 001 is about 0 . 02%. The fact that some roots are omitted means that the estimate for|Tr(DHaPn)| is a slight underesti- mate, but the eigenvalues are very closely spaced, so that although some eigenvalues are omitted, the sum of the ﬁrstn eigenvalues obtained is close to the sum of the ﬁrst n of all eigenvalues. The nu- merical methods were implemented in Python, al- lowing the investigation of a maximum Hartmann number of about 4400,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S31",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "and numbers of modes in excess of 107. The main obstruction to investigat- ing higher Hartmann number was that of compu- tational time: as a consequence of the short step length required, the calculation of all required modes is very time consuming at high Hartmann number. Once obtained, these modes for each Hartmann number considered were then sorted in order of increasing magnitude ofλ, and the modulus of the sum of the ﬁrst n eigenvalues used as an es- timate for Tr( DHaPn). From ( 7), an approxi- mation to the Reynolds number for which n is the dimension of the attractor is then given by √ |2Tr(DHaPn)|/n . 6 0.02 0.04 0.06 0.08 0.10 step length 49.0 49.2 49.4",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S32",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "49.6 49.8 50.0 50.2 50.4number of eigenvalues/1000 FIG. 1. Number of eigenvalues found versus step length. It is interesting to note that for small values of the Hartmann number, the modes of the ﬁrst type (one real and one imaginary root) predominate— indeed, there is no contribution from modes of the second type (two imaginary roots) until the Hartmann number exceeds 1.2. But as the Hart- mann number grows, the contribution from modes of the second type grows until at Hartmann num- bers exceeding 3000, the modes of the ﬁrst type are only about a quarter of all those considered. Such an inhomogeneous distribution of modes was not observed in 3D periodic domains nor in MHD channels perpendicular toB. A",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S33",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "signiﬁcant con- sequence is that since the spectral density of the distribution of modes in (kx, k y, κ z) space cannot be easily predicted, it is no longer possible to ob- tain an analytical estimate for the upper bound fordatt by means of a simple approximation of the Trace in ( 7) by a continuous integral, as in [11] and [12]. Consequently, it has to be obtained numerically only. IV. DISTRIBUTION AND PHYSICAL PROPERTIES OF LEAST DISSIPATIVE MODES A. Spectral distribution of eigenvalues Even though the least dissipative modes do not give an exact solution of the full system of equations governing the ﬂow evolution, it has been shown that ﬁnite combinations of them were able to provide an",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S34",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "accurate representation of the actual solution [14, 16], at least in low-Rm MHD ﬂows. Much can therefore be learned from the ﬂow properties by studying the properties of such ﬁnite sets of modes. Sinceλ < 0, modes can be sorted by growing dissipation rate λn. By construction, the N least dissipative modes are contained within the region delimited by a manifoldλ(kx, κ y, k z) = λN of the ( kx, κ y, k z) space. The shape of these manifolds therefore gives a good measure of the ﬂow anisotropy, in particular at small scales. From ( 15), these can be rescaled to a single manifold representing surfaces of constantλ/ Ha in the ( kx/ Ha, k y/ Ha, κ",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S35",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "z/ Ha) space. Sincekx = 0 removes the Hartmann number from the situation, the shapes of the contours in thekx = 0 plane are unaﬀected by the growing magnetic ﬁeld. Consequently, the cross-section of this family of manifolds in planeskx =constant is very close to a family of concentric circles, which indicates that iso-λ manifolds are isotropically distributed in in planes perpendicular to the magnetic ﬁeld direction. This was indeed the case too in channels with a transverse magnetic ﬁeld and in periodic domains. Discrepancy to anisotropy in these two cases was only due to the discrete distribution of values of wavenumbers perpendicular toB, which had to be integers. Because of the walls at z = ±1, though, κz spans",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S36",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "the solutions of ( 19), (20), (21) or ( 26), (27), (21) rather than the set of integers. This eﬀectively introduces a form of anisotropy in the sense that the sets of wavenumbers in thex and z directions are not identical, but still span the same interval. Cross-sections of the iso- λ manifolds in the ky = 0 plane tell a diﬀerent story (see Fig. 2). The geometry of this graph is formally identical to geometries of channel ﬂow with transverse magnetic ﬁeld [12], but with the roles ofκz and kx reversed. Both phenomenologies thus bear strong similarities, but for the orientation of the magnetic ﬁeld. For small Ha, the ﬂow is essentially isotropic,kx and ky have similar behaviours, and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S37",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "the manifolds are spheres. As Ha increases, the increasing suppression of the kx modes distorts the contours in the ky = 0 plane. This eﬀect becomes more pronounced as Ha increases, until we obtain situations where thekx modes are almost entirely suppressed. Conversely, for a ﬁxed value of Ha, as the value of the largest eigenvalue (and so the number of modes under consideration) increases, we have the following sequence. Initially, the modes havekx strongly suppressed, and the ﬂow is essentially 2D. Next, we enter a regime where the curves of constantλ pass through the origin; this is the 3D, anisotropic regime. In 7 FIG. 2. Contours of ﬁxed values of λ/ Ha this regime, all modes are contained outside",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S38",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "a cone of axisex, tangent to the manifold at the origin, whose half-angle is easily derived from ( 15) as θJ = π/ 2 − cos−1( √ −λ/Ha ). This phenomenology reﬂects that in MHD turbulence at high interaction parameterS = σB 2L/ (ρU ), all energy-containing modes are expelled from the Joule cone [8, 20]. Finally, the contours split away from the origin and we reach the regime of weakly anisotropic 3D ﬂow, which becomes more closely isotropic as the contours approach a semi-circular shape. We also see this from a diﬀerent perspective in the following subsection. B. Upper bound for the attractor dimension Now consider the plot of attractor dimension vs Hartmann number for ﬁxed Reynolds number. Figure",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S39",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "3 plots the dimension of the attractor for Reynolds numbers starting at 10 and increasing in steps of 20, for Hartmann number starting at 1 and increasing in multiplicative steps of 1.2 up to a maximum value of approximately 4400. We note that as in [11] this plot divides the plane up into three regions: a 3D quasi-isotropic region (I), a 3D anisotropic region (II), and a 2D region (III), corresponding to the classiﬁcation given above. For a ﬁxed Reynolds number, and increasing Ha, the dimension initially depends only weakly on 10 0 10 1 10 2 10 3 Ha 10 1 10 2 10 3 10 4 10 5 10 6 10 7 10 8 datt slope 1 slope",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S40",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "3 (I) (II) (III) R e=10 R e=190 (a) 10 0 10 1 10 2 Re 10 0 10 1 10 2 10 3 10 4 10 5 10 6 10 7 10 8 datt Ha= 1 .0 Ha= 4389 slope = 2 slope = 3 slope = 4 (b) FIG. 3. Attractor dimension (a) as a function of Ha for Re ranging from 10 (lowest data set) to 270 (high- est data set) in steps of 20 and (b) as a function of Re for Ha=1.0 (leftmost curve), 26.62, 6, 410.2 (from left to right), 4389 (rightmost curve) (b). Hartmann number in the quasi-isotropic 3D re- gion. When a critical value is reached, all iso-λ manifolds cut through the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S41",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "origin: at this point, the attractor dimension undergoes a transition to the 3D anisotropic region where where it scales approximately as Ha−1. From the data, we ﬁnd that for low Reynolds numbers, the exponent is −1 ± 0. 1, but as the Reynolds number increases the uncertainty reduced to about −1 ± 0. 003, which strongly suggests that the slope tends to −1 at large Reynolds number. 8 For higher values of Ha, another phase transition occurs to the 2D state, where all modes become x−independent. Since their associated eigenvalue becomes independent of Ha (from ( 14)), so does the upper bound for the attractor dimension. The transition from quasi-isotropic 3D to anisotropic 3D sets occurs fordatt ∼ Ha3 in",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S42",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "this diagram: this transition is quite gradual, and we can ﬁnd the transition curve and its slope ei- ther by examining the data for the ﬁrst mode with non-zerokx, zero ky and κz approximately 1.57, or by ﬁnding the number of modes for which |λ| < Ha2/ 2. The two approaches give the re- sults datt ≃ (0. 25 ± 0. 01)Ha3±0.003 and datt ≃ (2. 35 ± 0. 01)Ha3.05±0.05 respectively. The 2D re- gion is that of all least dissipative modes for which kx = 0; this time, examining the data gives a scal- ing of the form datt ≃ (2. 2 ± 0. 1)Ha1.03±0.03 for this transition. A similar approach is followed, holding Ha con- stant and varying",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S43",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "Re, to determine how datt varies with Re in each of these three regions. Some sam- ple curves are plotted on Fig. 3. Combining both graphs, we obtain that the upper bound for the attractor dimension follows one of three scalings: In the 2D regime, datt ≃ (1. 2 ± 0. 1)Re2.1±0.1, (34) In the 3D anisotropic regime, datt ≃ (1. 2 ± 0. 2)Re4.1±0.1 Ha , (35) and in the 3D quasi-isotropic regime: datt ≃ (1. 7 ± 0. 5)Re3.1±0.1 (36) The scalings for datt in 3D regimes are consis- tent with the upper bound obtained in periodic domains and with heuristic estimates for the num- ber of degree of freedoms in the system as both datt ∼ Re4/",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S44",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "Ha in the limit as Re and Ha tend to inﬁnity while remaining within the 3D regime, i.e. Ha << datt << Ha 3 [11]. This result is not a pri- ori obvious from the mathematical point of view, since walls parallel to the magnetic ﬁelds make the spectral distribution of the modes strongly in- homogeneous, in contrast with ﬂows in periodic domains and with channels perpendicular to the ﬁeld. From the physical point of view, however, the fact that the attractor dimension is not signif- icantly aﬀected by the nature of the boundaries when Re is large enough, reﬂects that the num- ber of degrees of freedom in the ﬂow is mainly determined by turbulence far from the walls.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S45",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "In the 2D regime,datt understandably behaves in the same way as in the fully periodic case, since in both cases, strictly 2D modes incur no Joule dissipation. In channels with walls perpendicu- lar to the magnetic ﬁeld, on the other hand, the Hartmann boundary layer that develops against the wall precludes strict two-dimensionality and signiﬁcant Joule dissipation occurs there so that datt continues to decrease with Ha in the quasi-2D regime. A remark should be made on the value of the ex- ponent of Re in the estimates for thedatt. In the strongly anisotropic regime, for example, heuristic estimate for the number of degrees of freedom of turbulence in a periodic box yieldsdM ∼ Re2/Ha [11], and not dM ∼",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S46",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "Re4/Ha . It was previously noted that this overestimate for the exponent of Re takes its roots in the loose upper bound for the inertial terms in ( 7). This issue is not spe- ciﬁc to MHD ﬂows but betrays a core diﬃculty in the derivation of tight upper bounds for attrac- tor dimensions in 3D turbulence. Nevertheless, the exponent of Ha in the estimate fordatt co- incides with the heuristic estimates in the geome- tries with periodic boundary conditions and chan- nels perpendicular to the magnetic ﬁeld in both 3D regimes. Since our numerical estimate shows that this exponent also remains valid in the case of a channel parallel to the magnetic ﬁeld, it is likely to be a",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S47",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "tight estimate in this case too. V. SCALINGS FOR THE SMALL SCALES AND THE BOUNDARY LAYER THICKNESS Expressing the evolution of a solution of the Navier-Stokes equation in terms of the least dis- sipative modes necessitates that these modes are able to resolve the smallest structures present in the ﬂow, namely the boundary layers and the dissipative scales. For the solution to be faith- fully represented on this basis, it must include at least thedatt least dissipative elements of them [14, 16] (From the physical point of view, more dissipative modes than these are dissipated be- fore they are able to transfer energy through iner- tia). This uniquely determines the smallest scales present in the ﬂowκmax z, kmax x and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S48",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "kmax y as well as the smallest and largest possible boundary layer thicknesses. Both are readily extracted from the ordered sequence of least dissipative modes calcu- lated in Sec. IV A. Let us ﬁrst examine the behaviour of the small scales, shown on Figs 4 and 5. We see in the graphs how the maximum val- ues of kx, ky and κz behave in the three regimes. 9 For small Ha < ∼1, the system is in the quasi- isotropic 3D state for all values of Re, and we see that in this case all three ofkx, ky and κz scale approximately as Re. From the numerical data, the scaling is of the form kx ∼ ky ∼ κz ∼",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S49",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "(1. 3 ± 0. 1)Re1±0.05. (37) As Ha is increased, for low values or Re we have the anisotropic 3D regime, in whichkx is signif- icantly less than Ha. datt then scales approxi- mately as (0 . 52 ± 0. 03)Re2±0.1/ Ha, and as Re in- creases the system makes a transition to the quasi- isotropic 3D regime.The small scales are then kx ∼ (0. 18 ± 0. 08) Re2.1±0.2 Ha , (38) ky ∼ κz ∼ (1. 3 ± 0. 1)Re1±0.05. (39) Finally, for Ha large enough, the ﬂuid is in the 2D regime initially, in which kx is entirely sup- pressed. As Re increases, we enter the anisotropic 3D regime, with a trace of this transition appear- ing",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S50",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "in the curves forky and κz. For the larger values of Ha the transition to quasi-isotropic 3D takes place at too large a value of Re to be ob- served here. The boundary layers thicknesses are perhaps the most interesting because they can be expected to diﬀer radically from the Hartmann boundary layers found in channels perpendicular to the mag- netic ﬁeld [12]: since the magnetic ﬁeld is aligned parallel to the walls, we would not expect it to lead to the formation of a Hartmann layer: and indeed, the numerical evidence is that the mini- mum boundary layer thickness scales as 1/ Re, in all three regimes; here, the numerical data give a scaling law ofδ = (0 .",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S51",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "8 ± 0. 02)Re−1.02±0.02. The dependence on Reynolds indicates that the thinnest layer is purely viscous. Figure 6 shows the relationship for the smallest and largest Hart- mann numbers considered, and one intermediate value. We also observe that the graph of the smallest boundary layer thickness shows a trace of the transition from 2D to anisotropic 3D ﬂow, in the form of a discrepancy from the power law line which then settles down as Re increases, but which does not aﬀect the asymptotic scaling. In- terestingly, while the minimum boundary layer thickness does not depend on Ha, the critical value of Re at which this transition occurs, on the other hand, does. The thickest layer, on the other hand, rapidly",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S52",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "saturates as Re is increased. Unlike Hart- mann layers, the layers in channels parallel to walls do not have a deﬁnite thickness determined by the balance between Lorentz force and viscous 10 0 10 1 10 2 10 3 Re 10 0 10 1 10 2 10 3 m axi \u0000 u \u0001",
      "page_hint": null,
      "token_count": 53,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S53",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "v al \u0002 es o f",
      "page_hint": null,
      "token_count": 6,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S54",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "k x , \u0003 y \u0004 κ z \u0005 xκ \u0006 \u0007 \b slope= 1 slope=2 (a) 10 0 10 1 10 2 10 3 Re 10 0 10 1 10 2 10 3 axi",
      "page_hint": null,
      "token_count": 35,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S55",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "al \u000e es o \u000f \u0010 x \u0011 \u0012 \u0013 \u0014 κ \u0015 \u0016 xκ \u0017 \u0018 \u0019 slope=\u001a slope=2 (b) FIG. 4. Maximal values of kx, k y , κ z for Ha ≈ 10.70 (a), and 95.40(b). friction, even at low Re. This reﬂects in diﬀerent modes exhibiting diﬀerent boundary layer thick- nesses at all values of Re. Since the real ﬂow is ultimately a combination of these modes with dif- ferent boundary layer thicknesses, it may not ex- hibit an exponential proﬁle, unlike the Hartmann layers found in the case of the channel with trans- verse magnetic ﬁeld. VI. HEURISTICS FOR THE TRANSITION BETWEEN TURBULENT REGIMES The attractor dimension represents the num- ber of degrees of freedom",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S56",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "of the dynamical sys- 10 10 0 10 1 10 2 10 3 Re 10 0 10 1 10 2 10 3 \u001b axi",
      "page_hint": null,
      "token_count": 24,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S57",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "al es o ! \" x # $ % & κ ' ( xκ ) * + slope=- slope=2 (a) 10 0 10 1 10 2 10 3 Re 10 0 10 1 10 2 10 3 . axi / 0 2 3 al 4 es o 5 6 x 7 8 9 : κ ; < xκ = > ? slope=@ slope=2 (b) FIG. 5. Maximal values of kx, k y , κ z for Ha ≈ 1021 (a), and 4389 (b). tem underlying turbulence. It can be heuristi- cally estimated as the number of vortices in the ﬂow. In homogeneous hydrodynamic turbulence, Kolmogorov’s law for the size of the small scales kmax ∼ Re3/4 yields datt ∼ Re9/4.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S58",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "(40) In the anisotropic MHD regime, scalings for the small scales are usually obtained by assuming that anisotropy is constant along the inertial range and that inertial transfer is balanced by Joule dissipa- tion at all scales in the inertial range, which trans- lates into the following scaling for the anisotropy 100 101 102 103 Re 10-3 10-2 10-1 100 Min boundary layer thickness Ha=1.0 Ha=590.7 Ha=4389 slope=-1 FIG. 6. Boundary layer thicknesses for Ha ≈ 1. 0, 590. 7, 4389. and the power spectral density [10, 11]: kx k⊥ ∼ N−1, (41) E(k⊥) ∼ E0k−3, (42) , where E0 = E(k ⊥= 1), and since at the small scales, viscous friction becomes of the same order as these two",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S59",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "eﬀects, we obtain kmax x ∼ Re Ha , (43) kmax y ∼ κmax z∼ kmax ⊥ ∼ Re1/2, (44) datt ∼ Re2 Ha . (45) The transition between the homogeneous isotropic regime and the anisotropic MHD regime, occurs when the estimates fork⊥ and kx converge to the same value. Whether using mathematical esti- mates ( 38), ( 39) and ( 35), or heuristics ( 43), ( 44) and ( 45) the number of degrees of freedom at the transition scales as datt ∼ Ha3, in line with the numerical ﬁndings of Sec. IV B. Similarly, the transition between anisotropic MHD regime and the 2D regime takes place when kmax x ∼ 1. Applying this condition to both the mathematical",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S60",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "estimates ( 35) and ( 38), and the heuristics estimates ( 45) and ( 43) yields the same scaling datt ∼ Ha. It is remarkable that when ex- pressed in terms of the number of degrees of free- dom rather than Reynolds number, the transition laws found from the properties of the least dis- sipative modes reﬂect heuristics accurately, and 11 do not suﬀer from the loose estimate for the in- ertial terms. Nevertheless, it should be noted that the heuristic phenomenology for MHD tur- bulence discussed in this section is only well es- tablished for values of the interaction parameter Sof the order of unity [10]. The authors of [21] experimentally observed that the spectral expo- nent in the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S61",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "inertial range varied continuously but non-monotonously between -5/3 and -4 whenS spanned larger intervals from 0 to large values. Although the full range of these values included nearly isotropic regimes and quasi-2D regimes, this stresses that thek−3 spectrum is not a uni- versal feature of anisotropic MHD turbulence, un- like thek−5/3 spectrum of isotropic, homogeneous hydrodynamic turbulence. Scalings for the small scales of MHD turbulence with a diﬀerent spec- trum are however not known. Equally, the scal- ingdatt ∼ Ha−1 is asymptotic and Fig. 3 shows that it may be imperfectly veriﬁed away from the middle range of the anisotropic regime. Finally, it should be noticed that the phenomenol- ogy discussed in this section applies regardless of the boundary conditions,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S62",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "and therefore to Hart- mann ﬂows and ﬂows in 3D periodic domains [11, 12]. The most remarkable aspect about the case of a channel ﬂow with a spanwise magnetic ﬁeld is that the same phenomenology applies to it despite a very diﬀerent spectral distribution of eigenmodes. Although not surprising from the physical point of view, this property is anything but straightforward from the mathematical point of view. VII. CONCLUDING REMARKS The sequence of least dissipative modes for a channel ﬂow in a homogeneous magnetic ﬁeld par- allel to the walls has been derived. This achieves the ﬁrst step towards spectral DNS of MHD ﬂows in this conﬁguration based on this functional ba- sis. This promising method was shown to par-",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S63",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "tially lift the cost of meshing the very thin bound- ary layers in MHD channel ﬂows perpendicular to the externally applied magnetic ﬁeld. In the present case, Hartmann layers are not present. This implies that when the ﬂow is 3D but strongly anisotropic, the number of modes required to rep- resent the ﬂow completely can be expected to come close to the actual attractor dimensiondatt, as in the case of periodic ﬂows [16]. An up- per bound for it was found to scale as Re4/ Ha, but datt itself is heuristically expected to scale as Re2/ Ha, suggesting that the upper bound we ﬁnd is tight as far as the exponent of Ha is concerned but not that of Re.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S64",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "Either way,datt signiﬁcantly decreases with Ha and so using the least dissipa- tive modes in spectral DNS should incur signiﬁ- cant computational savings. The success of such a numerical approach relies on the ability of these modes to faithfully repre- sent the physical properties of the ﬂow. In this re- spect the least dissipative modes have been shown to recover most of the known attributes of MHD turbulence in a channel parallel to the magnetic ﬁeld: • In regimes where the ﬂow is 3D, turbulence far from the wall determines the number of degrees of freedom of the ﬂow. The ensuing scalings for the attractor dimension, small scales along and across the magnetic ﬁelds, and Joule cone half- angle are",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S65",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "essentially the same as those for turbu- lence in a periodic domain. These are all ﬁnely recovered by the set of least dissipative modes. In the most important case of 3D anisotropic ﬂow, these scalings for the small scales were: κz ≃ ky ≃ 01. 3Re kx ≃ Re2 2Ha • The modes spread into two families: Orr- Sommerfeld modes, which have a velocity com- ponent across the channel and Squire modes which do not. • The spectral distribution of the least dissipative modes is strongly inhomogeneous, because of the presence of pairs of OS modes with imaginary eigenvalues. This eﬀect is due to the presence of walls parallel to the magnetic ﬁeld but does not aﬀect the main scalings",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S66",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "for the attractor dimen- sion: this important result isa priori far from obvious from the mathematical point of view but reﬂects that high-Re turbulence is not strongly aﬀected by the walls in the present geometry (see above). • The maximum and minimum thicknesses of the boundary layers associated to the least dissipa- tive modes along the walls are essentially inde- pendent of the external magnetic ﬁeld and de- pend on Re only, as one would expect for a mag- netic ﬁeld parallel to the walls. The authors gratefully acknowledge ﬁnancial sup- port from the Leverhulme Trust (Grant Ref. F00/732J). 12 Appendix A: Sporadic resonant modes Only the cases considered above provide modes for arbitrarily chosen Hartmann number. Of the several",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S67",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "other possible cases (both roots of the quadratic equation inK2 real, one or both 0, both roots of the same magnitude) some have no modes, others have only modes in which the Hart- mann number is precisely determined bykx and ky and the values of K1, K2. We tabulate the possibilities as follows: 1. K1 = 0, K2 2 = −µ2: µ = n ∈ Z, and 2Ha 2 = (k2 + n2)/k xk2 2. K2 1 = −K2 2 = µ2, where µ ∈ R: µ must sat- isfy the equation tan( µ) = ± tanh(µ), and 2Ha2 = ( k2 − µ2)/k xk2. 3. All other cases: no nontrivial modes. Appendix B: Eigenbasis of the Dissipation operator To",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S68",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "begin with, we see the various OS modes, which themselves split up into several cases. First, we have the case where the roots of ( 12) are ±1/δ and ±iκz, where 1 /δ ̸= ±κz, and kx and ky are not both zero. If 1 /δ tanh 1/δ = −κz tan κz then Zz(z) is given by Zz(z) = − cos(κz) cosh(z/δ ) + cosh(1 /δ ) cos(κz z) If neither kx nor ky is 0, then Zx(z) and Zy(z) are given by Zx(z) = i kx(κ3 zcosh(1/δ ) sin κz − 1/δ 3 cos κz sinh(1/δ )) (1/δ 2 + κ2 z)(k2x + k2y) × ( sinh(z/δ ) sinh(1/δ ) − sin(κzz) sin κz ) Zy(z) = 1 ky",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S69",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "(iZ′ z(z) − kxZx(z)) If 1 /δ tan κz = κz tanh 1/δ , then Zz(z) is given by Zz(z) = − sin κz sinh(κzz) + sinh(1 /δ ) sin(κzz) If neither kx nor kz is 0, then Zx(z) and Zy(z) are given by Zx(z) = i kx(1/δ 3 sin κz cosh(1/δ ) + κ3 zsinh(1/δ ) cos κz) (k2x + k2y)(1/δ 2 + κ2 z) × ( cos(κzz) cos κz − cosh(z/δ ) cosh(1/δ ) ) Zy(z) = 1 ky (iZ′ z(z) − kxZx(z)) If kx = 0, Zx(z) = 0 , Z y(z) = iZ′(z)/k y and if ky = 0, Zy(z) = 0 , Z x(z) = iZ′(z)/k x In each of these cases the eigenvalue is",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S70",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "given by λ = 1 2 ( 1 δ2 − κ2 z ) − k2. Next, we have the case where the roots of ( 12) are ±iκz and ±i˜κz, where κz ̸= ± ˜κz, and kx and ky are not both zero. If ˜κz tan ˜κz = κz tan κz then Zz(z) is given by Zz(z) = − cos κz cos(˜κzz) + cos ˜κz cos(κzz) If neither kx nor ky are zero, then Zx(z) and Zy(z) are given by Zx(z) = i kx(˜κ3 zcos κz sin ˜κz − κ3 zcos ˜κz sin κz) (k2x + k2y)(˜κ2 z− κ2 z) × ( sin(˜κzz) sin ˜κz − sin(κz z) sin κz ) Zy(z) = 1 ky (iZ′ z(z) − kxZx(z)) If",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S71",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "˜κz tan κz = κz tan ˜κz then Zz(z) is given by Zz(z) = − sin(κz ) sin(˜κzz) + sin(˜κz) sin(κz z) and if neither of kx nor ky is zero then Zx(z) and Zy(z) are given by Zx(z) = i kx(κ3 zsin ˜κz cos κz − ˜κ3 zsin κz cos ˜κz) (k2x + k2y)(˜κ2 z− κ2 z) × ( cos(˜κz z) cos ˜κz − cos(κzz) cos κz ) Zy(z) = 1 ky (iZ′ z(z) − kxZx(z)) Just as before, if kx = 0, Zx(z) = 0 , Z y(z) = iZ′(z)/k y and if ky = 0, Zy(z) = 0 , Z x(z) = iZ′(z)/k x 13 In each of these cases the eigenvalue is given by λ =",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S72",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "− 1 2(κ2 z+ ˜κz 2) − k2. Finally, we have the Squire modes: for these modes, kx = ky = 0, and we have Zz(z) = 0, and for each positive integer n there are modes Zx,y = cos(( n + 1/ 2)πz ) with λ = − 1 2 (n + 1/ 2)2π2 and Zx,y(z) = sin( nπz ) with λ = − 1 2 n2π2. [1] N. Vetcha, S. Smolentsev, M. Abdou, and R. Moreau, Phys. Fluids 25, 024102 (2013) . [2] P. H. Roberts, Introduction to Magnetohydrody- namics (Longmans, 1967). [3] H. K. Moﬀatt, J. Fluid Mech. 28, 571 (1967). [4] P. A. Davidson, J. Fluid Mech. 336, 123 (1997). [5] O. Zikanov and A. Thess,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S73",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "J. Fluid Mech. 358, 299 (1998). [6] A. Thess and O. Zikanov, J. Fluid Mech. 579, 383 (2007) . [7] R. Klein and A. Poth´ erat, Phys. Rev. Lett. 104, 034502 (2010) . [8] A. Poth´ erat, Magnetohydrodynamics 48, 13 (2012). [9] A. Poth´ erat and R. Klein, J. Fluid Mech. 761, 168 (2014) . [10] A. Alemany, R. Moreau, P. Sulem, and U. Frish, Journal de M´ ecanique18, 277 (1979). [11] A. Poth´ erat and T. Alboussi` ere, Phys. Fluids 15, 3170 (2003). [12] A. Poth´ erat and T. Alboussi` ere, Phys. Fluids 18, 125102 (2006). [13] V. Dymkou and A. Poth´ erat, J. Theor. Comp. Fluid Mech. 23, 535 (2009) . [14] K. Kornet and A. Poth´ erat,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S74",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "accepted for publica- tion in J. Comp. Phys. , arXiv:1403.4129 (2015). [15] C. R. Doering and J. D. Gibbons, Applied Anal- ysis of the Navier-Stokes Equation (Cambridge University Press, 1995). [16] A. Poth´ erat and V. Dymkou, J. Fluid Mech. 655, 174 (2010) . [17] D. Krasnov, M. Rossi, O. Zikanov, and T. Boeck, J. Fluid Mech. , 73 (2008). [18] D. Krasnov, O. Zikanov, J. Schumacher, and T. Boeck, Phys. Fluids 20, 095105 (2008) . [19] P. Constantin, C. Foias, O. P. Mannley, and R. Temam, Memoirs of the Am. Math. Soc.53 (1985). [20] B. Knaepen and R. Moreau, Ann. Rev. Fluid. Mech. 40, 25 (2008) . [21] S. Eckert, G. Gerbeth, W. Witke, and H. Lan- genbrunner, Int.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1410_0637v2:S75",
      "paper_id": "arxiv:1410.0637v2",
      "section": "body",
      "text": "J. Heat Fluid Flow , 358 (2001).",
      "page_hint": null,
      "token_count": 7,
      "paper_year": 2014,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9263131011843372,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    }
  ],
  "extraction_meta": {
    "extractor": "pypdf",
    "two_column_applied": false,
    "ocr_applied": false,
    "pages_total": 13,
    "empty_pages": 0,
    "empty_page_pct": 0.0,
    "page_stats": [
      {
        "page": 1,
        "chars": 4660,
        "empty": false
      },
      {
        "page": 2,
        "chars": 4466,
        "empty": false
      },
      {
        "page": 3,
        "chars": 3536,
        "empty": false
      },
      {
        "page": 4,
        "chars": 3658,
        "empty": false
      },
      {
        "page": 5,
        "chars": 3888,
        "empty": false
      },
      {
        "page": 6,
        "chars": 4153,
        "empty": false
      },
      {
        "page": 7,
        "chars": 2329,
        "empty": false
      },
      {
        "page": 8,
        "chars": 4730,
        "empty": false
      },
      {
        "page": 9,
        "chars": 3237,
        "empty": false
      },
      {
        "page": 10,
        "chars": 2156,
        "empty": false
      },
      {
        "page": 11,
        "chars": 4494,
        "empty": false
      },
      {
        "page": 12,
        "chars": 2624,
        "empty": false
      },
      {
        "page": 13,
        "chars": 1946,
        "empty": false
      }
    ],
    "quality_score": 0.9263,
    "quality_band": "good"
  }
}