{
  "paper": {
    "paper_id": "arxiv:1711.04482v1",
    "title": "Exciton-polaritons in cuprous oxide: Theory and comparison with experiment",
    "authors": [
      "Frank Schweiner",
      "Jan Ertl",
      "Jörg Main",
      "Günter Wunner",
      "Christoph Uihlein"
    ],
    "year": 2017,
    "venue": "arXiv",
    "source": "arxiv",
    "abstract": "The observation of giant Rydberg excitons in cuprous oxide $\\left(\\mathrm{Cu_{2}O}\\right)$ up to a principal quantum number of $n=25$ by T.~Kazimierczuk \\emph{et al.} [Nature \\textbf{514}, 343, (2014)] inevitably raises the question whether these quasi-particles must be described within a multi-polariton framework since excitons and photons are always coupled in the solid. In this paper we present the theory of exciton-polaritons in $\\mathrm{Cu_{2}O}$. To this end we extend the Hamiltonian which includes the complete valence band structure, the exchange interaction, and the central-cell corrections effects, and which has been recently deduced by F.~Schweiner \\emph{et al.} [Phys.~Rev.~B \\textbf{95}, 195201, (2017)], for finite values of the exciton momentum $\\hbar K$. We derive formulas to calculate not only dipole but also quadrupole oscillator strengths when using the complete basis of F.~Schweiner \\emph{et al.}. Very complex polariton spectra for the three orientations of $\\boldsymbol{K}$ along the axes $[001]$, $[110]$, and $[111]$ of high symmetry are obtained and a strong mixing of exciton states is reported. The main focus is on the $1S$ ortho exciton-polariton, for which pronounced polariton effects have been measured in experiments. We set up a $5\\times 5$ matrix model, which accounts for both the polariton effect and the $K$-dependent splitting, and which allows treating the anisotropic polariton dispersion for any direction of $\\boldsymbol{K}$. We especially discuss the dispersions for $\\boldsymbol{K}$ being oriented in the planes perpendicular to $[1\\bar{1}0]$ and $[111]$, for which experimental transmission spectra have been measured. Furthermore, we compare our results with experimental values of the $K$-dependent splitting, the group velocity, and the oscillator strengths of this exciton-polariton.",
    "pdf_path": "data/automation/papers/arxiv_1711.04482v1.pdf",
    "url": "https://arxiv.org/pdf/1711.04482v1",
    "doi": null,
    "arxiv_id": "1711.04482v1",
    "openalex_id": null,
    "citation_count": 0,
    "is_open_access": true,
    "sync_timestamp": "2026-02-20 17:50:38.454170+00:00"
  },
  "snippets": [
    {
      "snippet_id": "Parxiv_1711_04482v1:S1",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "Exciton-polaritons in cuprous oxide: Theory and comparison with experiment Frank Schweiner, Jan Ertl, J¨ org Main, and G¨ unter Wunner Institut f¨ ur Theoretische Physik 1, Universit¨ at Stuttgart, 70550 Stuttgart, Germany Christoph Uihlein Experimentelle Physik 2, Technische Universit¨ at Dortmund, 44221 Dortmund, Germany (Dated: July 16, 2018) The observation of giant Rydberg excitons in cuprous oxide (Cu 2O) up to a principal quantum number of n= 25 by T. Kazimierczuk et al. [Nature 514, 343, (2014)] inevitably raises the question whether these quasi-particles must be described within a multi-polariton framework since excitons and photons are always coupled in the solid. In this paper we present the theory of exciton- polaritons in Cu 2O. To this end we extend the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S2",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "Hamiltonian which includes the complete valence band structure, the exchange interaction, and the central-cell corrections eﬀects, and which has been recently deduced by F. Schweiner et al. [Phys. Rev. B 95, 195201, (2017)], for ﬁnite values of the exciton momentum ℏK. We derive formulas to calculate not only dipole but also quadrupole oscillator strengths when using the complete basis of F. Schweiner et al. , which has recently been proven as a powerful tool to calculate exciton spectra. Very complex polariton spectra for the three orientations of K along the axes [001], [110], and [111] of high symmetry are obtained and a strong mixing of exciton states is reported. The main focus is on the 1 S ortho exciton-polariton, for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S3",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "which pronounced polariton eﬀects have been measured in experiments. We set up a 5 ×5 matrix model, which accounts for both the polariton eﬀect and theK-dependent splitting, and which allows treating the anisotropic polariton dispersion for any direction of K. We especially discuss the dispersions for K being oriented in the planes perpendicular to [1¯10] and [111], for which experimental transmission spectra have been measured. Furthermore, we compare our results with experimental values of the K-dependent splitting, the group velocity, and the oscillator strengths of this exciton-polariton. The results are in good agreement. This proves the validity of the 5 ×5 matrix model as a useful theoretical model for further investigations on the 1 S ortho exciton-polariton. PACS numbers: 71.36.+c,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S4",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "71.35.-y, 78.40.-q, 71.20.Nr I. INTRODUCTION Excitons are Coulomb-bound pairs of a positively charged hole in the valence band and a negatively charged electron in the conduction band of a semiconductor. Hence, these elementary excitations of a semiconductor are often regarded as the hydrogen analog of the solid state. It is now more than 80 years since Frenkel [1– 3], Peierls [4], and Wannier [5] formulated the concept of excitons. After the experimental discovery of these quasi- particles in cuprous oxide (Cu2O) by Gross and Karryjew in 1952 [6], excitons in bulk semiconductors became an important topic in solid-state physics from the late 1950s to the 1970s (see, e.g., Refs. [7–12] and further references therein). Very recently, new attention has been",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S5",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "drawn to the ﬁeld of excitons by an experimental observation of the yellow exciton series in Cu 2O up to a large principal quantum number of n = 25 [13]. This discovery has opened up the research ﬁeld of giant Rydberg excitons and led to a variety of new experimental and theoretical investigations [13–36]. Furthermore, it may pave the way, e.g., to a deeper understanding of inter-particle interac- tions in the solid [13] and to applications in quantum information technology [27]. Even though the spectrum of Rydberg excitons in Cu2O can be described quite well in a ﬁrst approximation by the hydrogen-like model of Wannier, one must keep in mind that excitons are complex many-body states of the solid and,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S6",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "hence, that there are signiﬁcant limitations to the hydrogen-like model and to the atom-like description of these quasi-particles [37]. Some essential corrections to the hydrogen-like model comprise, e.g., the inclusion of the complete cubic va- lence band structure [38–43], which leads to a com- plicated ﬁne-structure splitting, the central-cell correc- tions, which account for deviations from the hydrogen- like model in the limit of a small exciton radius [7, 44–50], and the exchange interaction [7, 47, 48, 51, 52]. Further- more, interactions with other quasi-particles, like, e.g., phonons have to be considered [53–55]. All of these ef- fects have already been discussed recently for the excitons in Cu2O [15, 18, 20, 21, 25, 28]. Above all, there is another fundamental",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S7",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "diﬀerence be- tween atoms and excitons as regards their interaction with light. By analogy with the interaction of atoms with light one may suppose that absorption of light in a crys- tal can be described as the excitation of an exciton with the simultaneous disappearance of a photon [7]. Indeed, in the weak-coupling limit, the incident light acts only as a perturbation on the diﬀerent energy states or excita- tions of the solid like, e.g., excitons [47]. However, since the excited states in the solid are connected with a polar- ization and since an oscillating polarization emits again an electromagnetic wave acting back onto the incident wave, there is an interplay between light and matter. If arXiv:1711.04482v1 [cond-mat.mtrl-sci] 13 Nov",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S8",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "2017 2 the frequency of light is within the range of the resonance frequency of an excitation, the coupling is strong and thus anomalous dispersion can be observed [7]. Due to this coupling, excitons and photons cannot be treated as independent entities or good eigenstates, but new quasi- particles must be introduced, which are called polaritons and which represent the quanta of the mixed state of polarization and electromagnetic wave [56–64]. In this regard the 1 S ortho exciton of Cu 2O, in par- ticular, is of interest as for this state characteristic po- lariton eﬀects like propagation beats and the conserva- tion of coherence over macroscopic distances have al- ready been demonstrated experimentally [65]. Further- more, the threefold degeneracy",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S9",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "of this state is lifted for ﬁnite momentum of the center of mass ℏK, and its oscillator strengths [66] as well as its dispersion are anisotropic [20, 67–69]. All of these eﬀects and the number of experimental results for, e.g., the oscillator strength, the K-dependent spectra and the group veloc- ity [66], with which theoretical results can be compared, make the 1 S ortho exciton an ideal candidate for theo- retical investigations. In this paper we present the theory of exciton- polaritons in Cu 2O. We extend the Hamiltonian of Ref. [28], which accounts for the complete valence band structure, the exchange interaction, and the central-cell corrections, for a ﬁnite momentum ℏK of the center of mass. The corresponding Schr¨",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S10",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "odinger equation can then be solved using a complete basis. This method allows us not only to calculate dipole and quadrupole oscilla- tor strengths but also the size of the nonanalytic ex- change interaction. As the splitting due to the non- analytic exchange interaction at K = 0 is identical to the longitudinal-transverse splitting (LT-splitting) when treating polaritons, this interaction needs to be consid- ered for a correct treatment of the complete problem. We show how to calculate the polariton dispersion for the complete exciton spectrum. Due to the presence of the complete valence band structure, the exchange interaction, and the central-cell corrections, we obtain very complex polariton dispersions for the excitons in Cu 2O, which by far exceed previous",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S11",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "investigations on the polariton dispersion using a simple hydrogen-like model [26]. The main emphasis in this pa- per is on the only exciton state for which a pronounced polariton eﬀect has been observed in several experiments: the 1Sortho exciton state. At ﬁrst, we discuss the eﬀects of a ﬁnite momentum ℏK of the center of mass on the spectrum. The K-dependent splitting, which has been discussed in Refs. [20, 67–69], is now treated using the K-dependent Hamiltonian in explicit form and including the central-cell corrections. The calculated splittings are in the same order of magnitude as the splittings observed experimentally [67–69]. Previous publications on the 1 S ortho exciton polari- ton [26, 65, 66, 70] were conﬁning the polariton problem",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S12",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "to situations where the K-vector is parallel to one of the principal symmetry axes of the crystal. This ensures that the polarization of the exciton is always parallel to the electric ﬁeld vector and perpendicular to the wave vec- tor. What is still missing is a proper treatment of the general polariton problem with an arbitrary orientation of the K-vector, which considers the K-dependent split- ting and the polariton eﬀect simultaneously. The chal- lenge is the anisotropy of the exciton-photon interaction, leading to a polarization that is neither parallel to the electric ﬁeld nor orthogonal to the wave vector. Solving this very complex problem is a signiﬁcant step ahead in a proper treatment of the exciton polariton problem. We are",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S13",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "able to show that the general polariton problem can be reduced to solving an eigenvalue problem involving two photon states and three exciton states; thus giving rise to ﬁve distinct polariton branches. The general case leads to polariton states with transverse and longitudinal polarization components. These hybrid polaritons states can therefore be regarded as a mixture between a trans- verse polariton and a longitudinal exciton. Using the 5 ×5 matrix model for the anisotropic dis- persion of the 1 S ortho exciton-polariton we are able to calculate the group velocity, the oscillator strengths, and spectra for diﬀerent orientations of K and to compare them with experimental results [65, 66, 68, 70]. We es- pecially discuss the two cases of the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S14",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "polariton spectra in the planes perpendicular to [1 ¯10] and [111]. In the ﬁrst case the vector K is oriented in one of the six mirror planes of the cubic group Oh so that the polariton states can be classiﬁed according to two diﬀerent irreducible representations of the group Cs. As regards the second case, there is no such symmetry left and ﬁve polariton branches are obtained independently from the polariza- tion of light. We are able to compare our results with experimental transmission spectra. The good agreement between theory and experiment not only emphasizes the special nature of the 1 S ortho exciton polariton but also proves the validity of the 5 ×5 matrix model as a useful theoretical",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S15",
      "paper_id": "arxiv:1711.04482v1",
      "section": "body",
      "text": "model for further investigations on this po- lariton. Our investigations with respect to the exciton- polariton problem in Cu 2O are gaining additional im- portance by recent second harmonic generation (SHG) measurements performed by J. Mund et al. [71]. The",
      "page_hint": null,
      "token_count": 40,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S16",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "tra short pulses having a band width covering several meV. The resonant excitation of the 1S ortho exciton by means of a two-photon absorption process generates exci- ton polaritons that are giving rise to SHG radiation. The polariton nature of the quadrupole exciton explains why it is possible to generate SHG in a crystal with inversion symmetry. The paper is organized as follows: In Sec. II we present the Hamiltonian of excitons in Cu 2O when consider- ing a ﬁnite momentum ℏK of the center of mass and show how to solve the corresponding Schr¨ odinger equa- tion in a complete basis. In Sec. III we present formulas to calculate dipole and quadrupole oscillator oscillator strengths. Having introduced the multi-polariton",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S17",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "con- 3 cept of exciton-polartions in Sec. IV A, we discuss the rotating wave approximation, the nonanalytic exchange interaction and criteria for the observability of polariton eﬀects in Secs. IV B, IV C, and IV D, respectively. In Sec. V we then use the Hamiltonian, which accounts for the complete valence band structure, the exchange in- teraction and the central-cell corrections to calculate the complex dispersion of the polaritons connected with the excitons states of 2 ≤n≤4. We also discuss the observ- ability of polariton eﬀects. The K dependent splitting and the dispersion of the 1 S ortho exciton polariton are treated separately from the other polaritons in Sec. VI. After the discussion of the splitting in Sec. VI A,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S18",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "we intro- duce the 5 ×5 matrix model in Sec. VI B. The dispersion of the ortho exciton polariton, the group velocity and the oscillator strengths are compared with experimental re- sults in Sec. VI C. We ﬁnally give a summary and outlook in Sec. VII. II. HAMILTONIAN In this section we shortly present the theory of excitons with a ﬁnite momentum of the center of mass in Cu 2O, where the cubic valence band structure, the exchange interaction and the central-cell corrections need to be considered. The Hamiltonian of the exciton is given by H = Eg + V (re −rh) + He (pe) + Hh (ph) + HCCC (re −rh) + Hexch (re −rh) (1) with the energy",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S19",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "Eg of the band gap. The screened Coulomb interaction V, the central cell corrections HCCC, the analytic exchange exchange interaction Hexch and the kinetic energies He (pe) and Hh (ph) of the elec- tron and the hole are given in Ref. [28]. We now introduce relative and center-of-mass coordi- nates r= re −rh, (2a) R= αre + γrh. (2b) The factors αand γ are in general 3 ×3 matrices with |det (α+ γ)|= 1 [42]. As the Hamiltonian (1) depends only on the relative coordinate r = re −rh of electron and hole, the momentum of the center of mass P = pe + ph = −iℏ (α+ γ) ∇R (3) with ∇re = α∇R+ ∇r, (4a) ∇rh = γ∇R−∇r,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S20",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "(4b) is a constant of motion, i.e., we can set P = ℏK[42, 72]. According to Ref. [42], the matrices αand γcan be cho- sen arbitrarily, as long as |det (α+ γ)|= 1 holds, but should be adapted to the problem. Note that if we insert Eqs. (2) and (4) into the Hamiltonian (1) in general a coupling term between the relative motion and the mo- tion of center of mass appears. Only for a speciﬁc choice of α and γ this coupling term vanishes. However, the correct values of α and γ are diﬃcult to ﬁnd [20, 72]. In particular, the generalized relative and center of mass coordinate transformation of Ref. [20] holds only if the parameters ηi in",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S21",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "the kinetic energy of the hole are set to zero (cf. Ref. [20]). When assuming isotropic coeﬃcients α = α1 and γ = (1 −α)1 it is not possible to ﬁnd a constant value of αfor which the relative motion and the motion of the center of mass are decoupled. This is con- nected to the fact that the exciton mass in Cu 2O is not isotropic [20]. Hence, the more complicated generalized transformation with 3 ×3 matrices would be needed. Nevertheless, the results of the Hamiltonian are in- dependent of the choice of α and γ. As we extend the theory of excitons in semiconductors with a cubic valence band structure for polariton eﬀects, we simply use the coordinates",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S22",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "and momenta of relative and cen- ter of mass motion with α = me/(me + mh) 1 and γ = mh/(me + mh) 1 known from the hydrogen atom in the following: r= re −rh, (5a) R= (mere + mhrh) /(me + mh) , (5b) p= (mhpe −meph) /(me + mh) , (5c) P = pe + ph = ℏK. (5d) We can then write the Hamiltonian in the form H = H0 + (ℏK) H1 + (ℏK)2 H2. (6) The ﬁrst part H0 is exactly the Hamiltonian of relative motion presented and discussed in Ref. [28], while the last part H2 describes the motion of the center of mass in the degenerate band case. The term H1 depends on",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S23",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "the relative momentum p and thus couples the relative motion and the motion of the center of mass. For the case that the wave vector K is oriented along one of the directions of high symmetry, i.e., along [001], [110] or [111], one can rotate the coordinate system to make the quantization axis coincide with the direction of K and then express the Hamiltonian (96) in terms of irreducible tensors [40, 76–78]. Explicit expressions for H0, H1, and H2 for these special orientations of the wave vector K are given in the Supplemental Material [79]. The Schr¨ odinger equation corresponding to the Hamil- tonian (96) is solved using the method presented in Refs. [20, 21, 28] with a complete basis.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S24",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "The ansatz for the exciton wave function now reads |ΨνK⟩ = ∑ NLJFFtMFt cνK NLJFFtMFt |Π⟩, (7a) |Π⟩ = |N, L; (I, Sh) J; F, Se; Ft, MFt⟩ (7b) with complex coeﬃcients c and the quantum numbers explained in Refs. [20, 21, 28]. Note that the coeﬃcients 4 TABLE I: Material parameters used in the calculations. band gap energy Eg = 2.17208 eV [13] electron mass me = 0.99 m0 [73] spin-orbit coupling ∆ = 0 .131 eV [19] valence band parameters γ1 = 1.76 [19, 20] γ2 = 0.7532 [19, 20] γ3 = −0.3668 [19, 20] η1 = −0.020 [19, 20] η2 = −0.0037 [19, 20] η3 = −0.0337 [19, 20] lattice constant a= 0.42696 nm [74] dielectric constants",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S25",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "εs1 = 7.5 [75] εb1 = εs2 = 7.11 [75] εb2 = 6.46 [75] energy of Γ− 4 -LO phonons ℏωLO1 = 18.7 meV [48] ℏωLO2 = 87 meV [48] exchange energy J0 = 0.792 eV [28] central-cell correction V0 = 0.539 eV [28] here depend on the wave vector K, which enters the Hamiltonian (96). The index ν is a number to distin- guish the diﬀerent exciton states. Inserting the ansatz (7) in the Schr¨ odinger equation HΨ = EΨ and multiplying from the left with another basis state ⟨Π′|, we obtain a matrix representation of the Schr¨ odinger equation of the form Dc= EMc. (8) The vector c contains the coeﬃcients of the ansatz (7). All matrix elements",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S26",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "of H1 and H2, which enter the sym- metric matrices Dand M are given in the Supplemental Material [79]. The matrix elements of H0 are already given in the Appendices of Refs. [20] and [28]. The gen- eralized eigenvalue problem (8) can ﬁnally be solved using an appropriate LAPACK routine [80]. All material parameters used in the calculations are listed in Table I. III. OSCILLATOR STRENGTHS Having solved the generalized eigenvalue problem (8), one can directly calculate the relative oscillator strengths for the transitions from the ground state of the solid to the exciton states. In this section we will derive the ac- cording formulas for dipole and quadrupole transitions. The oscillator strength is strongly connected to the inter- action",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S27",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "between the excitons and photons. According to Ref. [7] the probability per unit time for a transition from the ground state Φ 0 of the semiconductor to an exciton state Ψστ vc,νK is proportional to |M|2 with M = ∫ Ψστ∗ vc,νK [ −e m0 A0 (κ,ξ) N∑ l=1 eiκrlpl ] Φ0dr1 ···drN. (9) Here A0 (κ,ξ) denotes the amplitude of the vector po- tential of the radiation ﬁeld with the wave vector κand the polarization ξ. N denotes the number of electrons with the coordinates rl. Within the scope of the simple band model the wave function of an exciton is given by Ψστ vc,νK = ∑ q fvcν (q) Φστ vc (q−γK, q+ αK) ,(10) where τ and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S28",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "−σ denote the spins of the electron and the hole, respectively. As we will discuss below, the spin orbit splitting in Cu 2O does not have a perceptible eﬀect on the oscillator strength. Hence, we will keep the derivation of the formula for the oscillator strength more simple by assuming a threefold degenerate Γ + 5 valence band and treating the electron spin and the hole spin separately. The envelope function fvcν (q) in Eq. (10) is the Fourier transform of the solution Fvcν (β) of the Wan- nier equation [5, 7], fvcν (q) = 1√ N ∑ β Fvcν (β) e−iqβ, (11) with ν denoting the diﬀerent exciton states. Note that the coordinate βis a lattice vector which in",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S29",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "general takes only discrete values [48]. This coordinate is identical to the relative coordinate rused in Sec. II in the continuum approximation. The wave function (10) contains a Slater determinant of Bloch functions with one electron being in a Bloch state of the conduction band andN−1 electrons in Bloch states of the valence bands: Φστ vc (kh, ke) = Aψvk1αψvk1β···ψvkhσψckeτ ···ψvkNβ. (12) Here Adenotes the antisymmetrization operator. With the ground state of the semiconductor Φ0 = Aψvk1αψvk1β···ψvkiαψvkiβ···ψvkNβ (13) we can express the exciton state (10) as ⏐⏐Ψστ vc,νK ⟩ = ∑ q fvcν (q) c† c(q+αK)τcv(q−γK)σ|Φ0⟩, (14) using creation and annihilation operators. The operator in square brackets in Eq. (9) can be written in second quantization as ∑ nn′ ∑",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S30",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "kk′ ∑ σ′τ′ −e m0 A0 (κ,ξ) × ⟨ ψn′k′τ′ ⏐⏐eiκrp ⏐⏐ψnkσ′ ⟩ c† n′k′τ′ cnkσ′ . (15) 5 After some transformations, using A0 (κ,ξ) = A0 (κ,ξ) ˆeξκ and neglecting Umklapp processes, we ar- rive at M = −eℏ m0 A0 (κ,ξ) Nδτσδκ,K ∑ q f∗ vcν (q) ∫ WSC dr × u∗ c(q+αK) (r) ˆeξκ [ (q−γK) uv(q−γK) (r) −i∇uv(q−γK) (r) ] (16) with an integral over the Wigner-Seitz cell (WSC) [81]. To obtain expressions for the dipole and quadrupole oscillator strength, we use k·pperturbation theory and keep all terms up to ﬁrst order in qand K. It is [48, 81] umk(r) ≈um0 (r) + ℏ m0 ∑ n̸=m k·pnm (Em −En)un0 (r) + ... (17) with pmn",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S31",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "= ⟨um0 |p|un0⟩ and the energy En = En(k= 0) of the band n at the Γ point. Due to the orthogonality of the Bloch functions, the ﬁrst summand in the integral of Eq. (16) vanishes up to ﬁrst order in q and K. We obtain M = − eℏ m2 0 A0 (κ,ξ) δτσδκ,K ∑ q f∗ vcν (q) ×[⟨uc0|ˆeξκ·p|uv0⟩ + ⟨uc0|(ˆeξκ·p) Mv(p·(q−γK)) |uv0⟩ + ⟨uc0|((q+ αK) ·p) Mc(p·ˆeξκ) |uv0⟩] , (18) where we deﬁned Mm = ∑ n̸=m |un0⟩⟨un0| (Em −En). (19) The sum over qcan be evaluated using 1√ N ∑ q qχ i fvcν (q) = (−i)χ ∂χ ∂βχ i Fvcν (β) ⏐⏐⏐⏐ β=0 (20) and we arrive at M = −eℏ m2 0 A0 (κ,ξ)",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S32",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "√ Nδτσδκ,K × lim r→0 [ ˆeξκ·pcvF∗ vcν (r) + ˆeξκ·( ˜Mv + ˜Mc) ·(i∇βF∗ vcν (r)) + ˆeξκ·(−γ ˜Mv + α ˜Mc) ·(F∗ vcν (r) K) ] , (21) where we replaced βwith rand deﬁned the matrices ˜Mv, ˜Mc with the components ( ˜Mv)ij = ⟨uc0|piMvpj|uv0⟩, (22a) ( ˜Mc)ij = ⟨uc0|piMcpj|uv0⟩. (22b) In Cu2O the ﬁrst term or pcv vanishes since valence and conduction band have the same parity. The term δτσ has to be replaced by √ 2δS,0 when using the eigenstates of the total spin S = Se + Sh = τ −σ [82]. The operators Mc and Mv are projection operators. For reasons of symmetry these operators transform ac- cording to the irreducible representation Γ +",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S33",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "1 of Oh. On the other hand, the operator p transforms according to Γ− 4 . The symmetry of the operator between the Bloch functions in Eq. (22) is therefore Γ− 4 ⊗Γ+ 1 ⊗Γ− 4 = Γ+ 1 ⊕Γ+ 3 ⊕Γ+ 4 ⊕Γ+ 5 . (23) The symmetry of the Bloch functions (without spin) is Γv ⊗Γc = Γ+ 5 ⊗Γ+ 1 = Γ+ 5 . (24) Hence, the expression requires that the operator has the symmetry Γ + 5 [83]. We can then consider the coupling coeﬃcients for the case Γ − 4 ⊗Γ− 4 →Γ+ 5 . With the basis functions |X⟩, |Y⟩, |Z⟩of Γ − 4 and the basis functions |˜X⟩= |YZ⟩, |˜Y⟩= |ZX⟩, and |˜Z⟩=",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S34",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "|XY⟩of Γ+ 5 , we see that, e.g., the Γ+ 5 like part of the products |X⟩1 |Y⟩2 and |Y⟩1 |X⟩2 transforms as |˜Z⟩/ √ 2. The other expressions are obtained via cyclic permutation [84]. In Sec. II we have introduced the quasi spin I = 1. If we compare the states |I, MI⟩with the three functions |uxy v0⟩, |uyz v0⟩, and |uzx v0⟩transforming according to Γ + 5 , it is [68] |1,+1⟩I = −(|uyz v0⟩+ i|uzx v0⟩) / √ 2, (25a) |1,0⟩I = |uxy v0⟩, (25b) |1,−1⟩I = + (|uyz v0⟩−i|uzx v0⟩) / √ 2. (25c) In the envelope function of the exciton the angular de- pendence is given by the spherical harmonics YLM. We know that in",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S35",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "Eq. (21) the gradient of the envelope func- tion at r = 0 is non-zero only if L = 1 holds. Further- more, the envelope function itself vanishes at r = 0 if L̸= 0 holds. Let us assume that the light is polarized in x-direction, i.e., ˆeξκ = ˆex. Let us furthermore write the function |ΨνK⟩of the exciton in the form of Eq. (7), where the spins, the envelope with the angular momentum L and the function of the hole with the quasi-spin I enter. The dipole-term in Eq. (21) is then proportional to 6 lim r→0 ⟨S = 0, MS = 0| ( ⟨uxy v0| ∂ ∂y + ⟨uzx v0| ∂ ∂z ) |ΨνK⟩ = lim r→0 ⟨S",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S36",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "= 0, MS = 0| ∂ ∂r ( ⟨I = 1, MI = 0|(−i) √ 3 8π(⟨L= 1, ML = 1|+ ⟨L= 1, ML = −1|) − i√ 2 (⟨I = 1, MI = −1|+ ⟨I = 1, MI = 1|) √ 3 4π⟨L= 1, ML = 0| ) |ΨνK⟩ = −i √ 3 4π lim r→0 ∂ ∂r (D⟨2, 1|+D ⟨2, −1|) |ΨνK⟩ (26) Here the state |Ft, MFt⟩D for the dipole transition ( D) is a short notation for |(Se, Sh) S, I; I+ S, L; Ft, MFt⟩= |(1/2, 1/2) 0, 1; 1, 1; Ft, MFt⟩, (27) in which the coupling scheme of the spins and angular momenta is diﬀerent from the one of Eq. (7b) due to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S37",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "the requirement that S must be a good quantum number: Se + Sh = S →(I + S) + L = Ft. As the quantization axis we choose the z-axis, which is parallel to one of the principal axes of the crystal lattice. In an analogous way, the quadrupole term can be written as lim r→0 ⟨S = 0, MS = 0|(⟨uxy v0|Ky + ⟨uzx v0|Kz) |ΨνK⟩ = lim r→0 ⟨S = 0, MS = 0| 1√ 4π⟨L= 0, ML = 0|(⟨I = 1, MI = 0|Ky − i√ 2 (⟨I = 1, MI = −1|+ ⟨I = 1, MI = 1|) Kz ) |ΨνK⟩ = lim r→0 1√ 4π ( Q⟨1, 0|Ky − i√ 2 (Q⟨1, −1|+Q ⟨1, 1|)",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S38",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "Kz ) |ΨνK⟩ (28) with the state |Ft, MFt⟩Q for the quadrupole transition ( Q) being a short notation for |(Se, Sh) S, I; I+ S, L; Ft, MFt⟩= |(1/2, 1/2) 0, 1; 1, 0; Ft, MFt⟩. (29) Note that this state is similar to the one of Eq. (27) but only L is set to zero. We ﬁnally arrive at the following expression for the relative oscillator strength: frel ξνK = ⏐⏐⏐⏐lim r→0 [ −i ( ˜M∗ v + ˜M∗ c ) ∂ ∂r⟨TD ξK|ΨνK⟩+ ( −γ ˜M∗ v + α ˜M∗ c ) K√ 6⟨TQ ξK|ΨνK⟩ ]⏐⏐⏐⏐ 2 . (30) For the dipole term in Eq. (30) the two states |TD ξK⟩ are given by |TD ξK⟩= 3∑",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S39",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "i=1 ˆeξKi|πD i ⟩, ξ = 1, 2 (31) with the three components of the polarization vector ˆeξK and three states which transform according to Γ − 4 [21]: |πD x ⟩= i√ 2 [|2, −1⟩D + |2, 1⟩D] , (32a) |πD y ⟩= 1√ 2 [|2, −1⟩D −|2, 1⟩D] , (32b) |πD z ⟩= i√ 2 [|2, −2⟩D −|2, 2⟩D] . (32c) The state |TQ ξK⟩in the quadrupole term of Eq. (30) reads |TQ ξK⟩= 3∑ i=1 ˆeξKi|πQ i ⟩, ξ = 1, 2 (33) with the three states which transform according to Γ+ 5 [21]: ⏐⏐πQ x ⟩ = ˆKy|1, 0⟩Q + ˆKz i√ 2 [ |1, −1⟩Q + |1, 1⟩Q ] , (34a) ⏐⏐πQ y ⟩ =",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S40",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "ˆKx|1, 0⟩Q 7 + ˆKz 1√ 2 [ |1, −1⟩Q −|1, 1⟩Q ] , (34b) ⏐⏐πQ z ⟩ = ˆKy 1√ 2 [ |1, −1⟩Q −|1, 1⟩Q ] + ˆKx i√ 2 [ |1, −1⟩Q + |1, 1⟩Q ] . (34c) If we now set K = 0 in Eq. (30), we see that we have derived the expression for the relative oscillator strength, which has already been used in Refs. [20, 21]. We can ﬁnally make an assumption as regards the size of the parameters ˜Mv and ˜Mc. Since in Cu 2O the up- permost valence bands as well as the lowermost conduc- tion band have positive parity, we see from Eq. (22) that only bands with negative parity",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S41",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "will contribute to the sums in Eq. (19). In Cu 2O there are only two bands of negative parity, which lie 449 meV above the lowest conduction band and 5 .6 eV below the highest conduc- tion band [48]. Hence, as regards the denominators of the form ( Em −En) in Mc and Mv the energy diﬀer- ence between the Γ + 7 and the Γ + 8 valence band due to the spin-orbit coupling is negligible small in comparion to the energy diﬀerence between these bands and the bands of negative parity. Thus, the spin-orbit coupling does not have a sizeable eﬀect on the oscillator strength. Furthermore, the denominator (Ec −En) in Mc is much smaller than the denominator",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S42",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "( Ev −En) in Mv and it is Mc ≫Mv. We therefore neglect Mv in this paper. As a consequence, to obtain absolute oscillator strengths, only one parameter η in the ﬁnal expression fξνK = η ⏐⏐⏐⏐lim r→0 [ −i ∂ ∂r⟨TD ξK|ΨνK⟩+ αK√ 6 ⟨TQ ξK|ΨνK⟩ ]⏐⏐⏐⏐ 2 (35) has to be determined via a comparison with experimental values. Note the speciﬁc form of Eq. (35), where the sum of dipole and quadrupole matrix element is squared. In contrast to the hydrogen-like model, inversion symmetry is broken when considering the more precise model of Cu2O. Hence, the exciton states are mixed-parity states and, thus, an interference term occurs. Especially for the 1S ortho exciton both terms in Eq. (35)",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S43",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "are of the same magnitude. The dipole term becomes equally large as the quadrupole term for K ̸= 0 due to a K dependent admixture of P excitons to the 1 S ortho exciton. Even though the parameter α occurs in Eq. (35), the whole expression is independent of its value. This is related to the fact that the wave function of the exciton also depends on α. In this paper we chooseKto be oriented in [001], [110], or [111] direction and, as in Ref. [21], we also rotate the coordinate system to make the z axis of the new coordi- nate system coincide with the direction ofK. The formu- las for the oscillator strengths for the three orientations of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S44",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "K [85] can be derived by analogy with Ref. [21]. The consideration of these three directions of high symmetry is suﬃcient to determine those parameters in Sec. VI, which are needed in the 5 ×5 matrix model to calculate the polariton dispersion for any other direction of K. IV. EXCITON-POLARITONS In this section we recapitulate the quantum mechanical theory of exciton-polaritons in Sec. IV A and discuss the rotating-wave approximation in Sec. IV B. To obtain the correct treatment of the K-dependent problem, we con- sider the nonanalytic exchange interaction in Sec. IV C. In Sec. IV D we shortly present the criteria for the ob- servability of polariton eﬀects. A. Polariton transformation The quantum mechanical theory of polaritons was",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S45",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "ﬁrst developed by Hopﬁeld, Fano, and Agranovich [56–58]. According to Refs. [56, 86, 87], the second-quantized Hamiltonian for the interaction of excitons and photons H = ∑ ξK [ ℏωξK ( a† ξKaξK + 1 2 ) + ∑ ν EνK ( B† νKBνK + 1 2 ) + i ∑ ν CξνK ( a† ξK + aξ−K )( BνK −B† ν−K ) + ∑ ν DξνK ( a† ξK + aξ−K )( aξK + a† ξ−K )] (36) can be derived either from a microscopic model of exci- tons with the Hamiltonian describing the interaction be- tween radiation and matter or from the equation of mo- tion for the exciton polarization. In the Hamiltonian (36) the operators B† νK",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S46",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "and BνK create and annihilate an ex- citon with energy EνK, respectivley, and obey Bose com- mutation rules in the following. Likewise, the operator a† ξK (aξK) creates (annihilates) a photon with polariza- tion ξ and energy ℏωξK = ℏcK/√εb2. The coupling coeﬃcients in the exciton-photon and the photon-photon interaction terms of Eq. (36) are given by CξνK = [κSIπβξνKE3 νK εb2ℏωξK ]1 2 (37) with κSI = 1/4πε0 and DξνK = C2 ξνK/EνK. (38) The polarizability βξνK is proportional to the oscillator strength of the exciton state. With our deﬁnition of the oscillator strength fξνK (cf. Refs. [65, 66, 70]) this pro- portionality is given by [86, 88, 89] βξνK = ε0εb2fξνK. (39) 8 The Hamiltonian (36) can be",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S47",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "diagonalized by the Hop- ﬁeld transformation [56, 57], which is similar to the Bo- golyubov’s uv transformation [90, 91]: New creation and annihilation operators p† µξK and pµξK are introduced via aξK = ∑ µ [ uµξKpµξK + v∗ µξ−Kp† µξ−K ] , (40a) BνK = ∑ µ [ uµξνKpµξK + v∗ µξν−Kp† µξ−K ] ,(40b) to obtain the polariton Hamiltonian H = ∑ µξK EµξKp† µξKpµξK + const. (41) with µand EµξK denoting the polariton branches and the polariton energies, respectively. The new operators must obey Bose commutation relations and the Hamiltonian shall be diagonal, i.e., [pµξK,H] = EµξKpµξK (42) must hold. This provides the following conditional equa- tion for the polariton energies [58, 87, 92]: ℏ2c2K2 E2 µξK",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S48",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "= εb2 + ∑ ν 4πκSIβξνK 1 −(EµξK/EνK)2 . (43) Using the phase convention of Hopﬁeld [56], the souli- tons for the coeﬃcients u and v of the polariton trans- formation can be obtained (see Ref. [87]). The polariton operators can also be expressed in terms of exciton and photon operators: pµξK = w(1) µξKaξK + w(2)∗ µξ−Ka† ξ−K + ∑ ν [ z(1) µξνKBνK + z(2)∗ µξν−KB† ν−K ] . (44) Since all creation and annihilation operators of the three (quasi-) particles obey Bose commutation relations, we can determine the coeﬃcients w and z by evaluating [ pµξK, a† ξK ] = +w(1) µξK = u∗ µξK, (45a) [ pµξK, aξ−K ] = −w(2)∗ µξK = v∗ µξK (45b)",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S49",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "and [ pµξK, B† ν−K ] = +z(1) µξνK = u∗ µξνK, (46a) [ pµξK, BνK ] = −z(2)∗ µξνK = v∗ µξνK. (46b) The coeﬃcients w(i) µξK or the sum WµξK = 2∑ i=1 |w(i) µξK|2 (47) then allow one to determine whether the polariton is more photon-like ( WµξK → 1) or more exciton-like (WµξK →0). B. Rotating-wave approximation In the literature polaritons are often treated within the so-called rotating-wave approximation [86]. In this case the term with the coeﬃcient D and the anti-resonant terms of the form aB and a†B† are neglected in the Hamiltonian (36). The resulting Hamiltonian H = ∑ ξK [ ℏωξKa† ξKaξK + ∑ ν EνKB† νKBνK + ∑ ν CξνK ( a†",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S50",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "ξKBνK + aξKB† νK )] (48) is then called the Jaynes-Cummings Hamiltonian [93], where the vacuum energy of the photons has also been neglected [86] and where the operators aξK have been replaced with iaξK. Note that this replacement does not change the physics of the problem since it only adds global phases to the occupation-number states. The occupation-number operator and the commutation rela- tions remain unchanged. The coeﬃcient CξνK can be written as [86, 89] CξνK = [κSIπβξνKE3 νK εb2ℏωξK ]1 2 ≈1 2 (K0 K )1 2 ℏΩR (49) with the wave vector at the exciton-photon resonance K0 = EνK0 √εb2/ℏc and the Rabi frequency ΩR = EνK0 √ 4πκSIβξνK εb2ℏ2 . (50) The rotating wave approximation is",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S51",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "generally valid if ℏΩR ≪EνK0 holds. This is, e.g., the case for anorganic semiconductors and especially for Cu 2O [89]. Close to the resonance ( K ≈K0) one can assume CξνK ≈ ℏΩR/2. Note that for K → 0 the coupling constant (49) diverges, which is a manifestation of the infrared catastrophe in quantum electrodynamics [86]. Hence, the simpliﬁcations made above are valid only in the vicinity of the exciton-photon resonance. Otherwise, the full Hamiltonian (36) has to be diagonalized. In the rotating-wave approximation the polariton transformation is more simple as there is no interaction between states with diﬀerent values of K. Using the ansatz pµξK = wµξKaξK + ∑ i zµξνiKBνiK, (51) the Bose commutation relations of the creation",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S52",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "and anni- hilation operators, and the condition (42) for the polari- ton operator, one ends up with the eigenvalue problem Pξ{ν}Kzµξ{ν}K = EµξKzµξ{ν}K (52) with 9 Pξ{ν}K =   ℏωξK 1 2 ℏΩR,ν1 1 2 ℏΩR,ν2 ··· 1 2 ℏΩR,νn ··· 1 2 ℏΩR,ν1 Eν1K 0 ··· 0 ··· 1 2 ℏΩR,ν2 0 Eν2K ... ... ... ... 0 ··· 1 2 ℏΩR,νn 0 ··· 0 EνnK ... ... ... ...   and zµξ{ν}K =   wµξK zµξν1K zµξν2K ... zµξνnK ...   . (53) Knowing the energiesEνK and the Rabi frequencies ΩR,ν of the exciton states, one can directly obtain the corre- sponding polariton energies by determining the eigenval- ues of Eq. (52). Finally, as",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S53",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "the polariton is a mixed state of a photon and excitons, one can again determine the photon-like part WµξK = |wµξK|2 (54) of the polariton or the contribution ZµξνK = |zµξνK|2 (55) of the exciton with the energy EνK to the polariton. C. Nonanalytic exchange interaction There is another interaction aﬀecting the exciton states: the nonanalytic (NA) exchange interaction. It is well known that the splitting caused by HNA exch is identi- cal to the longitudinal-transverse splitting (LT-splitting) when treating polaritons [94]. Hence, it is indispens- able to include the nonanalytic exchange interaction in the theory to obtain a correct treatment of the complete problem. In this section we will derive an expression for the non- analytic exchange interaction. We",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S54",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "start with the formula of Ref. [25] for the nonanalytic exchange energy between two exciton states Ψστ vc,νK and Ψσ′τ′ vc,ν′K′ in second quan- tization HNA exch = ∑ νν′K m∗ νKmν′K ε0εb2VucK2 B† νKBν′K (56) with the volume Vuc of one unit cell and mνK = δστ e√ N ∑ q fvcν (q) { − ℏ m0 K·pvc Ev −Ec + ℏ2 m2 0 ∑ n̸=v,c [[(q−γK) ·pvn] [(q+ αK) ·pnc] (Ev −En) (Ec −En) + [(q+ αK) ·pvn] [(q+ αK) ·pnc] (Ec −Ev) (Ec −En) + [(q−γK) ·pnc] [(q−γK) ·pvn] (Ev −Ec) (Ev −En) ]} . (57) Here mνK is a short notation for the function mvcν (K, 0) of Ref. [25]. For the deﬁnitions of Ψ στ",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S55",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "vc,νK, fvcν (q), and pmn see Sec. III. The exchange energy includes the term δστδσ′τ′ . Introducing the total spin S = Se + Sh = τ −σ of electron and hole, this term can be written for singlet and triplet states as 2 δS,0 [82]. Using Eq. (20) and rearranging the diﬀerent terms in Eq. (57) yields mνK = δστ eℏ2 m2 0 K (Ec −Ev) × lim r→0 [( ˜Nv + ˜Nc ) ·(−i∇rFvcν (r)) + ( −γ ˜Nv + α ˜Nc ) ·(Fvcν (r) K) ] (58) 10 with the matrices ˜Nv = ⟨uv0|pMv( ˆK·p) |uc0⟩, (59a) ˜Nc = ⟨uv0|( ˆK·p)Mcp|uc0⟩. (59b) and ˆK= K/K. Due to the similarity between Eq. (21) and Eq. (58), we can",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S56",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "perform the same calculation as in Sec. III to obtain mνK ∼ K lim r→0 [ −i ( ˜Mv + ˜Mc ) ∂ ∂r⟨LD K|ΨνK⟩ + ( −γ ˜Mv + α ˜Mc ) K√ 6⟨LQ K|ΨνK⟩ ] (60) with the states |LD K⟩= 3∑ i=1 ˆKi|πD i ⟩, |LQ K⟩= 3∑ i=1 ˆKi|πQ i ⟩, (61) where we have introduced ˆK= K/K. As in Sec. III we will assume Mc ≫Mv so that we can ﬁnally state that mνK is proportional to K lim r→0 [ −i ∂ ∂r⟨LD K|ΨνK⟩+ αK√ 6 ⟨LQ K|ΨνK⟩ ] . (62) We can see from Eq. (56) that there is no interaction between states with diﬀerent values of K, which is the same case",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S57",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "as for the Hamiltonian (48) of the polariton interaction in the rotating-wave approximation. Know- ing the exciton energies EνK and the corresponding wave functions |ΨνK⟩, we can simultaneously diagonalize the polariton Hamiltonian and the NA-exchange Hamilto- nian by solving the eigenvalue problem ( Pξ{ν}K + N{ν}K ) zµξ{ν}K = EµξKzµξ{ν}K (63) with the matrix N{ν}K = ζ εb2K2   0 0 0 ··· 0 ··· 0 m∗ ν1Kmν1K m∗ ν1Kmν2K ··· m∗ ν1KmνnK ··· 0 m∗ ν2Kmν1K m∗ ν2Kmν2K ... ... ... ... ··· 0 m∗ νnKmν1K ··· m∗ νnKmνnK ... ... ... ...   , (64) and the matrix Pξ{ν}K and vector zµξ{ν}K deﬁned in Eq. (53). The constant parameter ζ can be determined by the fact",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S58",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "that the splitting caused by HNA exch is identical to the LT-splitting. D. Observability of polariton eﬀects We now shortly discuss the criteria for the observabil- ity of polariton eﬀects, which were derived by Tait in Ref. [95]. To obtain these criteria, he included a damp- ing term Γ in the model of polaritons since damping is always present in the solid due to the interaction between excitons and phonons or the leakage of photons out of the solid [89]: ℏ2c2K2 E2 µξK = εb2 + ∑ ν 4πκSIβξνKE2 νK E2 νK −E2 µξK −iΓEµξK . (65) This equation can either be solved for a ﬁxed wave vector K or for a ﬁxed frequency ω= EµξK/ℏ. The ﬁrst case corresponds",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S59",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "to nonlinear optical exper- iments like, e.g., two-photon absorption. For this case a criterion of temporal coherence between the photon and the exciton can be derived [86, 95]. As long as ℏΓ <ℏ √ κSI π εb2 βξνKE2 νK0 = ℏ 2 ΩR (66) holds, where ℏΓ is the broadening of the linewidth due to damping, the polariton splitting is observable. This criterion can be interpreted in terms of Rabi oscillations, i.e., polariton eﬀects are observable if a coherent energy transfer between an exciton and a photon is possible at least once [89]. Spatial coherence is already provided here by keeping K ﬁxed [86]. The second case corresponds to reﬂectivity or absorp- tion experiments. Here the coupling between the photon",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S60",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "and the exciton must remain coherent during the prop- agation of the polariton through the solid in the pres- ence of damping [86]. The criterion of spatial coherence reads [86, 89, 96] ℏΓ < √ 16π Mc2 κSIE3 νK0 βξνK = ℏ 2 ΩR √ 16εb2 Mc2 EνK0 , (67) and it is generally more diﬃcult to satisfy than Eq. (73) [89, 97] since √ 16εb2EνK0 /Mc2 ≪1 holds for an exciton mass M on the order of m0 and an exciton 11 energy on the order of a few eV. The criterion (74) is equivalent to l≫λwith λdenoting the light wavelength and l = vg/Γ the mean free path of the exciton [86]. Hence, polariton eﬀects can hardly be",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S61",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "observed in semi- conductors with very shallow excitons, e.g., in GaAs [86], when using linear optical techniques. Therefore, polari- ton eﬀects are often investigated using nonlinear optical spectroscopic techniques due to the much less stringent criterion (73) [98, 99]. V. RESULTS INCLUDING VB STRUCTURE AND CENTRAL-CELL CORRECTIONS In this section we will treat the exciton-polaritons with 2 ≤n≤4 in Cu2O using the Hamiltonian which accounts for the valence band structure, the exchange interaction, the central-cell corrections, and the ﬁnite momentumℏK of the center of mass. For the three orientations [001], [110], and [111] of Kconsidered here the cubic symmetry Oh is reduced to C4v, C2v, and C3v, respectively [83]. Excitons of even and odd parity behave diﬀerently in dependence on",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S62",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "the momentum ℏK. On the one hand, states of the odd series having the symmetry Γ − 4 and a component with L = 1 show a ﬁnite dipole oscillator strength at K = 0. Since the angular momentum L is not a good quantum number in Cu 2O and P-like exci- ton states are admixed to other states of odd parity at K = 0 [28], P, F, H, ... states of symmetry Γ − 4 have a ﬁnite dipole oscillator strength. Hence, for these states already a splitting at K = 0 occurs due to the nonan- alytic exchange interaction and the exciton-photon cou- pling, which aﬀect the states of this symmetry. On the other hand, the even",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S63",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "exciton states do not have an oscillator strength at K = 0 and, therefore, no split- ting occurs. For those even states which have the symme- try Γ+ 5 and an L= 0-component at K = 0 the coupling to light via a ﬁnite K vector is possible. Since S-like ex- citon states are admixed to other states of even parity at K = 0 [28], S, D, G, ... states of symmetry Γ+ 5 obtain a ﬁnite quadrupole oscillator strength being proportional to K2. At ﬁrst, we will compare our numerical results for the relative oscillator strengths of the 1 S excitons with the absolute value from the experiment. This will allow us to calculate absolute oscillator strengths for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S64",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "all exciton states. Having determined the correct size of the nonana- lytic exchange interaction for thenP excitons and, hence, for all other exciton states, we can then investigate the dispersion of exciton-polaritons for the three orientations of K along the axes of high symmetry. Since the formula derived in Sec. III allows us only to calculate relative oscillator strengths frel ξνK but not abso- lute oscillator strengths for the diﬀerent polarizations ξ and exciton states νK, we determine the scaling factor η in fξνK = ηfrel ξνK (68) by comparing the theoretical results forfrel ξ1SK for the 1S exciton state at the exciton-photon resonance K = K0 with the experimentally obtained value of [65] fξ1SK = 3.6 ×10−9 (69) for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S65",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "K∥[110]. This yields η = 825.9. Knowing this scal- ing factor, we can give the absolute oscillator strengths of all exciton states in the following. With this value the oscillator strengths of, e.g., the nP excitons are given by fξnP K = 3.75 ×10−4 n2 −1 n5 . (70) For a complete description of the polariton problem, we also have to include the nonanalytic exchange interac- tion. The splitting caused by this interaction at K = 0 must exactly equal the LT-splitting due to the polari- ton transformation. As the rotating wave approximation does not hold for K →0, we determine at ﬁrst the po- lariton energies EµξK for the transverse exciton states via the conditional equation ℏ2c2K2 εb2E2 µξK",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S66",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "= 1 + ∑ ν fξνK 1 −(EµξK/EνK)2 , (71) which is obtained when using the complete exciton- photon interaction Hamiltonian [58, 87, 92]. The con- ditional equation (71) can be rewritten so that the po- lariton energies are the roots of the function F(EµξK) = 1 − ℏ2ω2 ξK E2 µξK + ∑ ν fνξKE2 νK E2 νK −E2 µξK , (72) where the photon energy ℏωξK = ℏKc/√εb2 is used. Note that a root of F(EµξK) is always located be- tween any neighboring pair of the exciton energies EνK, Eν+1 K [101–103]. We calculate the eﬀect of the nonanalytic exchange interaction on the longitudinal states for K →0 by di- agonalizing the matrix N{ν}K given in Eq. (64).",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S67",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "As the size of the nonanalytic exchange is a priori unknown, we have scaled the matrix N{ν}K, which describes this in- teraction, with a parameter ζ. We vary the parameter ζ in such a way that the energies of the longitudinal and transverse nP exciton states are identical. This yields ζ = 213.5 ±2.0. Of prime interest are now the polariton dispersions in the vicinity of the exciton phonon resonance. In this range of K the rotating wave approximation is valid and we solve the eigenvalue problem (63). Note that the er- rors arising due to the use of the rotating-wave approxi- mation are smaller than the error due to uncertainties in εb2. The numerical result for K∥[001] is shown",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S68",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "in Fig. 1. In the panels (a) we show the exciton spectrum in de- pendence on K = |K|. Since the changes in the energy in dependence on K are in the order of tens of µeV, the exciton states appear as straight horizontal lines. 12 FIG. 1: (a) The exciton energies EνK in dependence on K = |K|for K ∥[001]. Due to the inclusion of the complete valence band structure and the central cell corrections, the spectrum is much more complicated than in the hydrogen-like case (cf. Refs. [26, 100]). The colorbar shows the oscillator strengths for ξ = σ± z polarized light. For both polarizations the spectrum is identical. We denote from which states at K = 0",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S69",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "the exciton states originate (cf. Ref. [28]). For reasons of space we introduce the abbreviated notation Γ± i/j to replace Γ± i , Γ± j . The blue solid line gives the photon dispersion ℏωξK = ℏKc/√εb2. (b) Polariton dispersion obtained by solving the eigenvalue problem (63). Since the P excitons have a large oscillator strength, large avoided crossings can be observed. They clearly shift the position of the smaller avoided crossings for the 2 S, 3D and 4F excitons away from the position where the dispersion of light and the dispersion of these exciton states cross. (c) Photon-like part WµξK of the polariton states. In all cases the mixing of excitons and photons is strongest in the vicinity of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S70",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "an avoided crossing. Only for the P excitons an admixture of photons far away from the resonance occurs. The spectrum is much more complicated than when us- ing the hydrogen-like model of excitons, which was done in Refs. [26, 100]. Even for vanishing momentum of the center of mass, the complete valence band structure al- ready leads to a complicated ﬁne structure splitting and to a mixing of the exciton states with even or odd parity. This explains the observability of F excitons in absorp- tion spectra due to the admixture of P excitons [18, 20]. Due to the ﬁnite momentum of the center of mass S and D excitons also obtain a small oscillator strength. We state in the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S71",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "panels (a) of Fig. 1 from which states at K = 0 the exciton states originate using the nomen- 13 clature nLy/g(Γ± i ) of Ref. [28] with the abbreviations y and g for yellow and green. In the case of the P and F excitons we do not give the symmetry of the complete ex- citon state but only the combined symmetry of envelope and hole [18]. In the panels (b) we show the polariton dispersion. Only for the P excitons, which have a comparatively large oscillator strength, signiﬁcant deviations between the polariton spectrum and the exciton spectrum can be observed. The insets in the panels show that also for the other exciton states avoided crossings appear due to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S72",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "their ﬁnite oscillator strength. However, the panels (c), which show the photon-like part of the polariton states, indicate that the mixing between excitons and photons is small in these cases. Due to the proximity of the nS and nP states as well as that of the nF states, avoided crossings are not well- separated. Hence, the multi-polariton concept has to be used and a single-polariton concept would lead to dif- ferent results. The large avoided crossings of the P ex- citons clearly aﬀect the other avoided crossings as they shift them away from the position where the dispersion of light and the dispersion of the other exciton states cross. As regards the other orientations K ∥[110] or K ∥ [111]",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S73",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "of the momentum of center of mass the diﬀerences in the polariton spectra are slight. Since the K-dependent shift of the exciton energies is on the order of tens ofµeV, the exciton energies are almost the same for the three ori- entations of K considered. The main diﬀerence between the spectra for K ∥[001], K ∥[110] or K ∥[111] is the values of the oscillator strengths due to the diﬀerent symmetry breaking. Therefore, also the polariton disper- sions are diﬀerent, however, mainly in the vicinity of the avoided crossings [104]. Note that we do not show the polariton dispersion for exciton states with n≥5 since the number of states with a ﬁnite oscillator strength increases rapidly. However, the oscillator strengths",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S74",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "of the G, H, ... exciton states are very small so that polariton eﬀects are likewise very small. Hence, we do not expect to observe considerably new eﬀects for the exciton-polaritons with n≥5. Using the criteria of Tait [95] for temporal and spatial coherence presented in Sec. IV D, we can estimate the possible observability of the polariton eﬀects. If we set n= 2, the criterion of temporal coherence reads ℏΓ < ℏ 2 ΩR ≈6.4 meV. (73) For the criterion of spatial coherence, we obtain ℏΓ < ℏ 2 ΩR √ 16εb2 Mc2 EνK0 ≈0.11 meV (74) with the isotropic mass M ≈1.57m0 of the exciton and m0 denoting the free electron mass. In Ref. [13] the spec- trum",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S75",
      "paper_id": "arxiv:1711.04482v1",
      "section": "experiments",
      "text": "of the giant Rydberg excitons has been investigated in an absorption experiment and, thus, experimental val- ues of the exciton linewidthsℏΓ for the criterion of spatial coherence are known. For n = 2 the experimental line width is ℏΓ = 1 .58 meV [13, 15], which is signiﬁcantly larger than 0.11 meV. Therefore, we expect that the po- lariton eﬀects for the yellow exciton states with n≥2 in Cu2O may only be observed using nonlinear spectroscopy",
      "page_hint": null,
      "token_count": 76,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S76",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "1S ortho exciton state, the linewidth is small enough to clearly observe polariton eﬀects [65, 66, 70]. VI. YELLOW 1 S ORTHO EXCITON POLARITON We now come to the yellow 1 S ortho exciton polari- ton, for which a pronounced polariton eﬀect has been proven in experiments. In Sec. VI A we will discuss at ﬁrst the eﬀect of ﬁnite momentum of the center of mass ℏK ̸= 0 on the exciton spectrum. We will especially pay attention to the small quadrupole oscillator strength [65] and the K dependent splitting of this state [20, 67–69]. In Sec. VI B we set up a 5 ×5 matrix model, which al- lows us to calculate the anisotropic dispersion of the 1 S",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S77",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "ortho-exciton polariton for any direction of K. We then present in Sec. VI C the polariton dispersion, determine the group velocity [66, 70] as well as the spectra for ro- tations about the [1 ¯10] and the [111] axis and compare them with experimental values [67, 68]. A. K-dependent splitting As has already been stated in Sec. V, we have to con- sider the reduction of the irreducible representations of the cubic group Oh by the groups C4v, C2v, and C3v for the three cases of K being oriented along the [001], [110], or the [111] direction, respectively. In particular, for an exciton state having the symmetry Γ ± 5 at K = 0 degeneracies are lifted for K ̸=",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S78",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "0. We therefore observe a splitting of the 1 Sy(Γ+ 5 ) ortho exciton state depending on K when solving the full K- dependent Hamiltonian of excitons in Cu 2O. This split- ting is shown in Fig. 2. It was observed experimentally in Refs. [67–69] and originally discussed in terms of a K- dependent exchange interaction. However, a closer ex- amination of this interaction revealed that it is far too weak in Cu2O to describe the observed splitting [25]. In- stead, it could be shown that the eﬀects due to the cubic valence band structure lead to a K-dependent eﬀective mass and a K-dependent splitting of the 1 S ortho ex- citon [20]. Hence, the directional dispersion is the true",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S79",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "cause of the experimentally observed splitting. Note that in Ref. [20] the splitting was treated within a perturbation approach and it was already emphasized that the complete K-dependent Schr¨ odinger equation in- cluding the central cell corrections would have to be solved to obtain correct results. This has now been done. As the 1 S ortho exciton state exciton state has the symmetry Γ+ 5 for K = 0, we expect for K ∥[001] and 14 ∆ E [µ eV] [001], f+ 1S K 0 10 20 30 40 50(a) [110], f1 1S K (b) [111], f+ 1S K (c) ∆ E [µ eV] [001], f- 1S K 0 10 20 30 40 50 0.0 1.0 2.0 3.0 4.0 5.0",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S80",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "(d) K [107/m] [110], f2 1S K 0.0 1.0 2.0 3.0 4.0 5.0 (e) [111], f- 1S K fξ 1S K 0.0 1.0 2.0 3.0 4.0 5.0 10-11 10-10 10-9 10-8 (f) FIG. 2: Energy of the 1 Sy(Γ+ 5 ) ortho exciton state in dependence of K = |K|. We do not plot the absolute energies but the energy diﬀerence ∆ E = Eo 1S,K −Eo 1S,0 to show the small increase of the energy for K ̸= 0. The 1 S exciton obtains a ﬁnite oscillator strength for K ̸= 0, which increases quadratically with K. Furthermore, a K-dependent splitting of the three ortho exciton states can be observed. The green solid lines are the ﬁts of the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S81",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "eigenvalues of the Hamiltonian (75) to the numerical results. For further information see text. K ∥[111] a splitting into two degenerate and one non- degenerate state. For K ∥ [110] all degeneracies are lifted. This splitting can be described by the Hamiltonian Hdisp (K) =∆1   K2 0 0 0 K2 0 0 0 K2   +∆3   3K2 x −K2 0 0 0 3 K2 y −K2 0 0 0 3 K2 z −K2   +∆5   0 KxKy KxKz KxKy 0 KyKz KxKz KyKz 0  . (75) We can prove the consistency with this formula by diag- onalizing the Hamiltonian (75) for K∥[001], K∥[110], and K∥[111] and ﬁtting the resulting eigenvalues to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S82",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "our numerical results obtained with the full exciton Hamilto- nian (96). This is shown in Fig. 2. The values of the ﬁt parameters ∆1, ∆3, and ∆5 are given in Table II. Since we have only three independent parameters ∆i but seven exciton states to be ﬁtted, the consistency is proven by the fact that we obtain the same values of the parameters ∆i in all ﬁts. When performing the ﬁt, it is not necessary to account for the K-dependent nonanalytic exchange interaction. In the next section VI B a formula for the size of the nonanalytic exchange interaction of the 1 S exciton will be derived: ∆Q = 2f0E0/K2 0 . (76) TABLE II: Results for the three coeﬃcients",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S83",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "∆ i when ﬁtting the eigenvalues the Hamiltonian (75) to the theoretical spec- tra of Fig. 2 for the diﬀerent orientations of K. For the [001] and the [111] directions the values ∆ 5 and ∆3 cannot be de- termined, respectively. All results are given in 10 −14 µeV m2. For a comparison, we also list the experimentally determined values of Refs. [67–69]. For further information see text. [001] [110] [111] expt ∆1 1.727 1 .729 1 .728 1.074 ∆3 −0.156 −0.155 - −0.189 ∆5 - 0 .213 0 .213 0.292 Here f0 = 3 .6 ×10−9 and E0 denote the oscillator strength and the energy of the transverse exciton for K ∥[001] at the exciton-photon resonance K0, respec- tively.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S84",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "From the numerical results we obtain K0 = 2.614 ×107 1 m, E0 = 2.032 eV (77) and, therefore, ∆Q = 2.135 ×10−17 µeV m2. (78) Obviously, the nonanalytic exchange interaction is two to three orders of magnitude smaller than the anisotropic dispersion (cf. Table II). The experimentally observed splitting was described by the ansatz (75) as well [67–69]. When comparing the results, we have to note that the values of the ∆ i are given with respect to K0 and that the factor ∆ 1 of 15 Refs. [67–69] only describes the “exchange interaction,” i.e., the interaction without the spherically symmetric part of the kinetic energy. Therefore, we have to compare ∆1/K2 0 +ℏ2/2M, ∆3/K2 0 , and ∆5/K2",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S85",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "0 with our results of the parameters ∆i. Here M = me + me ≈1.64m0 is the value of the isotropic exciton mass used in Refs. [67–69]. Within our model the average mass of the 1 S ortho exciton is M = ℏ2 2K2 3 Tr [Hdisp (K)] = ℏ2 2∆1 = 2.2 m0, (79) which is signiﬁcantly larger than the sum M = me + mh = me + m0/γ1 ≈ 1.56m0 of the isotropic quasi- particle masses. However, there is a clear deviation from the experimentally determined value of M = (3.0 ± 0.2)m0 [105–107]. The disparity in the masses can be ex- plained by the fact that the electron and the hole are not bare particles but",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S86",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "polarize the surrounding lattice and are thus accompanied by clouds of longitudinal optical phonons [47]. Hence, in the experiment always polaron masses are measured which are larger than the bare par- ticle masses [47]. Although we accounted for this eﬀect via the Haken potential in the Hamiltonian, we already stated in Ref. [28] that there are some diﬃculties in ap- plying this theory to Cu 2O due to the existence of two optical phonons contributing to the Fr¨ ohlich interaction and the small distance between the electron and the hole in the exciton ground state, for which the Haken po- tential cannot describe the non-Coulombic electron-hole interaction. For the other two coeﬃcients ∆3 and ∆5 a good agree- ment is",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S87",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "obtained (see Table II), in particular, as re- gards the sign of the parameters. Note, however, that in Refs. [67–69] ∆ Q has been assumed to be of the same order of magnitude as the parameters ∆ i and that it has been included in the ﬁt of the experimental data. This aﬀects the values for ∆ 3 and ∆ 5 and is, therefore, an- other reason for the diﬀerence between the experimental and the theoretical values in Table II. Finally, diﬀerences between the experimental and the- oretical values of the parameters ∆ i could furthermore be explained by the neglection of polariton nature of the ortho exciton in Refs. [67–69], in terms of small strains in the crystal [68]",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S88",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "and uncertainties in the experimental values (cf. the large error bars in the ﬁgures of Ref. [67]). In particular, the fact that the experimental spectra are not identical when changing the angle of the laser beam by the same amount in opposite directions in Ref. [67] shows the presence of strains. We wish to note that also splittings in the same order of magnitude are obtained, e.g., for the 2P exciton state. However, these splittings cannot be observed experimen- tally due to the large linewidth of the 2 P exciton. B. 5 ×5 matrix model The yellow 1 S ortho exciton is well separated from the other exciton states regarding its energy. Hence, it can be treated separately from the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S89",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "other ones as regards polariton eﬀects.. In this section we set up a model with a 5 ×5 matrix, which allows calculating the dispersion of the 1S ortho exciton polariton for any direction of K close to the resonance ( K ≈K0). This model includes the two photon states with the polarization vectors ˆeξK and the three ortho exciton states Ψ i, which transform according to yz, zx and xy. First we will treat the oscillator strength and the Rabi frequency. Let us consider the most simple case with K ∥[001]. Due to group theoretical reasons, the three states Ψ yz, Ψ zx, and Ψ xy are good eigenstates of the Hamiltonian. The Ψ zx exciton interacts with the photon",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S90",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "in x polarization and the Ψ yz exciton interacts with the photon in y polarization. Let us denote the oscillator strength of these exciton states at the exciton-photon resonance by f0. For other orientations of Ksuperpositions of the form∑ iaiΨi are eigenstates of the Hamiltonian. From the expression (35) or especially from the form of the states |TQ ξK⟩(33) we can see that the K-dependent oscillator strength of these exciton states is given by f1S ξK = f0 ⏐⏐⏐⏐⏐⏐⏐   ˆeξK,yKz + ˆeξK,zKy ˆeξK,zKx + ˆeξK,xKz ˆeξK,xKy + ˆeξK,yKx  ·   ayz azx axy   ⏐⏐⏐⏐⏐⏐⏐ 2 (80) with the components ˆ eξK,i of the polarization vector ˆeξK. For states of symmetry Γ + 5 it",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S91",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "has been shown in Ref. [25] that the nonanalytic exchange interaction can be written as HNA exch (K) = ∆Q K2   K2 yK2 z K2 zKyKx K2 yKxKz K2 zKyKx K2 zK2 x K2 xKyKz K2 yKxKz K2 xKyKz K2 xK2 y  . (81) Contrary to dipole allowed excitons, the nonanalytic ex- change energy depends on the fourth power of the angu- lar coordinates of K. The prefactor ∆ Q is connected to the oscillator strength and can be determined for the 1 S state in the following way: For the special case of K be- ing oriented in [111] direction, the Γ+ 5 state splits into one longitudinal Γ1 and two transverse Γ 5 states. The",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S92",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "lon- gitudinal state is an eigenstate of the operator (81) with the eigenvalue ∆ Q/3. An excitation of the longitudinal exciton leads to an oscillating longitudinal polarization. Due to the Maxwell equation ∇· D = 0, the dielectric function must be zero. Hence, we have ε(ω, K0) [Γ1] = εb2 + 4 3 f0εb2 1 − ( E0 + 1 3 ∆QK2 0 )2 /(E0)2 = 0 (82) 16 [cf. also Eq. (71)]. Here E0 = ℏcK0/√εb2 is the energy of the Γ 1 exciton at K = K0 without the nonanalytic exchange interaction . Using f0 ≪ 1 [65, 66, 70], we obtain ∆Q = 2f0E0/K2 0 = 2f0ℏ2c2/εb2. (83) Combining all the Kdependent eﬀects for the 1Sortho exciton,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S93",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "we arrive at the Hamiltonian for the 1 S ortho exciton-polariton in the rotating-wave approximation: H= ( Hph Hexc−ph HT exc−ph Hexc ) (84) with the 2 ×2 matrix Hph containing the photon disper- sion, Hph = ℏcK√εb2 ( 1 0 0 1 ) = E0 K K0 ( 1 0 0 1 ) , (85) a 2 ×3 matrix Hexc−ph with the Rabi energies ℏΩR = E0 √f0, Hexc−ph = 1 2ℏΩR 1 K0 ( (ˆe1K,yKz + ˆe1K,zKy) (ˆe1K,zKx + ˆe1K,xKz) (ˆe1K,xKy + ˆe1K,yKx) (ˆe2K,yKz + ˆe2K,zKy) (ˆe2K,zKx + ˆe2K,xKz) (ˆe2K,xKy + ˆe2K,yKx) ) , (86) and Hexc = E0 1 + Hdisp (K) + HNA exch (K) , (87) where 1 is the 3 ×3 identity matrix. Note",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S94",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "that the Rabi energy depends on the square root of the oscillator strength [cf. Eq. (50)]. Hence, ques- tions about the sign of the terms (ˆ e1K,yKz + ˆe1K,zKy) in Eq. (86) may arise. However, for reasons of symmetry the terms must be linear in K. As the photon has neg- ative parity, i.e., since it transforms according to Γ − 4 in Oh, the terms have to change the sign if the direction of K is reversed. The eigenstates of the Hamiltonian (84) can be calcu- lated using an appropriate LAPACK routine [80]. C. Polariton dispersion As the 1 S ortho state shows a pronounced polariton eﬀect, we will now come to its dispersion, which can be calculated using",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S95",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "the 5 ×5 matrix model. For the subse- quent calculations we will use the parameters f0 = 3.6 ×10−9, E 0 = 2.0239 eV (88) of Ref. [65], which yields K0 = 2.618 ×107 1 m, ∆Q = 2.135 ×10−17 µeV m2, (89) and the average values of the theoretical results for the parameters ∆i in Table II. In Fig. 3 we ﬁrst present the results for K being ori- ented along one of the axes of high symmetry. The lon- gitudinal exciton states do not couple to photons and, therefore, their dispersion appears as almost horizontal lines. In particular, it can be seen that for K ∥[110] and light being polarized along ˆe2K no exciton-photon coupling occurs. For the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S96",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "transverse states we present the photon-like part for the two polarizations. In Ref. [66] the group velocity of the 1S ortho exciton- polariton has been measured as a function of the pho- ton energy for K ∥[110]. From the dispersion shown in Fig. 3(b) and (e), we can directly calculate the group velocity via vg = dω dK = 1 ℏ dE dK. (90) The result is shown in Fig. 4. It can be seen that the group velocity decreases on the lower polariton branch close to the resonance for increasing values of K. How- ever, for large values of K the polariton dispersion ap- proaches the exciton dispersion, which increases quadrat- ically in K, so that vg is then",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S97",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "proportional to K. Hence, there must be a minimum value of the group velocity. In the experiment group velocities as low as 40 km s could be measured [66]. However, it was not possible to mea- sure the complete dispersion. In particular, the region of very low group velocities is not experimentally accessible. From Eq. (90) and the theoretical results it is possible to calculate all group velocities. The minimum value of vg obtained in our calculations is vg,min = 1.5 km s . (91) at K = 2 .758 1 m . When comparing our result for the group velocity, i.e., Fig. 4(b), with the experimental re- sults of Ref. [66], a very good agreement can be observed. From",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S98",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "the results of the 5×5 matrix model it is also pos- sible to calculate the polarization vector of the photon- like part of the polariton or the orientation of the electric ﬁeld as ∑2 i=1 WµiKˆeiK and the polarization vector con- nected with the exciton-like part of the polariton via the 17 FIG. 3: Dispersion of the 1 S ortho exciton polariton calculated using the 5 ×5 matrix model. For the diﬀerent orientations of K we give the photon-like part WµξK for the two polarizations ξ. It can be seen that for K ∥[110] and light being polarized along ˆe2K no exciton-photon coupling occurs. We do not plot the absolute energies but the energy diﬀerence ∆ E = E−E0. For",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S99",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "further information see text. symmetric cross product of ˆeiK and K [cf. Eq. (80)] ac- cording to the group theoretical condition Γ+ 5 ⊗Γ− 4 →Γ− 4 . One obtains for ∆3 = ∆5 = 0 states with purely longitu- dinal or transverse polarization. However, in the general case, the states are mixed longitudinal-transverse states and the polarization is not parallel to the applied electri- cal ﬁeld. Another interesting point is the polariton energies if the crystal is rotated about the [1 ¯10] or the [111] axis (cf. Refs. [67–69]). In the case that the crystal is rotated about the [1 ¯10] plane, the K vector passes all three ori- entations of high symmetry from [001] to [111] and then",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S100",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "to [110]: K= K√ 2   sin ϕ sin ϕ√ 2 cosϕ  . (92) The polarization vectors are given by ˆe1K = 1√ 2   cos ϕ cos ϕ − √ 2 sinϕ  , ˆe2K = 1√ 2   1 −1 0  . (93) Independent of the angle ϕ the symmetry of the prob- lem is always Cs [84]. This group contains the iden- tity and a reﬂection at the plane with the normal vector ˆn= (1, −1, 0)/ √ 2, which is identical to one of the six σd reﬂections of Oh. The irreducible representations of Cs are either symmetric (Γ 1) or antisymmetric (Γ 2) under reﬂection. Hence, the complete problem falls",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S101",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "into two parts: The linear combinations Ψxy and (Ψzx+Ψyz)/ √ 2 of the ortho exciton states transform according to Γ 1 while the linear combination (Ψzx−Ψyz)/ √ 2 transforms according to Γ 2. Furthermore, photons transform in Cs also according to Γ 1 (ˆe1K) and Γ 2 (ˆe2K). Therefore, the problem decouples group theoretically in a Γ 1 prob- lem with three polariton branches and a Γ2 problem with only two polariton branches. We keep the amount of K ﬁxed at K = K0 and in- crease the angle ϕfrom 0◦to 90◦. The result is shown in Fig. 5(a) and (b). From the photon-like part of the po- laritons we can clearly see the decoupling of the problem. Furthermore, the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S102",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "expected degeneracies of the polariton states occur if Kis oriented in [001], [111] or [110] direc- tion. Especially the polariton dispersion for K ∥ [11¯2] (ϕ = arccos( −2/ √ 6)) is interesting as regards second harmonic generation (SHG) measurements. This disper- sion is shown in Fig. 6. SHG measurements are selective with respect to ω and K creating bulk polaritons with 2ω and 2K. This allows the excitation of polaritons on the upper polariton branch. The lower polariton branch is inaccessible since the total K-vector is too small. Due to symmetry reasons it is not possible to observe SHG for K being parallel to [001] or [110]. The SHG mea- surements in Ref. [71] were therefore performed in a",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S103",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "con- ﬁguration where K is parallel to [111] or [11 ¯2]. Espe- cially SHG measurements with K∥[11¯2] are interesting because there exist 3 hybrid polariton branches having a polarization within the (1 ,¯1,0)-plane. The polariton states on the upper and intermediate polariton branch are both accessible in SHG. Therefore, this is a situation where two exciton polaritons can get coherently excited 18 FIG. 4: (a) Group velocity vg (colorscale) of the 1S ortho exciton polariton with K ∥[110] and ˆe1K polarization in dependence on the energy diﬀerence ∆ E = E−E0 and the wave vector K. (b) and (c) The group velocity vg only in dependence on the energy diﬀerence ∆E = E−E0 for a comparison with Fig. 3 of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S104",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "Ref. [66]. The minimum value of vg depends on f0 and is given by vg,min = 1.5 km s . by means of the same nonlinear polarization P(2ω, 2K). The interference of both exciton polaritons should give rise to a polariton beat showing up in time resolved SHG measurements. Let us now discuss the rotation about the [111] axis. The [111] axis is a threefold axis, for which reason af- ter every 60 ◦ K is oriented in a direction of the form [110]. Between each two of these cases K is oriented in a direction of the form [112]. We have K= K√ 6   √ 3 cosϕ+ sinϕ − √ 3 cosϕ+ sinϕ −2 sinϕ  ,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S105",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "(94) and the polarization vectors ˆejK = 1 3√j   3j−4 + cosϕ− √ 3 sinϕ 3j−4 + cosϕ+ √ 3 sinϕ 3j−4 −2 cosϕ  , j = 1,2. (95) The resulting spectrum when varying the angle ϕ and keeping the amount of K ﬁxed at K = K0 is shown in Fig. 5(c) and (d). In the cases with K being of the form [110] only one exciton state is allowed for the polariza- tion vector of the form [001] and all exciton states are forbidden for the other polarization vector. Note, how- ever, that if we start with the conﬁguration K ∥[0¯10], ˆe1K ∥[00¯1], and ˆe1K ∥[110] of Ref. [67] and perform a rotation about the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S106",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "[111] axis, none of the polarization vectors is oriented in the [010] direction at ϕ= 60◦while K∥[10¯1] holds. Hence, only for ϕ= 0◦all exciton states are forbidden for the polarization ˆe2K in Fig. 5(c) and (d). In the cases with Kbeing of the form [112] all exciton states are allowed. Since the diﬀerence betweenK∥[1¯10] and K ∥[2¯1¯1] are only ∆ ϕ = 30◦, a rotation about the FIG. 5: (a), (b) Polariton energies at K = K0 when ro- tating the vector K in the plane with the normal vector ˆn = (1 , −1, 0)/ √ 2. Again, we only plot the energy diﬀer- ence ∆E = E−E0. The colorscale denotes the photon-like part of the polariton states. As",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S107",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "is discussed in the text, the problem decouples in two problems for the two irreducible representations Γ1 [panel (a)] and Γ2 [panel (b)] of the group Cs. (c), (d) Polariton energies at K = K0 when rotating K in the plane with the normal vector ˆn = (1, 1, 1)/ √ 3. Every 60◦ K is oriented in a direction of high symmetry. [111] axis with ϕ= 4◦ already shows a signiﬁcant eﬀect on the spectrum as can be seen especially from Fig. 5(d). Exactly for this case with ϕ = 4 ◦ and the polariza- tion ˆe2K the transmission spectrum of the ortho exciton- polariton is shown in Fig. 2(c) of Ref. [67]. The shape of the transmission spectrum",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S108",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "of is clearly aﬀected by polari- 19 ∆ E [µ eV] K-K0 [104/m] Wµ 2K 8.0 10.0 12.0 14.0 16.0 -10 -5 0 5 10 10-3 10-2 10-1 100 ∆ E [µ eV] K-K0 [104/m] Wµ 2K 8.0 10.0 12.0 14.0 16.0 -10 -5 0 5 10 FIG. 6: Same as Fig. 3 but for K ∥ [11¯2], i.e., for ϕ = arccos(−2/ √ 6) in Eqs. (92) and (93). In panel (a) there are three hybrid polariton branches having a polarization within the (1,¯1,0)-plane. This is in contrast to the directions of high symmetry, where only two polariton branches occur. For fur- ther information see text. ton dispersion. Photons with K∥[¯110] and ˆeξK ∥[110] do not interact with the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S109",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "ortho exciton. Tilting the K- vector by 4◦leads to a very weak exciton photon interac- tion so that the two of the excitons show up in this ﬁgure as two extremely narrow absorption peaks. The prod- uct of Rabi frequency and exciton lifetime is however so low that these states are excitons rather than polaritons. This explains the sharp absorption lines with a line width of less than 1 µeV. The third quadrupole-allowed state is responsible for the comparatively broad absorption line observed in [001] polarization. This state is in contrast to the other ones a perfect polariton. The much broader line width of 20 µeV is caused by polariton dispersion. If single photon spectroscopy was K-selective, this exciton polariton",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S110",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "would show up with a similar small line width as is in the pure exciton case. For a comparison with the experiment, we calculate the polariton dispersion for diﬀerent values of K and keeping ϕ ﬁxed to ϕ= 4◦. The result is shown in Fig. 7. It can be seen that for the polarization ˆe2K two states have a signiﬁcant photon amplitude. Hence, these are the two states, which could be observed as very narrow lines in the experimental transmission spectrum [67]. However, while in the experiment the energy diﬀerence between the two states is about 4 µeV, we obtain only 2 .4 µeV. We can exclude uncertainties in the parameter ∆1 or the angle ϕ since a variation of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S111",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "these parameters does not change the size of the splitting. Only a variation of ∆ 3 and ∆5 changes the size of the splitting. However, even if we set these parameters to the experimentally deter- mined values listed in Table II, the splitting increases only to 3 .0 µeV. As we have already stated above, the presence of small strains in the crystal cannot be ex- cluded. These may be the major reason for the observed discrepancy. Of course, it is also possible that the positions of the transmission maxima in the experiment are not exactly given by the positions of the avoided crossings. In this ∆ E [µ eV] [112-], Wµ 1K 0 10 20 30(a)∆ E [µ eV]",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S112",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "K-K0 [104/m] [112-], Wµ 2K Wµξ K 0 10 20 30 -2.0 -1.0 0.0 1.0 2.0 10-4 10-3 10-2 10-1 100 (b) FIG. 7: Polariton energies for the vector K given by Eq. (94) with ϕ = 4◦ and its amount is varied. Again, we only plot the energy diﬀerence ∆ E = E−E0. The colorscale denotes the photon-like part of the polariton states. case, one would have to calculate the transmission spec- trum for the polariton dispersion using Pekar’s boundary conditions [108]. This is likewise diﬃcult and beyond the scope of this work. Despite all that, we obtain a good qualitative agreement with the experiment. VII. SUMMARY AND OUTLOOK We presented the theory of exciton-polaritons in Cu2O. In the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S113",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "derivation of the formulas we accounted for all rel- evant eﬀects which are needed to describe the spectra theoretically in an appropriate way, i.e., the complete valence-band structure, the exchange interaction, and the central-cell corrections [28]. This leads to a likewise com- plicated expression for the momentum-dependent Hamil- tonian of excitons. Our method of solving the corre- sponding Schr¨ odinger equation allows calculating dipole and quadrupole oscillator strengths, for which general formulas have been derived. The subsequent polariton transformation can be performed within the so-called rotating-wave approximation. Within this approxima- tion it is straightforward to additionally account for the nonanalytic exchange interaction. We have treated the dispersion of polaritons in Cu 2O using a multi-polariton concept. When considering the correct",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S114",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "model of excitons in Cu 2O, all states which have 20 the symmetry Γ+ 5 for K = 0 obtain a ﬁnite K-dependent oscillator strength, i.e., S, D, G, and higher excitons. The more complex spectrum of excitons when using the full Hamiltonian leads to a more complex polariton dis- persion than in previous works [26, 100]. We also esti- mated that polariton eﬀects for the yellow exciton states with n ≥2 may only be observed using nonlinear spec- troscopy methods and high quality crystals. When including the complete valence band structure, a K-dependent splitting of the three components of the yellow 1S ortho exciton appears. In contrast to Ref. [20], we have solved the complete K-dependent Schr¨ odinger equation",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S115",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "numerically including also the correct values for the central-cell corrections of Ref. [28]. The splittings calculated are on the same order of magnitude as the splittings observed experimentally [67–69]. As the exciton ground state is well separated from the other exciton states, it can be treated separately as re- gards polariton eﬀects. Exploiting the symmetry prop- erties of the 1 S ortho exciton, we were able to set up a 5 ×5 matrix model, which allows for the calculation of the corresponding polariton dispersion for any direction of K. Using the 5 ×5 matrix model, we investigated the dispersion of the 1 S ortho exciton polariton for dif- ferent orientations of K. In a comparison of the results for the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S116",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "group velocity with experimental results we ob- tained a very good agreement. The calculations allowed us to determine the minimum value of the group veloc- ity, which is not directly accessible in the experiment, to vg,min = 1 .5 km s . We also presented results for the two special cases that the K-vector is rotated in planes per- pendicular to [1 ¯10] and [111]. Especially in the second case, another comparison with experimental results was possible for a rotation angle of 4◦. The splitting between the two allowed states obtained is smaller than in the experiment. This can, however, be explained in terms of the presence of small strains and uncertainties in the parameters ∆i. As a next step,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S117",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "it is possible to calculate transmission spectra from the polariton dispersion obtained via the 5 ×5 matrix model by assuming Pekar’s boundary con- ditions [108] and applying the Fresnel equations. This would allow for an even better comparison of theoreti- cal results with the experiment and may also lead to an understanding of the shape of the peaks in the spectra. Furthermore, we plan to investigate exciton spectra in an external magnetic ﬁeld in Voigt conﬁguration, where, in contrast to the Faraday conﬁguration of Ref. [21], a ﬁnite value of the wave vector K must be considered. Acknowledgments F.S. is grateful for support from the Landes- graduiertenf¨ orderung of the Land Baden-W¨ urttemberg. [1] J. A. Frenkel, Phys. Rev. 37,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S118",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "17 (1931). [2] J. A. Frenkel, Phys. Rev. 37, 1276 (1931). [3] J. A. Frenkel, Phys. Z. Sowjetunion 9, 533 (1936). [4] R. Peierls, Annalen der Physik 405, 905 (1932). [5] G. H. Wannier, Phys. Rev. 52, 191 (1937). [6] E. F. Gross and I. A. Karryjew, Dokl. Akad. Nauk. SSSR 84, 471 (1952). [7] R. S. Knox, Theory of excitons , vol. 5 of Solid State Physics Supplement (Academic, New York, 1963). [8] V. T. Agekyan, phys. stat. sol. (a) 43, 11 (1977). [9] V. M. Agranovich and V. L. Ginzburg, Crystal Optics with spatial Dispersion and Excitons (Springer, Berlin, 1984). [10] G. L. Rocca, in Electronic Excitations in Organic Based Nanostructures, edited by V. M. Agranovich and G.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S119",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "F. Bassan (Elsevier, Amsterdam, 2003), vol. 31 ofThin Films and Nanostructures, pp. 97–128. [11] A. Stahl and I. Balslev, Electrodynamics of the Semicon- ductor Band Edge (Springer, Berlin, 1987). [12] G. Czajkowski, F. Basani, and L. Silvestri, Riv. Nuovo Cimento 26, 1 (2003). [13] T. Kazimierczuk, D. Fr¨ ohlich, S. Scheel, H. Stolz, and M. Bayer, Nature 514, 343 (2014). [14] M. Aßmann, J. Thewes, D. Fr¨ ohlich, and M. Bayer, Na- ture Mater. 15, 741 (2016). [15] F. Schweiner, J. Main, and G. Wunner, Phys. Rev. B 93, 085203 (2016). [16] P. Gr¨ unwald, M. Aßmann, J. Heck¨ otter, D. Fr¨ ohlich, M. Bayer, H. Stolz, and S. Scheel, Phys. Rev. Lett. 117, 133003 (2016). [17] M. Feldmaier, J.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S120",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "Main, F. Schweiner, H. Cartarius, and G. Wunner, J. Phys. B: At. Mol. Opt. Phys. 49, 144002 (2016). [18] J. Thewes, J. Heck¨ otter, T. Kazimierczuk, M. Aßmann, D. Fr¨ ohlich, M. Bayer, M. A. Semina, and M. M. Glazov, Phys. Rev. Lett. 115, 027402 (2015), and Supplementary Material. [19] F. Sch¨ one, S. O. Kr¨ uger, P. Gr¨ unwald, H. Stolz, S. Scheel, M. Aßmann, J. Heck¨ otter, J. Thewes, D. Fr¨ ohlich, and M. Bayer, Phys. Rev. B 93, 075203 (2016). [20] F. Schweiner, J. Main, M. Feldmaier, G. Wunner, and Ch. Uihlein, Phys. Rev. B 93, 195203 (2016). [21] F. Schweiner, J. Main, G. Wunner, M. Freitag, J. Heck¨ otter, Ch. Uihlein, M. Aßmann, D. Fr¨ ohlich,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S121",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "and M. Bayer, Phys. Rev. B 95, 035202 (2017). [22] F. Schweiner, J. Main, and G. Wunner, Phys. Rev. Lett. 118, 046401 (2017). [23] J. Heck¨ otter, M. Freitag, D. Fr¨ ohlich, M. Aßmann, M. Bayer, M. A. Semina, and M. M. Glazov, Phys. Rev. B 95, 035210 (2017). [24] S. Zieli´ nska-Raczy´ nska, D. Ziemkiewicz, and G. Cza- jkowski, Phys. Rev. B 95, 075204 (2017). [25] F. Schweiner, J. Main, G. Wunner, and Ch. Uihlein, Phys. Rev. B 94, 115201 (2016). [26] S. Zieli´ nska-Raczy´ nska, G. Czajkowski, and D. Ziemkiewicz, Phys. Rev. B 93, 075206 (2016). [27] S. Zieli´ nska-Raczy´ nska, D. Ziemkiewicz, and G. Cza- jkowski, Phys. Rev. B 94, 045205 (2016). [28] F. Schweiner, J. Main,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S122",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "G. Wunner, and Ch. Uihlein, 21 Phys. Rev. B 95, 195201 (2017). [29] F. Schweiner, J. Main, and G. Wunner, Phys. Rev. E 95, 062205 (2017). [30] F. Schweiner, P. Rommel, J. Main, and G. Wunner, Phys. Rev. B 96, 035207 (2017). [31] F. Sch¨ one, H. Stolz, and N. Naka, Phys. Rev. B 96, 115207 (2017). [32] M. Kurz, P. Gr¨ unwald, and S. Scheel, Phys. Rev. B 95, 245205 (2017). [33] D. Semkat, S. Sobkowiak, F. Sch¨ one, H. Stolz, Th. Koch, and H. Fehske, arXiv:1705.08769 (2017). [34] T. Stielow, S. Scheel, and M. Kurz, arXiv:1705.10527 (2017). [35] J. Heck¨ otter, M. Freitag, D. Fr¨ ohlich, M. Aßmann, M. Bayer, M. A. Semina, and M. M. Glazov, Phys.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S123",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "Rev. B 96, 125142 (2017). [36] H. Stolz, F. Sch¨ one, and D. Semkat, arXiv:1709.00895 (2017). [37] R. Huber, B. A. Schmid, Y. R. Shen, D. S. Chemla, and R. A. Kaindl, Phys. Rev. Lett. 96, 017402 (2006). [38] A. Baldereschi and N. O. Lipari, Phys. Rev. B 3, 439 (1971). [39] A. Baldereschi and N. O. Lipari, Phys. Rev. B 9, 1525 (1974). [40] A. Baldereschi and N. O. Lipari, Phys. Rev. B 8, 2697 (1973). [41] N. O. Lipari and M. Altarelli, Phys. Rev. B 15, 4883 (1977). [42] M. Altarelli and N. O. Lipari, Phys. Rev. B 15, 4898 (1977). [43] K. Suzuki and J. C. Hensel, Phys. Rev. B 9, 4184 (1974). [44] H. Haken, Il",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S124",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "Nuovo Cimento 3, 1230 (1956). [45] H. Haken, in Halbleiterprobleme IV, edited by W. Schot- tky (Vieweg, Berlin, 1957), pp. 1–48. [46] H. Haken and W. Schottky, Z. Phys. Chem. 16, 218 (1958). [47] C. F. Klingshirn, Semiconductor Optics (Springer, Berlin, 2007), 3rd ed. [48] G. M. Kavoulakis, Y.-C. Chang, and G. Baym, Phys. Rev. B 55, 7593 (1997). [49] C. G. Kuper and G. D. Whiteﬁeld, eds., Polarons and Excitons (Oliver and Boyd, Edinburgh, 1963). [50] J. T. Devreese and F. Peeters, eds., Polarons and Exci- tons in Polar Semiconductors and Ionic Crystals , vol. 108 of NATO ASI Ser. B (Plenum Press, New York, 1984). [51] K. Cho, Phys. Rev. B 14, 4463 (1976). [52] U. R¨ ossler",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S125",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "and H.-R. Trebin, Phys. Rev. B 23, 1961 (1981). [53] H. Fr¨ ohlich, Advances in Physics3, 325 (1954). [54] J. Bardeen and W. Shockley, Phys. Rev. 80, 72 (1950). [55] Y. Toyozawa, J. Phys. Chem. Solids 25, 59 (1964). [56] J. J. Hopﬁeld, Phys. Rev. 112, 1555 (1958). [57] U. Fano, Phys. Rev. 103, 1202 (1956). [58] V. M. Agranovich, Sov. Phys. JETP 10, 307 (1960). [59] J. J. Hopﬁeld, Phys. Rev. 112, 1555 (1958). [60] J. J. Hopﬁeld and D. G. Thomas, Phys. Rev. 132, 563 (1963). [61] J. B. R. Claus, L. Merten, Light Scattering by Phonon Polaritons, vol. 75 of Springer Tracts Mod. Phys. (Springer, Berlin, 1975). [62] V. M. Agranovich and V. L. Ginzburg, Crystal Optics",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S126",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "with Spatial Dispersion, and Excitons , vol. 42 of Springer Series in Solid State Sciences (Springer, Berlin, 1984), 2nd ed. [63] B. H¨ onerlage, R. L´ evy, J. B. Grun, C. Klingshirn, and K. Bohnert, Phys. Rep. 124, 161 (1985). [64] C. Klingshirn, in Ultrafast Dynamics of Quantum Sys- tems: Physical Processes and Spectroscopic Techniques , edited by B. D. Bartolo (Plenum Press, New York, 1998), vol. 372 of NATO ASI Ser. B , pp. 143–211. [65] D. Fr¨ ohlich, A. Kulik, B. Uebbing, A. Mysyrowicz, V. Langer, H. Stolz, and W. von der Osten, Phys. Rev. Lett. 67, 2343 (1991). [66] D. Fr¨ ohlich, G. Dasbach, G. Baldassarri, H. von H¨ ogersthal, M. Bayer, R. Klieber, D. Suter, and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S127",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "H. Stolz, Solid State Commun. 134, 139 (2005). [67] G. Dasbach, D. Fr¨ ohlich, H. Stolz, R. Klieber, D. Suter, and M. Bayer, Phys. Rev. Lett. 91, 107401 (2003). [68] G. Dasbach, D. Fr¨ ohlich, R. Klieber, D. Suter, M. Bayer, and H. Stolz, Phys. Rev. B 70, 045206 (2004). [69] G. Dasbach, D. Fr¨ ohlich, H. Stolz, R. Klieber, D. Suter, and M. Bayer, phys. stat. sol (c) 2, 886 (2005). [70] D. Fr¨ ohlich, J. Brandt, C. Sandfort, M. Bayer, and H. Stolz, phys. stat. sol. (b) 243, 2367 (2006). [71] J. Mund, D. Yakovlev, D. Fr¨ ohlich, and M. Bayer (2017), to be published. [72] M. A. Kanehisa, Physica B+C 117-118, 275 (1983). [73] J. W. Hodby,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S128",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "T. E. Jenkins, C. Schwab, H. Tamura, and D. Trivich, J. Phys. C: Solid State Phys. 9, 1429 (1976). [74] H. E. Swanson and R. K. Fuyat, NBS Circular 539, II:23 (1953). [75] O. Madelung and U. R¨ ossler, eds., Landolt-B¨ ornstein, vol. 17 a to i, 22 a and b, 41 A to D of New Series, Group III (Springer, Berlin, 1982-2001). [76] A. R. Edmonds, Angular momentum in quantum me- chanics (Princeton University Press, Princeton, 1960). [77] Ch. Uihlein, D. Fr¨ ohlich, and R. Kenklies, Phys. Rev. B 23, 2731 (1981). [78] J. Broeckx, Phys. Rev. B 43, 9643 (1991). [79] See Supplemental Material, for explicit expressions ofH0, H1, and H2 as well as the matrix elements of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S129",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "H1 and H2, which enter the symmetric matrices D and M. [80] E. Anderson, Z. Bai, C. Bischof, S. Blackford, J. Demmel, J. Dongarra, J. D. Croz, A. Greenbaum, S. Hammarling, A. McKenney, et al., LAPACK Users’ Guide (Society for Industrial and Applied Mathematics, Philadelphia, PA, 1999), 3rd ed. [81] U. R¨ ossler,Solid State Theory (Springer, Berlin, 2009), 2nd ed. [82] Y. Toyozawa, Optical processes in solids(Cambridge Uni- versity Press, Cambridge, 2003). [83] A. Abragam and B. Bleaney, Electron Paramagnetic Resonance of Transition Ions (Clarendon Press, Oxford, 1970). [84] G. F. Koster, J. O. Dimmock, R. G. Wheeler, and H. Statz, Properties of the Thirty-Two Point Groups (M.I.T. Press, Cambridge, MA, 1963). [85] For the detailed derivation of the formulas",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S130",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "for the os- cillator strengths for the three orientations of K see the Supplemental Material. [86] L. C. Andreani, in Strong Light-Matter Coupling: From Atoms to Solid-State Systems , edited by A. Auﬀ` eves, D. Gerace, M. Richard, S. Portolan, M. F. Santos, L. C. Kwek, and C. Miniatura (World Scientiﬁc, Singapore, 2014), pp. 37–82. [87] W. C. Tait and R. L. Weiher, Phys. Rev. 178, 1404 (1969). [88] J. Schmutzler, D. Fr¨ ohlich, and M. Bayer, Phys. Rev. B 22 87, 245202 (2013). [89] J. Schmutzler, Ph.D. thesis, Technische Universit¨ at Dort- mund (2014). [90] N. N. Bogolyubov, Nuovo Cimento 7, 794 (1958). [91] N. N. Bogolyubov, J. Phys. USSR 11, 23 (1947). [92] C. Mavroyannis, J. Math. Phys.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S131",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "8, 1515 (1967). [93] E. T. Jaynes and F. W. Cummings, Proceedings of the IEEE 51, 89 (1963). [94] M. Born and K. Huang, Dynamical Theory of Crystal Lattices (Oxford University Press, London, 1954). [95] W. C. Tait, Phys. Rev. B 5, 648 (1972). [96] V. A. Kiselev, B. S. Razbirin, and I. N. Uraltsev, phys. stat. sol. (b) 72, 161 (1975). [97] D. D. Sell, S. E. Stokowski, R. Dingle, and J. V. DiLorenzo, Phys. Rev. B 7, 4568 (1973). [98] D. Fr¨ ohlich, inNonlinear Spectroscopy of Solids:Advances and Applications, edited by B. Di. Bartolo and B. Bowlby (Plenum Press, New York, 1994), vol. 339 of Series B, pp. 289–326. [99] D. Fr¨ ohlich, St. Kirchhoﬀ, P. K¨ ohler,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S132",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "and W. Nieswand, Phys. Rev. B 40, 1976 (1989). [100] J. Ertl, Bachelor thesis, Universit¨ at Stuttgart (2017). [101] N. J. Stor, I. Slapniˇ car, and J. L. Barlow, Lin. Alg. Appl. 464, 62 (2015). [102] C. F. Borges and W. B. Gragg, in Numerical Linear Algebra and Scientiﬁc Computing , edited by L. Reichel, A. Ruttan, and R. S. Varga (de Gruyter, Berlin, 1993), pp. 11–29. [103] D. P. O’Leary and G. W. Stewart, J. Comput. Phys. 90, 497 (1990). [104] See Supplemental Material, which includes the polariton dispersions for K ∥[110] and K ∥[111]. [105] P. Y. Yu and Y. R. Shen, Phys. Rev. B 12, 1377 (1975). [106] D. W. Snoke, D. Braun, and M. Cardona, Phys.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S133",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "Rev. B 44, 2991 (1991). [107] P. Y. Yu and Y. R. Shen, Phys. Rev. Lett. 32, 939 (1974). [108] S. I. Pekar, Soviet Phys. JETP 6, 785 (1958). SUPPLEMENTARY INFORMATION VIII. HAMILTONIAN AND MATRIX ELEMENTS In the paper the Hamiltonian of excitons has been writ- ten in the form H = H0 + (ℏK) H1 + (ℏK)2 H2. (96) We now give in Secs. VIII A-VIII C the expressions for H0, H1 and H2 in terms of irreducible tensors for the case that the wave vector K is oriented in [001], [110] or [111] direction [1–4]. Note that we rotate the coordinate system to make the quantization axis or z axis coincide with the direction of K. Hence, we",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S134",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "rotate the coordinate system by the Euler angles ( α, β, γ) = (π, π/2, π/4) for K∥[110] and by ( α, β, γ) = ( 0, arccos(1/ √ 3), π/4 ) for K∥[111]. The ﬁrst-order and second-order tensor operators used in the following correspond, as in Ref. [3], to the vector operators r, p, I, Sh and to the second-rank Cartesian operators Imn = 3 {Im, In}−δmnI2, (97a) Pmn = 3 {pm, pn}−δmnp2, (97b) respectively. We also use the abbreviation D(2) k = [ I(1) ×S(1) h ](2) k . (98) The coeﬃcients γ′ 1, µ′and δ′are given by [2, 5] γ′ 1 = γ1 + m0 me , µ ′= 6γ3 + 4γ2 5γ′ 1 , δ ′=",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S135",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "γ3 −γ2 γ′ 1 , (99) and we deﬁne by analogy [4] ν = 6η3 + 4η2 5η1 , τ = η3 −η2 η1 . (100) In Sec. VIII D we then give the matrix elements of the terms of the Hamiltonian in the basis |Π⟩ = |N, L; (I, Sh) J; F, Se; Ft, MFt⟩in Hartree units using the formalism of irreducible tensors [1]. The matrix ele- ments of the ﬁrst part H0 of the Hamiltonian are given in the Appendices of Refs. [4, 6]. The functions of the form (R1)j NL and the quantities IN′ L′;NL are taken from the Appendix of Ref. [4]. A. Wave vector in [001] direction H0 = Eg − e2 4πε0ε 1 r",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S136",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "− e2 4πε0r [ 1 2ε∗ 1 ( e−r/ρh1 + e−r/ρe1 ) + 1 2ε∗ 2 ( e−r/ρh2 + e−r/ρe2 )] + 2 3∆ ( 1 + 1 ℏ2 I(1) ·S(1) h ) + [ −V0 + J0 (1 4 − 1 ℏ2 S(1) e ·S(1) h )] Vucδ(r) 23 + γ′ 1 2ℏ2m0 { ℏ2p2 −µ′ 3 ( P(2) ·I(2) ) +δ′ 3 (∑ k=±4 [ P(2) ×I(2) ](4) k + √ 70 5 [ P(2) ×I(2) ](4) 0 )} + 3η1 ℏ2m0 {1 3p2 ( I(1) ·S(1) h ) −ν 3 ( P(2) ·D(2) ) +τ 3 (∑ k=±4 [ P(2) ×D(2) ](4) k + √ 70 5 [ P(2) ×D(2) ](4) 0 )} , (101a) H1 =",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S137",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "1 2ℏ2me { −2 √ 5 3µ′ [ P(1) ×I(2) ](1) 0 −4 √ 2 5δ′ [ P(1) ×I(2) ](3) 0 } + 3η1 γ′ 1ℏ2me { −2 3P(1) 0 ( I(1) ·S(1) h ) −2 √ 5 3ν [ P(1) ×D(2) ](1) 0 −4 √ 2 5τ [ P(1) ×D(2) ](3) 0 } , (101b) H2 = γ′ 1me −m0 2γ′ 1m2e + m0 2γ′ 1ℏ2m2e {( − √ 2 3µ′+ 2 5 √ 6δ′ ) I(2) 0 } + 3η1m0 γ ′2 1 ℏ2m2e { 1 3 ( I(1) ·S(1) h ) + ( − √ 2 3ν+ 2 5 √ 6τ ) D(2) 0 } . (101c) B. Wave vector in [110] direction H0 = Eg −",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S138",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "e2 4πε0ε 1 r − e2 4πε0r [ 1 2ε∗ 1 ( e−r/ρh1 + e−r/ρe1 ) + 1 2ε∗ 2 ( e−r/ρh2 + e−r/ρe2 )] + 2 3∆ ( 1 + 1 ℏ2 I(1) ·S(1) h ) + [ −V0 + J0 (1 4 − 1 ℏ2 S(1) e ·S(1) h )] Vucδ(r) + γ′ 1 2ℏ2m0 { ℏ2p2 −µ′ 3 ( P(2) ·I(2) ) + δ′ 4 (∑ k=±4 [ P(2) ×I(2) ](4) k ) − √ 7 6 δ′ (∑ k=±2 [ P(2) ×I(2) ](4) 2 + √ 1 10 [ P(2) ×I(2) ](4) 0 )} + 3η1 ℏ2m0 { 1 3p2 ( I(1) ·S(1) h ) −ν 3 ( P(2) ·D(2) ) + τ 4 (∑ k=±4",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S139",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "[ P(2) ×D(2) ](4) k ) 24 − √ 7 6 τ (∑ k=±2 [ P(2) ×D(2) ](4) k + √ 1 10 [ P(2) ×D(2) ](4) 0 )} , (102a) H1 = 1 2ℏ2me { −2 √ 5 3µ′ [ P(1) ×I(2) ](1) 0 + √ 3δ′ (∑ k=±2 [ P(1) ×I(2) ](3) k + √ 2 15 [ P(1) ×I(2) ](3) 0 )} + 3η1 γ′ 1ℏ2me { −2 3P(1) 0 ( I(1) ·S(1) h ) −2 √ 5 3ν [ P(1) ×D(2) ](1) 0 + √ 3τ (∑ k=±2 [ P(1) ×D(2) ](3) k + √ 2 15 [ P(1) ×D(2) ](3) 0 )} , (102b) H2 = γ′ 1me −m0 2γ′ 1m2e + m0 2γ′ 1ℏ2m2e",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S140",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "{ −1 2δ′ ( I(2) −2 + I(2) 2 ) + ( − √ 2 3µ′−1 5 √ 3 2δ′ ) I(2) 0 } + 3η1m0 γ ′2 1 ℏ2m2e { 1 3 ( I(1) ·S(1) h ) −1 2τ ( D(2) −2 + D(2) 2 ) + ( − √ 2 3ν−1 5 √ 3 2τ ) D(2) 0 } . (102c) C. Wave vector in [111] direction H0 = Eg − e2 4πε0ε 1 r − e2 4πε0r [ 1 2ε∗ 1 ( e−r/ρh1 + e−r/ρe1 ) + 1 2ε∗ 2 ( e−r/ρh2 + e−r/ρe2 )] + 2 3∆ ( 1 + 1 ℏ2 I(1) ·S(1) h ) + [ −V0 + J0 (1 4 − 1 ℏ2",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S141",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "S(1) e ·S(1) h )] Vucδ(r) + γ′ 1 2ℏ2m0 { ℏ2p2 −µ′ 3 ( P(2) ·I(2) ) + 4 27δ′ (∑ k=±3 k [ P(2) ×I(2) ](4) k −3 √ 7 10 [ P(2) ×I(2) ](4) 0 )} + 3η1 ℏ2m0 {1 3p2 ( I(1) ·S(1) h ) −ν 3 ( P(2) ·D(2) ) + 4 27τ (∑ k=±3 k [ P(2) ×D(2) ](4) 3 −3 √ 7 10 [ P(2) ×D(2) ](4) 0 )} , (103a) H1 = 1 2ℏ2me { −2 √ 5 3µ′ [ P(1) ×I(2) ](1) 0 −4 9δ′ (∑ k=±3 k [ P(1) ×I(2) ](3) k −6 √ 2 5 [ P(1) ×I(2) ](3) 0 )} 25 + 3η1 γ′ 1ℏ2me { −2 3P(1)",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S142",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "0 ( I(1) ·S(1) h ) −2 √ 5 3ν [ P(1) ×D(2) ](1) 0 −4 9τ (∑ k=±3 k [ P(1) ×D(2) ](3) k −6 √ 2 5 [ P(1) ×D(2) ](3) 0 )} , (103b) H2 = γ′ 1me −m0 2γ′ 1m2e + m0 2γ′ 1ℏ2m2e { − √ 2 3 ( µ′+ 4 5δ′ ) I(2) 0 } + 3η1m0 γ ′2 1 ℏ2m2e { 1 3 ( I(1) ·S(1) h ) − √ 2 3 ( ν+ 4 5τ ) D(2) 0 } . (103c) D. Matrix elements and reduced matrix elements ⣨ Π′ ⏐⏐⏐I(2) q ⏐⏐⏐Π ⟩ = δLL′ 3 √ 5 (−1)F′ t+Ft−M′ Ft+2F′+2J+L ×[(2Ft + 1) (2F′ t + 1) (2F + 1)",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S143",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "(2F′+ 1) (2J+ 1) (2J′+ 1)] 1 2 × ( F′ t 2 Ft −M′ Ft q MFt ){ F′ F′ t 1 2 Ft F 2 }{ J′ F′ L F J 2 }{ 1 J′ 1 2 J 1 2 } × 1∑ j=−1 (R1)j NL [N + L+ j+ 1]−1 δN′,N+j, (104) ⣨ Π′ ⏐⏐⏐D(2) q ⏐⏐⏐Π ⟩ = δLL′ 3 √ 5 (−1)F′ t+Ft−M′ Ft+2F′+L+J+ 1 2 ×[(2Ft + 1) (2F′ t + 1) (2F + 1) (2F′+ 1) (2J+ 1) (2J′+ 1)] 1 2 × ( F′ t 2 Ft −M′ Ft q MFt ){ F′ F′ t 1 2 Ft F 2 }{ J′ F′ L F J 2 }   1 1",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S144",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "1 1 2 1 2 1 J′ J 2    × 1∑ j=−1 (R1)j NL [N + L+ j+ 1]−1 δN′,N+j, (105) ⣨ Π′ ⏐⏐⏐ ( I(1) ·S(1) h )⏐⏐⏐Π ⟩ = δLL′ δMFtM′ Ft δFtF′ t 3 √ 3 (−1)Ft+2F′+L+J+ 3 2 ×[(2Ft + 1) (2F + 1) (2F′+ 1) (2J+ 1) (2J′+ 1)] 1 2 26 × { F′ Ft 1 2 Ft F 0 }{ J′ F′ L F J 0 }   1 1 1 1 2 1 2 1 J′ J 0    × 1∑ j=−1 (R1)j NL [N + L+ j+ 1]−1 δN′,N+j, (106) ⟨ Π′ ⏐⏐⏐⏐ [ P(1) ×I(2) ](K) q ⏐⏐⏐⏐Π ⟩ = 3 √ 5 (−1)F′",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S145",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "t+Ft−M′ Ft+F′+J+K ⣨ N′L′ P(1) NL ⟩ ×[(2Ft + 1) (2F′ t + 1) (2F + 1) (2F′+ 1) (2J+ 1) (2J′+ 1) (2K+ 1)] 1 2 × ( F′ t K F t −M′ Ft q MFt ){ F′ F′ t 1 2 Ft F K }   L′ L 1 J′ J 2 F′ F K    { 1 J′ 1 2 J 1 2 } , (107) ⟨ Π′ ⏐⏐⏐⏐ [ P(1) ×D(2) ](K) q ⏐⏐⏐⏐Π ⟩ = 3 √ 5 (−1)F′ t+Ft−M′ Ft+F′+ 1 2 +K ⣨ N′L′ P(1) NL ⟩ ×[(2Ft + 1) (2F′ t + 1) (2F + 1) (2F′+ 1) (2J+ 1) (2J′+ 1) (2K+ 1)] 1 2 × (",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S146",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "F′ t K F t −M′ Ft q MFt ){ F′ F′ t 1 2 Ft F K }   L′ L 1 J′ J 2 F′ F K       1 1 1 1 2 1 2 1 J′ J 2    , (108) ⣨ Π′ ⏐⏐⏐P(1) 0 ( I(1) ·S(1) h )⏐⏐⏐Π ⟩ = δMFtM′ Ft 9 (−1)F′ t+Ft−MFt+F′+ 1 2 ⣨ N′L′ P(1) NL ⟩ ×[(2Ft + 1) (2F′ t + 1) (2F + 1) (2F′+ 1) (2J+ 1) (2J′+ 1)] 1 2 × ( F′ t 1 Ft −MFt 0 MFt ){ F′ F′ t 1 2 Ft F 1 }   L′ L 1 J′ J 0",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S147",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "F′ F 1       1 1 1 1 2 1 2 1 J′ J 0    . (109) ⣨ N′L′ P(1) NL ⟩ = δL′,L+1 (−i) [(2L+ 3) (2L+ 1) L+ 1 ]1 2 ×   1∑ j=−1 0∑ k=−2 (L1)k,1 N′,L+1 { (RP1)j N,L(N1)1 L,0 + δ0j(D1)1 L,0 } IN′+kL+2; N+jL   + δL′,L−1 (+i) [(2L+ 1) (2L−1) L ]1 2 27 ×   1∑ j=−1 0∑ k=−2 (L1)k,1 N+j,L { (RP1)j N,L(N1)−1 L,0 + δ0j(D1)−1 L,0 } IN′ L−1; N+j+kL+1  . (110) TABLE III: Reduction of the irreducible representations of the cubic group Oh by the groups C4v (K ∥[001]), C2v (K ∥[110]), and C3v (K ∥[111])",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S148",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "[8]. Note that only the irreducible representation Γ 5 of C4v and the irreducible rep- resentation Γ3 of C3v are two-dimensional. Hence, almost all degeneracies in the exciton spectrum are lifted for K ̸= 0. Oh C4v C2v C3v Γ+ 1 Γ1 Γ1 Γ1 Γ+ 2 Γ3 Γ2 Γ2 Γ+ 3 Γ1 ⊕Γ3 Γ1 ⊕Γ2 Γ3 Γ+ 4 Γ2 ⊕Γ5 Γ2 ⊕Γ3 ⊕Γ4 Γ2 ⊕Γ3 Γ+ 5 Γ4 ⊕Γ5 Γ1 ⊕Γ3 ⊕Γ4 Γ1 ⊕Γ3 Γ− 1 Γ2 Γ3 Γ2 Γ− 2 Γ4 Γ4 Γ1 Γ− 3 Γ2 ⊕Γ4 Γ3 ⊕Γ4 Γ3 Γ− 4 Γ1 ⊕Γ5 Γ1 ⊕Γ2 ⊕Γ4 Γ1 ⊕Γ3 Γ− 5 Γ3 ⊕Γ5 Γ1 ⊕Γ2 ⊕Γ3 Γ2 ⊕Γ3 IX. OSCILLATOR STRENGTH In this section we give the formulas for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S149",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "the oscillator strength fξνK = η ⏐⏐⏐⏐lim r→0 [ −i ∂ ∂r⟨TD ξK|ΨνK⟩+ αK√ 6 ⟨TQ ξK|ΨνK⟩ ]⏐⏐⏐⏐ 2 (111) for the three diﬀerent orientations of Kin [001], [110], or [111] direction. For these directions we have to consider the reduction of the irreducible representations of the cu- bic group Oh by the corresponding subgroups. Further- more, as in Ref. [7], we also rotate the coordinate system to make the z axis of the new coordinate system coincide with the direction of K. A. Wave vector K ∥[001] For K ∥[001], the symmetry Oh of the system is re- duced to C4v and we have to consider the reduction of the irreducible representations of Oh by the group C4v (see",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S150",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "Table III). Especially for Γ − 4 it is Γ− 4 →Γ1 ⊕Γ5. (112) Using the method of projection operators [9], we can determine the correct linear combinations of the states |πD x ⟩= i√ 2 [|2, −1⟩D + |2, 1⟩D] , (113a) |πD y ⟩= 1√ 2 [|2, −1⟩D −|2, 1⟩D] , (113b) |πD z ⟩= i√ 2 [|2, −2⟩D −|2, 2⟩D] . (113c) and ⏐⏐πQ x ⟩ = ˆKy|1, 0⟩Q + ˆKz i√ 2 [ |1, −1⟩Q + |1, 1⟩Q ] , (114a) ⏐⏐πQ y ⟩ = ˆKx|1, 0⟩Q + ˆKz 1√ 2 [ |1, −1⟩Q −|1, 1⟩Q ] , (114b) ⏐⏐πQ z ⟩ = ˆKy 1√ 2 [ |1, −1⟩Q −|1, 1⟩Q ] + ˆKx i√ 2",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S151",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "[ |1, −1⟩Q + |1, 1⟩Q ] . (114c) which transform according to the irreducible representa- tions of C4v. On the other hand, it is instructive that the correct linear combinations are given according to the di- rection of Kand the polarization vectors ˆeξK transverse to K: ˆK = (0, 0, 1)T, (115a) ˆe1K = (1, 0, 0)T, (115b) ˆe2K = (0, 1, 0)T. (115c) Since light is always transversely polarized, only states of symmetry Γ 5 are allowed. The correct linear combi- nations of the states (113) are Γ1 : |LD K⟩= |πD z ⟩, (116a) Γ5 : |TD 1K⟩= |πD x ⟩and (116b) |TD 2K⟩= |πD y ⟩, (116c) and likewise for the states of Eq. (114). If",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S152",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "we assume the incident light to be circularly polarized, the oscillator strength is given by fξνK = η ⏐⏐⏐⏐lim r→0 [ −i ∂ ∂r⟨TD ±K|ΨνK⟩+ αK√ 6 ⟨TQ ±K|ΨνK⟩ ]⏐⏐⏐⏐ 2 (117) 28 with |TD +K⟩= −i√ 2 [ |TD 1K⟩+ i|TD 2K⟩ ] = |2, −1⟩D, (118a) |TD −K⟩= i√ 2 [ |TD 1K⟩−i|TD 2K⟩ ] = −|2, 1⟩D (118b) and |TQ +K⟩= −i√ 2 [ |TQ 1K⟩+ i|TQ 2K⟩ ] = |1, −1⟩Q, (119a) |TQ −K⟩= i√ 2 [ |TQ 1K⟩−i|TQ 2K⟩ ] = −|1, 1⟩Q. (119b) Note that the sign ±is deﬁned by the direction of rota- tion of the polarization with respect to K. B. Wave vector K ∥[110] For K ∥[110] the symmetry is reduced",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S153",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "to C2v and it is Γ− 4 →Γ1 ⊕Γ2 ⊕Γ4. (120) The corresponding vectors are ˆK = (1, 1, 0)T/ √ 2, (121a) ˆe1K = (1, −1, 0)T/ √ 2, (121b) ˆe2K = (0, 0, 1)T, (121c) so that the correct linear combinations of the states (113) read Γ1 : |LD K⟩= 1√ 2 [⏐⏐πD x ⟩ + ⏐⏐πD y ⟩] , (122a) Γ2 : |TD 1K⟩= 1√ 2 [⏐⏐πD x ⟩ − ⏐⏐πD y ⟩] , (122b) Γ4 : |TD 2K⟩= ⏐⏐πD z ⟩ . (122c) We now choose the quantization axis parallel to K, i.e., we rotate the coordinate system by the Euler angles (α, β, γ) = (π, π/2, π/4). Rotating the states |Li K⟩and |Ti ξK⟩as",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S154",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "well yields |L′D K⟩= |πD z′ ⟩= 1√ 2 [|2, −1⟩D −|2, 1⟩D] , (123a) |T′D 1K⟩= |πD y′ ⟩= i√ 2 [|2, 2⟩D −|2, −2⟩D] , (123b) |T′D 2K⟩= |πD x′ ⟩= √ 3 2 |2, 0⟩D + 1√ 8 [|2, −2⟩D + |2, 2⟩D] , (123c) and |L′Q K⟩= |πQ z′ ⟩= 1√ 2 [ |1, −1⟩Q −|1, 1⟩Q ] , (124a) |T′Q 1K⟩= |πQ y′ ⟩= 0, (124b) |T′Q 2K⟩= |πQ x′ ⟩= |1, 0⟩Q. (124c) The labels x′, y′ and z′ are meant to indicate that the states are given in the rotated coordinate system. Finally, we calculate the oscillator strengths by evaluating fνξK = η ⏐⏐⏐⏐lim r→0 [ −i ∂ ∂r⟨T′D ξK|ΨνK⟩+ αK√ 6 ⟨T′Q",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S155",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "ξK|ΨνK⟩ ]⏐⏐⏐⏐ 2 (125) for light which is polarized in [001] or in [1 ¯10] direction. C. Wave vector K ∥[111] For K∥[111] the symmetry is reduced to C3v and we have Γ− 4 →Γ1 ⊕Γ3 (126) with the vectors ˆK = (1, 1, 1)T/ √ 3, (127a) ˆe1K = (1, 1, −2)T/ √ 6, (127b) ˆe2K = (−1, 1, 0)T/ √ 2. (127c) The correct linear combinations of the states in Eqs. (113) are therefore Γ1 : |LD K⟩= 1√ 3 [⏐⏐πD x ⟩ + ⏐⏐πD y ⟩ + ⏐⏐πD z ⟩] , (128a) Γ3 : |TD 1K⟩= 1√ 6 [⏐⏐πD x ⟩ + ⏐⏐πD y ⟩ −2 ⏐⏐πD z ⟩] and (128b) |TD 2K⟩= 1√ 2 [ −",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S156",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "⏐⏐πD x ⟩ + ⏐⏐πD y ⟩] (128c) 29 FIG. 8: (a) The exciton energies EνK in dependence on K = |K|for K ∥[110]. The colorbar shows the oscillator strengths for ξ= πx′ polarized light. We denote from which states at K = 0 the exciton states originate (cf. Ref. [6]). For reasons of space we introduce the abbreviated notation Γ± i/j to replace Γ± i , Γ± j . The blue solid line gives the photon dispersion ℏωξK = ℏKc/√εb2. (b) Polariton dispersion obtained by solving the eigenvalue problem in Sec. IVC. (c) Photon-like part WµξK of the polariton states. For further information see text. Here we rotate the coordinate system by the Euler angles (α, β, γ) =",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S157",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "( 0, arccos(1/ √ 3), π/4 ) . Rotating the states of Eq. (128) and assuming circularly polarized light yields |L′′D K ⟩= |2, 0⟩D, (129a) |T′′D +K⟩= i√ 3 [√ 2 |2, −2⟩D −|2, 1⟩D ] and (129b) |T′′D −K⟩= −i√ 3 [√ 2 |2, 2⟩D + |2, −1⟩D ] , (129c) and |L′′Q K ⟩= 2√ 3 |1, 0⟩Q, (130a) |T′′Q +K⟩= −i√ 3 |1, 1⟩Q and (130b) |T′′Q −K⟩= −i√ 3 |1, −1⟩Q. (130c) 30 FIG. 9: Same spectra as in Fig. 8 but for K ∥[110] and ξ= πy′ polarized light. Note that the states which have the symmetry Γ+ 5 for K = 0 are dipole-forbidden in this case. For further information see text. We",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S158",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "ﬁnally calculate the oscillator strengths by evaluating fξνK = η ⏐⏐⏐⏐lim r→0 [ −i ∂ ∂r⟨T′′D ±K|ΨνK⟩+ αK√ 6 ⟨T′′Q ±K|ΨνK⟩ ]⏐⏐⏐⏐ 2 . (131) X. POLARITON DISPERSIONS FOR K ∥[110] AND K ∥[111] In this section we present the dispersions of the exciton-polaritons with K ∥ [110] and K ∥ [111] us- ing the Hamiltonian which accounts for the valence band structure, the exchange interaction, the central-cell cor- rections, and the ﬁnite momentum ℏK of the center of mass. As we already stated in the manuscript, the diﬀerences in the dispersion relations for the diﬀerent orientations K ∥[001] K ∥[110] or K ∥[111] are only slight. A change in the energies of the exciton states cannot be ob- served",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S159",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "in Figs. 8, 9, and 10, since it is on the order of tens of µeV. However, there is an important diﬀerence be- tween the spectra: The values of the oscillator strengths signiﬁcantly change due to the diﬀerent symmetry break- ing. For example, for K∥[110] the states which have the symmetry Γ+ 5 at K = 0 are dipole-forbidden. Especially the change in the oscialltor strength of the P excitons aﬀects the position of the avoided crossings of the other excitons as can be seen when comparing, e.g., the insets in the lower right panels of Figs. 9 and 10. Therefore, 31 FIG. 10: Same spectra as in Fig. 8 but for K ∥[111] and ξ = σ± z′′ polarized",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S160",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "light. For both polarizations the spectrum is identical. The oscillator strength of the 4 F(Γ− 7 ) state is too weak to be seen here. For further information see text. the polariton dispersions diﬀer, however, mainly in the vicinity of the avoided crossings. [1] A. R. Edmonds, Angular momentum in quantum mechan- ics (Princeton University Press, Princeton, 1960). [2] A. Baldereschi and N. O. Lipari, Phys. Rev. B 8, 2697 (1973). [3] J. Broeckx, Phys. Rev. B 43, 9643 (1991). [4] F. Schweiner, J. Main, M. Feldmaier, G. Wunner, and Ch. Uihlein, Phys. Rev. B 93, 195203 (2016). [5] Ch. Uihlein, D. Fr¨ ohlich, and R. Kenklies, Phys. Rev. B 23, 2731 (1981). [6] F. Schweiner, J. Main, G. Wunner,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1711_04482v1:S161",
      "paper_id": "arxiv:1711.04482v1",
      "section": "method",
      "text": "and Ch. Uihlein, Phys. Rev. B 95, 195201 (2017). [7] F. Schweiner, J. Main, G. Wunner, M. Freitag, J. Heck¨ otter, Ch. Uihlein, M. Aßmann, D. Fr¨ ohlich, and M. Bayer, Phys. Rev. B 95, 035202 (2017). [8] G. F. Koster, J. O. Dimmock, R. G. Wheeler, and H. Statz, Properties of the Thirty-Two Point Groups (M.I.T. Press, Cambridge, MA, 1963). [9] A. Abragam and B. Bleaney, Electron Paramagnetic Reso- nance of Transition Ions (Clarendon Press, Oxford, 1970).",
      "page_hint": null,
      "token_count": 78,
      "paper_year": 2017,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9104750765758243,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    }
  ],
  "extraction_meta": {
    "extractor": "pypdf",
    "two_column_applied": false,
    "ocr_applied": false,
    "pages_total": 31,
    "empty_pages": 0,
    "empty_page_pct": 0.0,
    "page_stats": [
      {
        "page": 1,
        "chars": 5328,
        "empty": false
      },
      {
        "page": 2,
        "chars": 6267,
        "empty": false
      },
      {
        "page": 3,
        "chars": 4769,
        "empty": false
      },
      {
        "page": 4,
        "chars": 3865,
        "empty": false
      },
      {
        "page": 5,
        "chars": 3364,
        "empty": false
      },
      {
        "page": 6,
        "chars": 2102,
        "empty": false
      },
      {
        "page": 7,
        "chars": 4506,
        "empty": false
      },
      {
        "page": 8,
        "chars": 3570,
        "empty": false
      },
      {
        "page": 9,
        "chars": 2218,
        "empty": false
      },
      {
        "page": 10,
        "chars": 3130,
        "empty": false
      },
      {
        "page": 11,
        "chars": 5228,
        "empty": false
      },
      {
        "page": 12,
        "chars": 1898,
        "empty": false
      },
      {
        "page": 13,
        "chars": 5570,
        "empty": false
      },
      {
        "page": 14,
        "chars": 3106,
        "empty": false
      },
      {
        "page": 15,
        "chars": 5160,
        "empty": false
      },
      {
        "page": 16,
        "chars": 3740,
        "empty": false
      },
      {
        "page": 17,
        "chars": 3377,
        "empty": false
      },
      {
        "page": 18,
        "chars": 2791,
        "empty": false
      },
      {
        "page": 19,
        "chars": 4197,
        "empty": false
      },
      {
        "page": 20,
        "chars": 5562,
        "empty": false
      },
      {
        "page": 21,
        "chars": 5800,
        "empty": false
      },
      {
        "page": 22,
        "chars": 3468,
        "empty": false
      },
      {
        "page": 23,
        "chars": 1054,
        "empty": false
      },
      {
        "page": 24,
        "chars": 1149,
        "empty": false
      },
      {
        "page": 25,
        "chars": 1040,
        "empty": false
      },
      {
        "page": 26,
        "chars": 1209,
        "empty": false
      },
      {
        "page": 27,
        "chars": 2695,
        "empty": false
      },
      {
        "page": 28,
        "chars": 1996,
        "empty": false
      },
      {
        "page": 29,
        "chars": 968,
        "empty": false
      },
      {
        "page": 30,
        "chars": 1467,
        "empty": false
      },
      {
        "page": 31,
        "chars": 1232,
        "empty": false
      }
    ],
    "quality_score": 0.9105,
    "quality_band": "good"
  }
}