{
  "paper": {
    "paper_id": "arxiv:0106135v2",
    "title": "Superstructures at low spin - high spin transitions",
    "authors": [
      "D. I. Khomskii",
      "U. Löw"
    ],
    "year": 2001,
    "venue": "arXiv",
    "source": "arxiv",
    "abstract": "In many transition metal compounds, in particular those containing Fe^{2+} and Co^{3+}, there occur spin-state transitions between low-spin and high-spin (or intermediate-spin) states. We show that typical interactions between similar spin-state ions are short-range repulsion, and long-range interaction which can have different sign depending on the elastic anisotropy of the lattice and on the direction between respective ions. Due to such character of effective interactions at the spin-state transitions there may occur different superstructures -- ordered arrangement of different spin-states, which in particular may have the form of stripes. The properties of the system TlSr_2CoO_5 for which such a superstructure was recently observed experimentally, are discussed from this point of view.",
    "pdf_path": "data/automation/papers/arxiv_0106135v2.pdf",
    "url": "https://arxiv.org/pdf/cond-mat/0106135v2",
    "doi": null,
    "arxiv_id": "0106135v2",
    "openalex_id": null,
    "citation_count": 0,
    "is_open_access": true,
    "sync_timestamp": "2026-02-20 18:11:02.785607+00:00"
  },
  "snippets": [
    {
      "snippet_id": "Parxiv_0106135v2:S1",
      "paper_id": "arxiv:0106135v2",
      "section": "body",
      "text": "arXiv:cond-mat/0106135v2  [cond-mat.str-el]  28 Nov 2003 Superstructures at low spin - high spin transitions D. I. Khomskii II.Physikalisches Institut, Universit¨ at zu K¨ oln, Z¨ ulpicher Str.77, 50937 K¨ oln, Germany, and Laboratory of Solid State Physics, Groningen University, 9747 AG Groningen, The Netherlands U. L¨ ow Theoretische Physik, Universit¨ at zu K¨ oln, Z¨ ulpicher Str.77, 50937 K¨ oln, Germany",
      "page_hint": null,
      "token_count": 60,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S2",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "In many transition metal compounds, in particular those con taining Fe 2+ and Co 3+, there oc- cur spin-state transitions between low-spin and high-spin (or intermediate-spin) states. We show that typical interactions between similar spin-state ions are short-range repulsion, and long-range interaction which can have diﬀerent sign depending on the ela stic anisotropy of the lattice and on the direction between respective ions. Due to such charac ter of eﬀective interactions at the spin-state transitions there may occur diﬀerent superstruc tures — ordered arrangement of diﬀer- ent spin-states, which in particular may have the form of str ipes. The properties of the system TlSr2CoO5 for which such a superstructure was recently observed exper imentally, are discussed from this point of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S3",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "view. PACS numbers: 71.70.Ch, 61.72.Yx, 64.60.Cn 1 There exist many transition metal compounds in which, due to a comp etition between crystal ﬁeld splitting and intra-atomic Hund’s rule exchange, diﬀere nt spin states lie close in energy. Such is often the situation for Fe 2+ and Co 3+. For these ions the low-spin (LS) state (occupation of d-levels t 6 2ge0 g, S=0), intermediate-spin (IS) state (t 5 2ge1 g, S=1) and high- spin (HS) state (t 4 2ge2 g, S=2) can be stabilised at diﬀerent conditions. In some cases there occur spin-state transitions caused e.g. by change of pressure, temperature or composition. There are many examples of such transitions among Fe 2+-compounds [1, 2], in particular with organic ligands.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S4",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "Among systems with Co 3+, the best known (and still controversial) is the case of LaCoO 3. For a long time it was assumed that there occurs in it the LS – HS transition with increasing temperature [3], but more recent calculat ions [4] and experiments [5] point rather to the LS – IS transition. Usually spin-state transitions occur between homogeneous state s having predominantly one particular spin state; often they are of ﬁrst order. However as we shall show below, a quite diﬀerent and interesting situation may occur: the interactio n between ions with diﬀerent spin state may be such that at the spin-state transitions an intermediate state may be stabilised, in which there appears a spin-state superstructure- an",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S5",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "ordered arrange- ment of diﬀerent spin states of the same ionic species, e.g. an altern ation of HS and LS states. Recently the ﬁrst example of such superstructure was o bserved in a layered cobaltite TlSr2CoO5 [6] and its presence was suggested for NdBaCo 2O5.5 [7]. In the present paper we consider the form of interactions determ ining the character of spin-state transitions, suggest a general mechanism which can lea d to spin-state superstruc- tures, and qualitatively explain the superstructure observed in TlS r2CoO5. Conventional description of spin-state transitions [8, 9] relies on in teractions induced by lattice distortions. Ions with diﬀerent spin states have diﬀerent ion ic radii, e.g. Co 3+ in the LS state in VI-fold coordination has",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S6",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "the ionic radius 0.545 ˚ A, and in the HS state — 0.61 ˚ A. Consequently, if we change the spin state of an ion, e.g. by transfo rming one of the LS Co’s into a HS state, it amounts to introducing an“impurity” with larger siz e into a matrix (the so called “sphere in the hole” model [8]). This introduces strain in a cry stal, and coupling to this strain provides the mechanism of interaction between impurities . In a model of isotropic elastic continuum generally used in treating LS – HS transitions [8, 9], the only interaction remaining is that through the “image forces” due to a stress-free surface of the sample [10], which is attractive. With such",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S7",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "an attractive interaction one indeed o btains homogeneous 2 structures, transitions between which may be of ﬁrst order. In real crystals, however, the elastic interactions are more comp licated. Thus e.g. in weakly anisotropic cubic crystals there appears an interaction bet ween impurities which decays rather slowly, as 1 R3 , and, most important, which has a diﬀerent sign in diﬀerent directions [10, 11]: V (⃗ r, ⃗ r′) = − Cd Q1Q2 Γ(⃗ n) |⃗ r− ⃗ r′|3 (1) where C is a constant of the order of unity, ⃗ r− ⃗ r′ = |⃗ r− ⃗ r′| ·⃗ n, Q1 and Q2 are the “strengths” of impurities ( Qi ∼ (vi − v0) where vi is the volume",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S8",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "of the impurity and v0 is the corresponding volume of the matrix), and the angular depende nce of the interaction (1) is determined by a function of the direction cosines of the vector ⃗R = ⃗ r1 − ⃗ r2: Γ(⃗ n) = n4 x+ n4 y+ n4 z− 3 5 . (2) Here the elastic anisotropy is characterised by the parameter d = c11 − c12 − 2c44, where cij are the corresponding elastic moduli. We see that e.g. for d < 0 the interaction (1) is positive (repulsive) along the [100], [010] and [001] directions and att ractive along face and body diagonals [110] and [111], and vice versa for d > 0. Thus we see that, in",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S9",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "contrast to usual assumptions, the interaction between similar states (e.g. between HS ions in a LS matrix) may be repulsive, at least in certain directions. One can also show that the nearest neighbour (nn) interaction via s hort-wavelengths or optical phonons is typically also repulsive. Thus e.g. in a perovskite lat tice, when one puts a large HS ion at a certain site, it pushes apart the surrounding oxyg ens, so that it is more favourable to have small LS ions at the nn sites. Consequently, the eﬀective interaction between similar ions at the nn sites is repulsive (or equivalently, it is att ractive between LS and HS states). As is clear from these arguments, one can expect in this",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S10",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "case that not only homogeneous states (LS or HS), but also certain states with orde red LS and HS ions can appear at certain conditions. A convenient way to describe spin-state transitions and eventual superstructures is to map this situation to an eﬀective lattice gas, or Ising model. Let us co nsider the situation in which each ion can be in two states, e.g. LS and HS (it may be also LS an d IS [4, 5] or, in the case of TlSr 2CoO5, IS and HS states [6]; for simplicity we speak below about LS and HS). We introduce pseudospin operators σi = ± 1, so that σi = − 1 corresponds to a LS state, and σi =",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S11",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "1 to a HS state at site i. According to our general discussion we can model the 3 situation by the eﬀective Ising-type interaction ∑ Jij σiσj , containing in general short-range repulsion, and a long-range part which decays as 1 R3 and which may have diﬀerent signs in diﬀerent directions; this longer-range interactions depend on th e details of the crystal structure, elastic anisotropy etc., see Eq.(1). The relative energ ies of diﬀerent spin-states, e.g. HS vs LS, will be described in this language by the eﬀective ”magne tic ﬁeld” — the term hσi. It is known that the Ising model with long-range interactions can giv e rise to a variety of diﬀerent ordered structures (see the well-known ANNNI",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S12",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "model [12] or the treatment of the 2d Ising model with the “Coulomb” interaction in [13]). In this pape r we consider a simpliﬁed model, which nevertheless contains the essential physics, keeping only a small number of pair interactions. In contrast to the treatment of [11, 13], where one has studied systems with ﬁxed concentration of particles (in our mapping — ﬁxed “magnetisation”), in our present problem the relative number of diﬀerent spins (LS and H S ions) is not ﬁxed. Consequently we should consider our system not for ﬁxed density ( “magnetisation”), but for ﬁxed chemical potential (“magnetic ﬁeld”); the role of the temper ature can be also mapped onto a magnetic ﬁeld [8]. We consider a 2d square",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S13",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "lattice, modelling the situation in TlSr 2CoO5, which is the layered compound with perovskite-like CoO 2-plane similar to CuO 2-plane in high-T c cuprates. The Hamiltonian of our model is H = J1 ∑ ⟨ij⟩=nn σiσj + J2 ∑ ⟨ij⟩=nnn σiσj − h ∑ i σi (3) Here the ﬁrst term describes the nearest neighbour interaction, which, as we argued above, is repulsive, J1 > 0; the second term is the next nearest neighbour interaction along x and y-directions ([100] and [010]) which we also take to be repulsive. The las t term in Eq.(3) describes the diﬀerence of the on-site energies of LS and HS states, which can be changed e.g. by pressure etc. (For Co 3+ the eﬀective",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S14",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "ﬁeld h will be equal to h = 6 JH − 2∆, where JH is the Hund’s rule exchange and ∆ is the crystal-ﬁeld splitting between t2g and eg-levels). It is straightforward to see that for only nn repulsion ( J1 > 0, J2 = 0) three states can be realized at T = 0 for diﬀerent values of h: the state with all σi = − 1 (LS-states) and with the energy (per site) ELS = J1z 2 + h where z is the number of nearest neighbours (in 4 our case z = 4); the state with alternating spins +1, − 1,+1, . . . , forming a two-sublattice “antiferromagnetic” structure in a bipartite lattice (we consider b",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S15",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "elow only such a case), ELS/HS = − J1z 2 , and the homogeneous HS state with all σi = 1 and EHS = J1z 2 − h. Conse- quently, we would have jump-like phase transitions between these s tates with increasing h, from the LS state at h < − J1z to an ordered array LS/HS/LS/HS . . . for − J1z < h < J 1z, and to a HS state for h > J 1z. Thus we see that this model quite naturally leads to the formation of a state with a superstructure of LS and HS states, s imilar to the one observed in [6]. One important diﬀerence of this simple case and the experimental sit",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S16",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "uation observed in [6] is that the ratio of LS to HS states (IS to HS in the real case of TlS r2CoO5) is not 1:1 as above, but 1:2, IS states forming diagonal stripes in the 2d square lattice. But just such a state appears when one takes into account the second term in the Hamiltonian Eq.(3). In order to determine the ground state phase diagram of the mode l (3) we employed a Metropolis Monte Carlo algorithm combined with a single spin ﬂip dynamics to cool the states to zero temperature [13]. We further compared the energ ies of all possible periodic states with unit cells up to size 5 × 5. In this way we found four",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S17",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "regions with diﬀerent ordered ground states: a ferromagnetic and an antiferromagne tic phase, a 2 × 2 checkerboard structure which is degenerate with (2 , 2)-stripes, and a (2 , 1) stripe phase. The resulting phase diagram for h > 0 is shown in Fig.1 (as is clear from the form of the Hamiltonian (3), the phase diagram for h < 0 can be obtained by changing σ to − σ, i.e. by reﬂecting the phase diagram in Fig.1 relative to the x-axis and changing + ↔ − ). Since all the ground states are simple diagonal stripes (except for the checkerboard phase which is however degenerate with the (2 , 2) stripe phase) we mapped the model onto a",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S18",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "one- dimensional eﬀective model, which is simpler to analyse and which serve d us for a detailed analysis (see appendix). This study conﬁrms the conclusions prese nted above and reproduces the phase diagram of Fig.1. To summarize, away from the boundaries all systematic checks rev ealed no phases but the ones shown in Fig.1. Note however, that on the boundary lines int eresting degeneracies occur. Thus e.g. on the line h = 4 J1 + 4 J2 separating the ferromagnetic and the (2,1) phase all diagonal stripes (n,1) consisting of n spins σ = + and one spin σ = − 1 are degenerate. We stress however that these degeneracies are of no phenomenological relevance for the superstructures studied here,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S19",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "since they are strictly co nﬁned to the ”one-dimensional” 5 phase boundaries. The phase diagram obtained above resembles that of the well-known ANNNI model, cf. Fig.1 in Ref.[14], with the diﬀerence that because of the ferromagnet ic coupling between nn spins in one direction in the ANNNI model, (2 , 1) stripes in the latter are vertical and not diagonal, as in our case (see the appendix for details). Also, our res ult agrees with Ref.[15] where the model Eq.(3) is discussed for h = 0. From the results presented above we see that in a large part of the phase diagram we obtain the phase with (2,1) diagonal stripes; this phase exactly cor responds to the spin-state superstructure observed",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S20",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "experimentally in TlSr 2CoO5 [6]. We also considered the generalized model, including the interaction be tween the sites along diagonals in the plaquette, which according to Eqs.(1,2) should b e attractive (ferro- magnetic): the corresponding model in the spin language is H = J1 ∑ <ij>=nn σiσj + J2 ∑ <ij>=nnn σiσj + Jd ∑ <ij>=diag σiσj − h ∑ i σi. (4) where J1, J2 > 0, Jd < 0. We found no new ground state phases emerging for this case, but t he eﬀect of the diag- onal coupling Jd is merely to shift the phase boundaries in Fig.1 by Jd/2 to the right (see appendix). For a longer range interaction, e.g. the one of the type (1),",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S21",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "certa in other states may appear, depending on the ratio of the constants of the Hamiltonian . The description of these states is a formidable problem even in 1d-case, especially at ﬁn ite temperatures [12] (see also the results of numerical calculations in [13]). We will not discu ss all the details of this problem here; our main aim is just to demonstrate the possibilit y of the appearance of states with spin-state superstructures at corresponding tr ansitions. We see that such superstructures indeed occur quite naturally if we take into accou nt realistic interactions of HS and LS states via lattice deformation, including elastic anisotropy and interaction with optical phonons. In particular, the superstructure observed e xperimentally in TlSr",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S22",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "2CoO5 is stable for a certain range of parameters if we include nn and nnn inte raction along [100] and [010]-directions. Concerning the details of the properties of TlSr 2CoO5 and of the theoretical description thereof, a few extra points should be mentioned. We discussed abo ve only the origin and type of ordering in the ground state, assuming localised electrons. In reality TlSr 2CoO5 6 undergoes the ﬁrst order insulator – metal transition with increas ing temperature at about 300 K. We do not discuss this transition in this paper, but one can arg ue that the energy gap in the low-temperature phase may be connected with the occur rence of the spin state superstructure. From this point of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S23",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "view one probably may consider this state as a result of the formation of the spin-state density wave (SSDW), starting fr om the high-temperature metallic phase. (The treatment presented above would correspon d to a strong-coupling limit of this picture.) Another point worth mentioning is the suggestion [16] that an orbita l degeneracy may play a role in the properties of TlSr 2CoO5. In general, indeed, there may exist eg-degeneracy in the IS state and t2g-degeneracy in both the IS and HS states of Co 3+. However from the experimental data [6] it follows that this orbital degeneracy is pred ominantly lifted due to a rather strong tetragonal elongation of the CoO 6-octahedra which exists already in the high-temperature phase",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S24",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "and which most probably is connected with the layered structure of this compound. Indeed, the IS state for this distortion is nonde generate, and only in the HS state there remains a double degeneracy in the t2g-sublevels. But the latter in Co compounds is usually lifted by the spin-orbit coupling, which presumab ly would be the case here as well (Jahn-Teller eﬀect by itself would stabilize for the HS sta te not an elongation, but a compression of CoO 6-octahedra). This question, however, deserves further study . In conclusion, we considered in this paper the properties of system s undergoing spin-state transitions, like the ones often observed in materials containing Fe 2+ and Co 3+. We argued that the eﬀective",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S25",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "interaction governing the behavior of such syst ems – the interaction via lattice distortions – is more complicated than the usually assumed att raction between simi- lar spin-state ions: typically the nearest neighbour interaction is re pulsive, and more distant interactions may be of either sign, depending on the elastic anisotro py of the crystal and on the direction between respective ions. As a result of such form of in teraction, diﬀerent su- perstructures, consisting of ordered distributions of diﬀerent s pin-states, can naturally occur in this case. We discussed from this point of view the spin-state supe rstructure observed in the low-temperature phase of TlSr 2CoO5 [6], and have shown that this superstructure can be explained by our model",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S26",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "for a certain range of parameters. It wo uld be interesting to look for similar superstructures in other systems with comparable ener gies of diﬀerent spin-states and with spin-state transitions. 7 APPENDIX To gain further insight and to corroborate the picture obtained by Monte Carlo calcula- tions and by explicitly comparing the energies of diﬀerent states, we took advantage of the in principal one-dimensional structure of the relevant conﬁgurat ions (i.e. diagonal stripes, see Fig.1) and mapped the original Hamiltonian (4) onto a one-dimensio nal Ising model in a magnetic ﬁeld with the Hamiltonian: H1dim = ∑ i {2J1sisi+1 + (2J2 + Jd)sisi+2 − hsi + Jd}. (5) Here si = ± 1 represents the normalized sums of the spins",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S27",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "on the diagonals and t he one- dimensional interaction is orthogonal to the stripes. Note that th is Hamiltonian contains all possible diagonal stripe conﬁgurations. Using this one-dimension al model we checked systematically for possible diagonal stripe conﬁgurations up to unit cell of 18. From Eq.5 one sees that — once diagonal stripes are conﬁrmed as gr ound states — the role of Jd is a mere modiﬁcation of the next nearest neighbour coupling (plus an irrelevant constant) and hence a shift of the phase boundaries by Jd/2. Eq.5 is also useful to display the similarities to the two-dimensional ANN NI-model HANNNI = − ∑ x,y ( ˜J1Sx,ySx+1,y + ˜J2Sx,ySx+2,y + ˜J0Sx,ySx,y+1 + HSx,y) (6) with ˜J1, ˜J2 < 0",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S28",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "and ˜J0 > 0 as discussed in Ref.[14]. Due to the ferromagnetic interaction ˜J0 in y-direction, the stripes are vertically oriented in the case of Eq.6 and the corresponding one-dimensional Hamiltonian is ˜H1dim = − ∑ i { ˜J1sisi+1 + ˜J2sisi+2 + Hsi + ˜J0}. (7) ˜H1dim Eq.(7) diﬀers from H1dim Eq. (5) for Jd = 0 by a factor 2 in the couplings and by a constant. The phase diagrams of the models can thus be mapped o nto one another by a simple rescaling of the axis. 8 Acknowledgments We are grateful to J. P. Doumerc, D. F¨ orster and R. Hayn for useful discussions. This work was supported by the Sonderforschungsbereich 608 of the Deutsche Forschungsgemein- schaft,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S29",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "by the Netherlands Foundation for Fundamental Study o f Matter (FOM) and by the Netherlands Science Organisation (NWO). 9 [1] C. P. Slichter and H. G. Drickamer, J. Chem. Phys. 56, 21242 (1972). [2] E. K¨ onig, Struct. Bonding 76, 51 (1991). [3] P. M. Racah and J. B. Goodenough, Phys. Rev. 155, 932 (1967). [4] M. A. Korotin at al., Phys. Rev. B 54, 5309 (1996). [5] S. Yamaguchi, Y. Okimoto and Y. Tokura, Phys. Rev. B 55, R8666 (1997); K. Asai et al., J. Phys. Soc. Jap. 67, 290 (1998); G. Maris, Y. Ren, V. Volotchaev, C. Zobel, T. Lor enz, T.T.M. Palstra, Phys. Rev. B, 67, 224423 (2003); C. Zobel, M. Kriener, D. Bruns, J. Baier, M.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S30",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "Grueninger and T. Lorenz, Phys. Rev. B, 66, 020402(R) (2002). [6] M. Coutanseau et al., Sol. State Comm. 96, 569 (1995); J.-P. Doumerc et al., J. Solid State Chem. 147, 211 (1999); J.-P. Doumerc et al., J. Mater. Chem. 11 78 (2001). [7] F. Fauth et al., Phys. Rev. B 66, 184421 (2002). [8] S. Onishi and S. Sugano, J. Phys. C: Solid State Phys. 14, 39 (1981). [9] N. Willenbacher and H. Spiering, J. Phys. C: Solid State P hys. 21, 1423 (1988); H. Spiering and N. Willenbacher, J. Phys.: Condens. Matter 1, 10089 (1989). [10] J. D. Eshelby, The continuum theory of lattice defects, in Solid State Physics, eds. F. Seitz and D. Turnbull, 3, 79 (Academic Press,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S31",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "New York, 1956). [11] D. I. Khomskii and K. I. Kugel, Europhys. Lett. 55,208 (2001); Phys. Rev. B 67,134401 (2003). [12] W. Selke, Phys.Reports 170, 213 (1988). [13] U. L¨ ow, V.J. Emery, K. Fabricius, and S.A. Kivelson, Ph ys. Rev. Lett. 72, 1918 (1994). [14] P. Rujan, W. Selke and G. V. Uimin, Z. Phys. B 53, 221 (1983). [15] D.P. Landau and K. Binder, Phys. Rev. B 31,5946 (1985). [16] D. Foerster, R. Hayn, T. Pruschke, M. Z¨ olﬂ and H. Rosner Phys. Rev. B 64, 075104 (2001). 10 −2.0 −1.0 0.0 1.0 2.0 J 2 0.0 2.0 4.0 6.0h ferromagnetic phase antiferromagnetic phase (2,1) stripe phase++ ++ +− −+ ++−+ +−++ −++− ++−+ checker board/ (2,2) ++−−",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_0106135v2:S32",
      "paper_id": "arxiv:0106135v2",
      "section": "abstract",
      "text": "stripe phase ++−− ++−− −−++ −−++ +−−+ −−++ −++− FIG. 1: Phase diagram of the model (3). The type of pseudospin ordering is shown for each possible phase. (The sign + corresponds e.g.to a high-spin s tate, and the sign − to a low-spin or intermediate-spin state.) Note, that we ﬁxed the energy sca le by putting J1 = 1. 11",
      "page_hint": null,
      "token_count": 61,
      "paper_year": 2001,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9607533363420587,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    }
  ],
  "extraction_meta": {
    "extractor": "pypdf",
    "two_column_applied": false,
    "ocr_applied": false,
    "pages_total": 11,
    "empty_pages": 0,
    "empty_page_pct": 0.0,
    "page_stats": [
      {
        "page": 1,
        "chars": 1264,
        "empty": false
      },
      {
        "page": 2,
        "chars": 2868,
        "empty": false
      },
      {
        "page": 3,
        "chars": 2536,
        "empty": false
      },
      {
        "page": 4,
        "chars": 2403,
        "empty": false
      },
      {
        "page": 5,
        "chars": 2736,
        "empty": false
      },
      {
        "page": 6,
        "chars": 2418,
        "empty": false
      },
      {
        "page": 7,
        "chars": 2719,
        "empty": false
      },
      {
        "page": 8,
        "chars": 1706,
        "empty": false
      },
      {
        "page": 9,
        "chars": 321,
        "empty": false
      },
      {
        "page": 10,
        "chars": 1660,
        "empty": false
      },
      {
        "page": 11,
        "chars": 484,
        "empty": false
      }
    ],
    "quality_score": 0.9608,
    "quality_band": "good"
  }
}