{
  "paper": {
    "paper_id": "arxiv:1001.4218v1",
    "title": "Lessons from failures to achieve what was possible in the twentieth century physics",
    "authors": [
      "Vesselin Petkov"
    ],
    "year": 2010,
    "venue": "arXiv",
    "source": "arxiv",
    "abstract": "For several decades there has been no breakthrough in fundamental physics as revolutionary as relativity and quantum physics despite the amazing advancement of applied physics and technology. By discussing several examples of what physics could have achieved by now, but failed, I will argue that the present state of fundamental physics is not caused by the lack of talented physicists, but rather by problematic general views on how one should do physics. Although it appears to be widely believed that such general views cannot affect the advancement of physics I would like to draw the attention of the younger generation of physicists to three reasons that might have been responsible for failures in the past and might cause problems in the future: (i) misconceptions on the nature of physical theories, (ii) underestimation of the role of conceptual analyses so successfully employed by Galileo and Einstein, and (iii) overestimation of the predictive power of mathematics in physics.",
    "pdf_path": "data/automation/papers/arxiv_1001.4218v1.pdf",
    "url": "https://arxiv.org/pdf/1001.4218v1",
    "doi": null,
    "arxiv_id": "1001.4218v1",
    "openalex_id": null,
    "citation_count": 0,
    "is_open_access": true,
    "sync_timestamp": "2026-02-20 17:50:38.452670+00:00"
  },
  "snippets": [
    {
      "snippet_id": "Parxiv_1001_4218v1:S1",
      "paper_id": "arxiv:1001.4218v1",
      "section": "body",
      "text": "arXiv:1001.4218v1  [physics.hist-ph]  24 Jan 2010 Lessons from failures to achieve what was possible in the twentieth century physics Vesselin Petkov Science College, Concordia University 1455 De Maisonneuve Boulevard West Montreal, Quebec, Canada H3G 1M8 E-mail: vpetkov@alcor.concordia.ca",
      "page_hint": null,
      "token_count": 36,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S2",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "For several decades there has been no breakthrough in fundame ntal physics as revolutionary as relativity and quantum physics despite the amazing advancement of applied physics and technology. By discussing several examples o f what physics could have achieved by now, but failed, I will argue that the present state of fundamental physics is not caused by the lack of talented physicist s, but rather by problematic general views on how one should do physics. Although it appears to be widely believed that such general views cannot aﬀect the adva ncement of physics I would like to draw the attention of the younger generation of physicists to three reasons that might have been responsible for failures in th e past",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S3",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "and might cause problems in the future: (i) misconceptions on the natur e of physical theories, (ii) underestimation of the role of conceptual analyses s o successfully employed by Galileo and Einstein, and (iii) overestimation of the predict ive power of mathematics in physics. In recent years physicists have started to express publicly their concerns that not everything has been quite ﬁne with the advancement of physic s in the last several decades [1]. Although not all agree with such concerns I thin k it is an undeniable fact that in this period there has been no revolutionary brea kthrough in fundamental physics of the type of relativity and quantum physics. A conv enient answer might be that more experimental",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S4",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "evidence is required to make a breakt hrough possible. But what if it turns out that all conditions necessary for a new ph ysical theory have already been present but physicists have been failing to process suc cessfully the existing theo- retical and experimental evidence? A concise analysis of se veral missed opportunities in the twentieth century physics due to what I think are inade quate views on doing physics seems to suggest that this possibility should be tak en seriously. Physicists generally agree that physics describes and trie s to explain the world. However, this appears to be the only consensus. Physicists’ views on the nature of physical theories vary widely but I think the views which mig ht",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S5",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "prevent physicists who hold them from arriving at new results are those that rega rd our theories only as good descriptions of the world and that insist on not conside ring the “most successful abstractions to be real properties of our world” [2] (one can even come across extreme views that physics tells nothing about the existence of what it describes). I think these 1 are unproductive views negatively aﬀecting not only the adva ncement of physics, but also the physicists who share them and who often pay a high per sonal price. Here are two examples from the history of the twentieth century physi cs. It was precisely the view, that successful abstractions sho uld not be regarded as",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S6",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "representing something real, that prevented Lorentz from d iscovering special relativity. He believed that the time t of an observer at rest with respect to the aether (which is a genuine example of reifying an unsuccessful abstraction) was the true time, whereas the quantity t′ of another observer, moving with respect to the ﬁrst, was mer ely an abstraction that did not represent anything real in the worl d. Lorentz himself admitted the failure of his approach [3]: The chief cause of my failure was my clinging to the idea that t he vari- able t only can be considered as the true time and that my local time t′ must be regarded as no more than an auxiliary mathematical",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S7",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "qu antity. In Einstein’s theory, on the contrary, t′ plays the same part as t; if we want to describe phenomena in terms of x′, y ′, z ′, t ′ we must work with these variables exactly as we could do with x, y, z, t . The second example is especially relevant now since this yea r we celebrate the one hundredth anniversary of the publication of Minkowski’ s paper “Space and time” in 1909 [4]. A century after Minkowski, for some physicists s pacetime is nothing more than a four-dimensional mathematical space which does not represent a real four-dimensional world. In a recent Reference Frame N. David Mermin wrote that “spacetime is an abstract four-dimensional mathematical c",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S8",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "ontinuum” [2] and pointed out that regarding spacetime only as an abstract concept was a good example of not “inappropriately reifying our successful abstractions” [ 2]. However, if this were the case and spacetime were merely a mathematical space with no count erpart in the world, we would celebrate Poincar´ e, not Minkowski, because it was Po incar´ e who ﬁrst noticed (before July 1905) that the Lorentz transformations had a ge ometric interpretation as rotations in what he seemed to have regarded as an abstract four-dimensional space [5, p. 168]. The reason of why Poincar´ e failed to develop that idea seems to be even more complicated than that in the case of Lorentz. Poincar´ e appe ared to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S9",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "have seen nothing revolutionary in the idea of a mathematical four-dimension al space since he believed that our physical theories are only convenient description s of the world and therefore it is really a matter of convenience which theory we would use in a given situation. Poincar´ e’s failure to comprehend the profound physical me aning of the principle of relativity and of the geometric interpretation of the Loren tz transformations is one of the examples in the history of physics when an inadequate p hilosophical position prevents a scientist (even as great as Poincar´ e) from makin g a discovery. This should be speciﬁcally stressed because physicists oft en think that they do not need any philosophical position for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S10",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "their research. In o rder to make sure that inadequate philosophical views do not prevent us (especial ly young physicists) from arriving at important new results I think it would be helpful if from time to time we recall similar cases from the history of science or at least w hat the philosopher Daniel Dennett said on this issue: “Scientists sometimes deceive t hemselves into thinking 2 that philosophical ideas are only, at best, decorations or p arasitic commentaries on the hard, objective triumphs of science, and that they thems elves are immune to the confusions that philosophers devote their lives to dissolv ing. But there is no such thing as philosophy-free science; there is only science whose phi losophical",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S11",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "baggage is taken on board without examination” [6]. Had Minkowski believed, like Poincar´ e, that uniting space and time into a four- dimensional space was only a convenient mathematical abstr action, he would not have written a paper whose title and content were devoted to somet hing the main idea of which had already been published by Poincar´ e two years (and probably written three years) before Minkowski’s talk on space and time given in Sep tember 1908, and would not have begun his paper with the now famous introduction, wh ich unequivocally announced the revolution in our views on space and time: “Hen ceforth space by itself, and time by itself, are doomed to fade away into mere shadows,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S12",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "and only a kind of union of the two will preserve an independent reality” [7, p. xv]. Unlike Poincar´ e, Minkowski appears to have realized that s pecial relativity, partic- ularly relativity of simultaneity (which implies the exist ence of many spaces), would be impossible in a three-dimensional world. As a three-dimensional space constitutes a single class of absolutely simultaneous events, if the wor ld were three-dimensional (i.e., if spacetime were not representing a real four-dimen sional world and were just an abstract mathematical space), there would exist one abso lute space and one absolute class of simultaneous events in contradiction with relativ ity. If one tends to think that Minkowski had not done more than Poincar´ e on the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S13",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "uniﬁcation of space and time and that relativity does not force us to regard the world as fo ur-dimensional, it would be refreshingly helpful to examine the argument in the itali cized sentence (which ap- pears to have made Minkowski realize the profound physical m eaning of relativity of simultaneity) and to try to demonstrate that the theory of re lativity is possible in a three-dimensional world. When we take into account that relativity of simultaneity do es imply that, hav- ing diﬀerent classes of simultaneous events, observers in re lative motion have diﬀerent spaces, we can better understand why Minkowski noted “neither Eins tein nor Lorentz made any attack on the concept of space” [7, p. xxv] and emphas",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S14",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "ized that “We would then have in the world no longer the space, but an inﬁnite number of spaces, analo- gously as there are in three-dimensional space an inﬁnite nu mber of planes. Three- dimensional geometry becomes a chapter in four-dimensiona l physics. You see why I said at the outset that space and time are to fade away into sha dows, and that only a world in itself will subsist” [7, pp. xxi]. A hundred years ago Minkowski gave us the correct relativist ic picture of the world where the geodesic worldtubes of what we perceive as freely m oving three-dimensional macroscopic bodies are in reality four-dimensional object s, not “abstract geometric constructions” [2]. That macroscopic physical bodies are",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S15",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "r eal four-dimensional world- tubes is the essence of Minkowski’s explanation of the deep p hysical meaning of length contraction – as shown in Fig. 1 of his paper (the right-hand p art of which is repro- duced in Fig. 1 here) length contraction would be impossible if the worldtubes of the two Lorentzian electrons, represented by the vertical and t he inclined bands in Fig. 1, did not exist and were nothing more than abstract graphica l constructions. To see this more clearly consider only the electron represented by the vertical worldtube. The 3 three-dimensional cross-section P P , resulting from the intersection of the electron’s worldtube and the space of an observer at rest with respect to the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S16",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "electron, is the electron’s proper length. The three-dimensional cross-se ction P ′P ′, resulting from the intersection of the electron’s worldtube and the space of an observer moving with re- spect to the electron, is the relativistically contracted l ength of the electron measured by that observer. Minkowski stressed that “this is the meani ng of Lorentz’s hypoth- esis of the contraction of electrons in motion” [7, p. xxv] an d “that the Lorentzian hypothesis is completely equivalent to the new conception o f space and time, which, indeed, makes the hypothesis much more intelligible” [7, p. xxiii]. The worldtube of the electron must be real in order that length contraction be possible because, while measuring the same electron, the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S17",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "two observers in rela tive motion measure two three-dimensional electrons represented by the cross-sec tions P P and P ′P ′ in Fig. 1. Figure 1: In Minkowski’s paper “Space and Time” Fig. 1, part o f which is reproduced here, represents two Lorentzian electrons by their worldtu bes or as Minkowski called them (world) bands. This is not so surprising when one takes into account relativ ity of simultaneity and the fact that an extended three-dimensional object is de ﬁned in terms of simul- taneity – all parts of the electron taken simultaneously at a given mo ment. If the worldtube of the electron were indeed an abstract geometric construction and what existed was a single three-dimensional electron (a",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S18",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "single c lass of simultaneous events) represented by the proper cross-section P P , both observers would measure the same three-dimensional electron, i.e. the same class of simulta neous events in contradiction with relativity. 1. Missed opportunities due to failing to resolve the issue of the dimen- sionality of the world according to relativity.One of the main failures of the twentieth century physics is not taking seriously Minkowsk i’s arguments for the reality of spacetime or as he called it perhaps more appropriately “t he absolute world.” For some physicists this is not a failure at all since for them the question of whether or not spacetime is an abstract concept or represents a real fou r-dimensional world is not",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S19",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "a physical question since it rather belongs to philosophy. S uch a view is worrisome for several reasons. First, I wonder how many physicists wou ld subscribe to this view if directly asked whether the dimensionality of the world is a philosophical question (especially now when physicists freely talk about multidim ensional spaces and the multiverse). Second, I think such a view deprives physicist s from arriving at a deeper 4 understanding of what relativity is telling us about the wor ld. Third, this particular view has been responsible for not arriving at some important results as I intend to show here. 1.1. Dimensionality of the world and inertia. Inertia has been an open question for centuries and a golden",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S20",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "opportunity to ﬁnally start resol ving it in the twentieth century has been omitted because of an inadequate (and there fore unproductive) view on the nature of physical theories, namely the view that spac etime and worldtubes are theoretical constructions that do not represent anything r eal. If Minkowski’s explanation of length contraction is carefu lly examined, understood, and adopted, it becomes clear that this relativistic eﬀect wo uld be impossible if the worldtube of the contracted body did not exist. Then, when th e reality of the world- tube of an accelerating body is taken into account, one can ea sily link two facts: (i) the body resists its acceleration, and (ii) the worldtube of the accelerating body is",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S21",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "de- formed (not geodesic). As a real four-dimensional worldtub e should resist its (static) deformation (like any deformed three-dimensional rod) it i s natural to ask whether inertia originates from the four-dimensional stress arisi ng in the statically deformed worldtube. Calculations (i) in terms of the four-dimensional stress te nsor, (ii) in the case of the classical electron, and (iii) a semi-classical calcula tion in quantum ﬁeld theory, all appear to show that the static restoring force “arising” in t he deformed worldtube of an accelerating body has the form of the inertial force [8, Chap. 9]. In the case of a body at rest on the Earth’s surface its deformed worldtub e gives rise to a static restoring force",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S22",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "that is precisely F = mg. So taking into consideration the reality of worldtubes of macroscopic physical bodies implies that the equivalence of inertial and gravitational forces and masses may be explained by four-di mensional stresses arising in the deformed worldtubes of non-inertial bodies (i.e. in t he worldtubes that are deviated from their geodesic shape). The worldtube of a body falling in a gravitational ﬁeld is geodesic ( not deformed) and the body does not resist its fall. Minkowski would be thrilled to examine the possibility that inertia may be another manifestation of the four-dimensionality of the world, in a ddition to the kinematic relativistic eﬀects, which he believed were such manifestat ions. In fact, I think there were",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S23",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "two other failures to initiate the assault on the origin of inertia in the twentieth century. Those missed opportuni ties had been caused, in my view, mostly due to underestimation of the role of concept ual analyses in physics. Since regarding inertia as originating from a four-dimensi onal stress that arises in the deformed worldtubes of non-inertial macroscopic bodies pr ovides only a phenomeno- logical picture of what causes a body to resist its accelerat ion, the next question will be to reveal what gives rise to the four-dimensional stress. As the three-dimensional stress in a deformed three-dimensional rod is caused by elec tromagnetic forces acting on the atoms of the deformed rod that are deviated from their e quilibrium",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S24",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "positions, it is natural to search for a similar mechanism in the case of the four-dimensional stress. The ﬁrst attempt to explain the origin of inertia, that could be regarded as a candidate for such a mechanism, started on its own long befor e Minkowski. In 1881 Thomson [9] ﬁrst realized that a charged particle was more re sistant to being acceler- ated than an otherwise identical neutral particle and conje ctured that inertia can be reduced to electromagnetism. This conjecture had been deve loped in the framework 5 of the classical electron theory into what is now known as the classical electromagnetic mass theory of the electron (for details see [10, 11, 12]). In this theory inertia is re-",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S25",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "garded as originating from the interaction of the electron w ith its own electromagnetic ﬁeld. The electromagnetic mass theory of inertia correctly predi cts the experimental fact that at least part of the inertia and inertial mass of eve ry charged particle is electromagnetic in origin. As Feynman put it: “There is deﬁn ite experimental evidence of the existence of electromagnetic inertia – there is evide nce that some of the mass of charged particles is electromagnetic in origin” [13]. An d despite the fact that, at the beginning of the twentieth century, many physicists rec ognized “the tremendous importance which the concept of electromagnetic mass posse sses for all of physics” [14], it has been inexplicably abandoned after the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S26",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "advent of relativity and quantum mechanics. And that happened even though the classical elec tron theory predicted that the electromagnetic mass increases with increasing ve locity before the theory of relativity, yielding the correct velocity dependence, a nd that the relation between energy and mass is E = mc2 [13, pp. 28-3, 28-4] (in fact, the relationship between mass and energy contained a factor of 4/3, which prompted Fey nman to write ”It is therefore impossible to get all the mass to be electromagnet ic in the way we hoped. It is not a legal theory if we have nothing but electrodynamic s” [13, p. 28-4]; but he was unaware that the factor of 4/3 had already been accounted for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S27",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "[10]). In my view, there had been no justiﬁcation for abandoning the classical electron theory without a thorough analysis of how it made the predict ions mentioned in the above paragraph and especially its major prediction of the e lectromagnetic mass of charged particles. A completely wrong theory cannot make so many correct pre- dictions. Today “the state of the classical electron theory reminds one of a house under construction that was abandoned by its workmen upon re ceiving news of an approaching plague. The plague in this case, of course, was q uantum theory. As a result, classical electron theory stands with many intere sting unsolved or partially solved problems” [15, p. 213]. The other failure to start dealing",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S28",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "with the open question of i nertia is caused, I think, again by underestimation of the role of conceptual an alyses in physics. Accord- ing to the Standard Model the fundamental interactions are m ediated by the exchange of virtual quanta. However, a rigorous conceptual analysis of how exactly the exchange of virtual quanta gives rise to the electromagnetic forces, for example, appears to have never been carried out. Having a detailed description of the mechanism of interac- tion between particles in the Standard Model would have made it possible to examine whether it can provide an explanation of the origin of inerti a. Indeed, if the electro- magnetic force between two charges, for instance, can be ful ly understood",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S29",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "in terms of the recoils to which a charge is subjected when emitting and a bsorbing virtual photons, then one can expect that inertia might be explained by the Sta ndard Model. How the recoils from virtual photons absorbed by an elementa ry charge cause its inertia can be demonstrated by considering a free charge . The recoils it suﬀers due to the emission and absorption of the virtual photons of i ts own (quantized) electromagnetic ﬁeld cancel out precisely due to the spheri cal symmetry of the ﬁeld. However, taking into account the general-relativistic fre quency shift of the incoming virtual photons that are absorbed by a non-inertial charge (accelerated or supported 6 in a gravitational ﬁeld) implies that",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S30",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "the recoils imparted o n the charge by the absorbed (“blue” and “red” shifted) virtual photons of its own ﬁeld do not cancel out. That imbalance in the recoils gives rise to a self-force which is e lectromagnetic in origin and which acts on the non-inertial charge [8, Chap. 9]. As a resul t the charge resists its acceleration or its being prevented from falling in a gravit ational ﬁeld. In other words, the non-inertial charge resists its deviation from its geod esic path, which implies that the self-force manifest itself as an electromagnetic compo nent of the inertial force. As according to the Standard Model the strong and weak intera ctions are likewise mediated by virtual quanta it follows",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S31",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "that a non-inertial el ementary particle that is involved in weak and strong interactions will be also subjec ted to the imbalanced recoils from the virtual quanta of its own strong and weak “ﬁelds”, wh ich are absorbed by the non-inertial particle. This mechanism implies that all int eractions in the framework of the Standard Model contribute to the inertia and mass of elem entary particles. That contribution might either complement the Higgs mechanism o r provide an alternative mechanism. It should be emphasized that the same mechanism that accounts for inertia and mass of the classical electron – the interaction of the elect ron charge with its own ﬁeld – appears to be at work at the quantum level",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S32",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "as well. This w ould explain why the electron theory correctly predicted the existence of el ectromagnetic inertia and would demonstrate that if the electron theory had not been pr ematurely abandoned its careful examination would have naturally led to the mech anism that gives rise to inertia and mass at the quantum level. 1.2. Worldtubes and anisotropic velocity of light in non-in ertial reference frames. The missed opportunity to have a complete understanding of p ropagation of light in non-inertial reference frames is another example of undere stimation of the power of conceptual analysis and not taking seriously Minkowski’s v iew that physical objects are worldtubes in spacetime. Try to recall how many books on r elativity deﬁne av-",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S33",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "erage anisotropic velocity of light in accelerating frames or in a gravitational ﬁeld. Of course, the Sagnac eﬀect and the time delay (Shapiro) eﬀect, for example, are nicely discussed but they have never been explained properl y in terms of the average anisotropic velocity of light. Although deriving the expression for the average anisotrop ic velocity of light is straightforward [8, Chap. 7] realizing the need for such a ve locity requires just a little trust in conceptual analyses – the type of analyses that made Galileo and Einstein, for instance, such great scientists. This can be demonstrated by considering the famous example o f Einstein’s ele- vators – accelerating or at rest in a gravitational ﬁeld. We w ill",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S34",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "do it for the case of an accelerating elevator; the same analysis applies for a n elevator supported in a gravitational ﬁeld. Fig. 2 depicts an elevator which accele rates with an acceleration a. Two light rays emitted from A and C toward the middle point of the elevator B are introduced (in addition to the original horizontal light ra y) in order to demonstrate that the average velocity of light in an accelerating frame i s not c (but the local ve- locity is, of course, c). The three light rays are emitted simultaneously in the elevator from points D, A, and C toward point B. Let I be an inertial reference frame in- stantaneously at rest with respect",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S35",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "to the elevator (i.e., th e instantaneously comoving frame) at the moment the light rays are emitted. As I and the non-inertial frame N 7 rB ✻r B′ ❄δ = al2/ 2c2 A r rC r D s — — ✻ ❄ 2l ✲✛ l ❄ ✻ ✻a Figure 2: Propagation of light in an accelerating Einstein e levator. of the elevator share a common instantaneous three-dimensi onal space and therefore common simultaneity at the moment the three light signals ar e emitted, the emission of the rays is simultaneous in N as well as in I. At the next moment an observer in I sees that the three light rays arrive simultaneously not at p oint B, but at",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S36",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "B′, since for the time t = l/c the light rays travel toward B, the elevator moves a distance δ = at2/ 2 = al2/ 2c2. As the simultaneous arrival of the three rays at point B′ as viewed in I is an absolute fact due to its being a single event, it follows that the rays arrive simultaneously at B′ as seen in N as well. Since for the same coordinate time t = l/c in N, the three light rays travel diﬀerent distances DB′ ≈ l, AB′ = l + δ, and CB ′ = l − δ, before arriving simultaneously at point B′, an observer in the elevator concludes that the propagation of light is aﬀected by",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S37",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "the elev ator’s acceleration. As seen in Fig. 2 an observer in N concludes (to within terms ∼ c−2) that the average velocities of the light rays propagating from A to B′ and from C to B′ are slightly greater and smaller than c, respectively. AB'C B a z Figure 3: The simultaneous arrival of the vertical light ray s at point B′ in Fig. 2 is self-evident when it is taken into account that the points A, B, C, and B′ are worldlines, which are curved. One can arrive at the idea that the average velocity of light i n non-inertial frames is not c also by taking into account that the light rays and the points A, B,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S38",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "C, and B′ are in reality worldlines in spacetime. It is clearly seen in Fig . 3 that the light rays emitted 8 from A and C arrive simultaneously at B′, not at B, due the fact that the worldlines of the points A, B, C, and B′ are curved. When the curvature of the worldtubes of the emitter and the receiver in the gravitational redshift ( Pound–Rebka) experiment is taken into account one can easily overcome a widely shared misconception – that the redshift eﬀect proves the curvature of spacetime [16]. Wh at it proves is that the worldtubes of the emitter and the receiver are curved (not ge odesic). Overlooking the introduction of an average velocity of ligh",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S39",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "t in non-inertial frames has led to another missed opportunity – a derivation of an ani sotropic volume element, which is necessary for calculating electromagnetic phenom ena directly in such frames. Using the anisotropic volume element in those calculations simultaneously solved two old problems – the appearance of (i) a factor of 1 / 2 in Fermi’s potential of a charge in a gravitational ﬁeld, and (ii) a factor of 4 / 3 in the expression of the self-force acting on a non-inertial classical electron [8, Chap. 8]. 1.3. Worldtubes and the discovery of general relativity. This section is speciﬁcally devoted to the young generation of physicists. It is sometim es claimed that future researchers cannot be taught how to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S40",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "make discoveries since d iscoveries are logical jumps coming as sudden insights to individual researchers. Often general relativity is given as an excellent example. Moreover, Einstein himself descri bed the realization that a person falling from the roof of a house does not feel the force of gravity as the happiest thought in his life. Such insights do exist in the history of s cience but not all advances in science follow that pattern – it is suﬃcient to mention how conceptual analyses helped Galileo to arrive at the idea of inertial motion (by di sproving Aristotle’s view of motion) and at his principle of relativity. Even Einstein himself convincingly proved that conceptual analyses are physics at its best by",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S41",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "his thoug ht experiments. General relativity is indeed an excellent example but not of the view that discov- eries are results of happy insights; it is an example of makin g discoveries by having a productive view on the nature of physical theories and by em ploying a rigorous conceptual analysis of the available theoretical and exper imental evidence. Minkowski’s representation of special relativity makes it possible to arrive at the idea of gravity as a manifestation of the non-Euclidean geom etry of spacetime not just naturally, but inescapably. A conceptual analysis of Newto n’s gravitational theory could and should have revealed, long before Einstein realiz ed it, that a falling body oﬀers no resistance to its acceleration. This means",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S42",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "that the b ody is not subjected to any gravitational force, which would be necessary if the b ody resisted its fall. Therefore, the falling body moves non-resistantly, by iner tia. But how could that be since it accelerates? Taking seriously the existence of worldtubes and its implic ation that inertia origi- nates from a four-dimensional stress that arises in the defo rmed worldtube of a non- inertial body provide a radical resolution – the worldtube o f the falling body should be curved (reﬂecting the fact that the body accelerates), but n ot deformed (accounting for the fact that the body does not resist its acceleration). Such a worldtube can exist only in a curved spacetime where the geodesic",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S43",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "worldtubes of b odies moving by inertia (non-resistantly) are curved but not deformed . 2. The major missed opportunity in quantum physics.No one knows what the quantum object is. What is worse is that the standard inte rpretation of quantum mechanics tells us that we cannot say or even ask anything abo ut the quantum ob- 9 ject between measurements. In this sense, I think, Einstein was right that quantum mechanics is essentially incomplete. It is unrealistic to a ssume that an electron, for example, does not exist between measurements. But if it exis ts, it is something and we should know what that something is. In general, we should t ry to understand what the (free or interacting) quantum",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S44",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "object is. Although relativity does not fully apply at the quantum leve l since its equations of motion manifestly fail to describe the behaviour of quant um objects, spacetime does seem to be the arena of the quantum world as well. Then the question is: “Are quantum objects also worldlines in spacetime?” It is well kn own that the answer is negative. This can be demonstrated in the case of interference experim ents performed with single electrons [17]. In such double–slit experiments acc umulation of successive single electron hits on the screen builds up the interference patte rn that demonstrates the wave behaviour of single electrons. When looking at the screen, every single electro n is detected as a localized",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S45",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "entity and the natural question is whether the electron was such an entity before it hit the screen. Our intuition leads u s to assume that if the electron hits the screen as a localized entity, it is such an e ntity at every moment of time, which implies that the electron exists continuously in time as a localized entity. But if this were the case, every single electron would behave as an ordinary particle and should go only through one slit and no interference patte rn would be observed on the screen. Therefore, the electron cannot be a localized entity at all moments of time, i.e. it cannot be a worldline in spacetime. If this had been realized (and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S46",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "it could have been realized if m ore trust had been put in conceptual analyses), it could not have been so diﬃcult to ask whether an electron exists continuously in time if it is not a worldline. Such a question could have pro vided a new perspective at looking at quantum phenomena and appare nt paradoxes. 3. Possible missed opportunities to test string theory.I think string theory is perhaps the best example of overestimation of the predict ive power of mathematics in physics. String theory constitutes an unprecedent case i n the history of physics – while string theorists all admit that the theory has not yet been experimentally conﬁrmed they behave as if this has already been done (or",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S47",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "will certainly be done) and string theory has been treated on equal footing with the acce pted physical theories. A necessary condition that should be met by any newly propose d physical theory is not contradicting the existing reliable theoretical and experimental evidence. It is precisely here where I think opportunities to test string theory might have been missed. Let me give just one example. While string theory has extensively studied how the interactions in the hydrogen atom can be represented in terms of the string formalism, I wonder how string theory would answer a much sim pler question – what should be the electron in the ground state of the hydrogen ato m in order that the hydrogen atom",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S48",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "does not possess a dipole moment in that state? 10 References [1] L. Smolin, The Trouble With Physics: The Rise of String Theory, The Fall of a Science, and What Comes Next (Houghton Miﬄin Harcourt, Boston 2006) [2] N. David Mermin, P hysics Today, May 2009, p 8 [3] H. A. Lorentz, The Theory of Electrons and Its Applications to the Phenomena of Light and Radiant Heat , 2nd ed. (Dover, Mineola, New York 2003) p 321 [4] H. Minkowski, “Raum und Zeit”, Physikalische Zeitschrift 10 (1909) pp 104–111; Jahresbericht der Deutschen Mathematiker-Vereinigung 18 (1909) pp 75–88 [5] H. Poincar´ e, “Sur la dynamique de l’´ electron”,Rendiconti del Circolo matematico Rendiconti del Circolo di Palermo 21 (1906) pp 129–176 [6]",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S49",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "D.C. Dennett, Darwin’s Dangerous Idea: Evolution and the Meanings of Life (Simon and Schuster, New York 1996) p 21 [7] H. Minkowski, “Space and Time.” New translation by D. Leh mkuhl in: V. Petkov (ed.) Minkowski Spacetime: A Hundred Years Later (Springer, Heidelberg 2010) pp xiv–xlii [8] V. Petkov, Relativity and the Nature of Spacetime , 2nd ed. (Springer, Heidelberg 2009) [9] J.J. Thomson, Phil. Mag. 11, 229 (1881) [10] F. Rohrlich, Classical Charged Particles (Addison-Wesley, New York 1990) p 218 [11] M. Jammer, Concepts of Mass in Contemporary Physics and Philosophy (Prince- ton University Press, Princeton, 2000) p 34 [12] J.W. Butler, Am. J. Phys. 37, 1258 (1969) [13] R.P. Feynman, R.B. Leighton and M. Sands, The Feynman Lectures",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1001_4218v1:S50",
      "paper_id": "arxiv:1001.4218v1",
      "section": "abstract",
      "text": "on Physics , Vol. 2 (Addison-Wesley, New York 1964) [14] E. Fermi, Rend. Acc. Lincei (5) 31, 184; 306 (1922) [15] P. Pearle, Classical Electron Models. In: Electromagnetism: Paths to Research , ed. by D. Teplitz (Plenum Press, New York 1982) pp 211–295 [16] C.W. Misner, K.S. Thorne, J.A. Wheeler, Gravitation (Freeman, San Francisco 1973) p 189 [17] A. Tonomura, J. Endo, T. Matsuda, T. Kawasaki, and H. Exa wa, Demonstration of single-electron buildup of an interference pattern, American Journal of Physics 57 (1989) pp 117-120 11",
      "page_hint": null,
      "token_count": 87,
      "paper_year": 2010,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9849491737148441,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    }
  ],
  "extraction_meta": {
    "extractor": "pypdf",
    "two_column_applied": false,
    "ocr_applied": false,
    "pages_total": 11,
    "empty_pages": 0,
    "empty_page_pct": 0.0,
    "page_stats": [
      {
        "page": 1,
        "chars": 2831,
        "empty": false
      },
      {
        "page": 2,
        "chars": 3503,
        "empty": false
      },
      {
        "page": 3,
        "chars": 3774,
        "empty": false
      },
      {
        "page": 4,
        "chars": 2771,
        "empty": false
      },
      {
        "page": 5,
        "chars": 3756,
        "empty": false
      },
      {
        "page": 6,
        "chars": 3753,
        "empty": false
      },
      {
        "page": 7,
        "chars": 3723,
        "empty": false
      },
      {
        "page": 8,
        "chars": 1763,
        "empty": false
      },
      {
        "page": 9,
        "chars": 3782,
        "empty": false
      },
      {
        "page": 10,
        "chars": 3217,
        "empty": false
      },
      {
        "page": 11,
        "chars": 1948,
        "empty": false
      }
    ],
    "quality_score": 0.9849,
    "quality_band": "good"
  }
}