{
  "paper": {
    "paper_id": "arxiv:1805.06617v1",
    "title": "What is \"fundamental\"?",
    "authors": [
      "Matt Visser"
    ],
    "year": 2018,
    "venue": "arXiv",
    "source": "arxiv",
    "abstract": "Our collective views regarding the question \"what is fundamental?\" are continually evolving. These ontological shifts in what we regard as fundamental are largely driven by theoretical advances (\"what can we calculate?\"), and experimental advances (\"what can we measure?\"). Rarely (in my view) is epistemology the fundamental driver; more commonly epistemology reacts (after a few decades) to what is going on in the theoretical and experimental zeitgeist.",
    "pdf_path": "data/automation/papers/arxiv_1805.06617v1.pdf",
    "url": "https://arxiv.org/pdf/1805.06617v1",
    "doi": null,
    "arxiv_id": "1805.06617v1",
    "openalex_id": null,
    "citation_count": 0,
    "is_open_access": true,
    "sync_timestamp": "2026-02-20 17:50:38.451824+00:00"
  },
  "snippets": [
    {
      "snippet_id": "Parxiv_1805_06617v1:S1",
      "paper_id": "arxiv:1805.06617v1",
      "section": "body",
      "text": "arXiv:1805.06617v1  [physics.hist-ph]  17 May 2018 What is “fundamental”? Matt Visser School of Mathematics and Statistics Victoria University of Wellington, PO Box 600, Wellington 6140, New Zealand E-mail:matt.visser@sms.vuw.ac.nz",
      "page_hint": null,
      "token_count": 27,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S2",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "Our collective views regarding the question “what is fundamental?” are continually evolving. These ontological shifts in what we regard as fundamental are largely driven by theoretical advances (“what can we calculate?”), and experimental advances (“what can we measure?”). Rarely (in my view) is epistemology the fundamen tal driver; more commonly epistemology reacts (after a few decades) to whatis going on in the theoretical and experimental zeitgeist. Keywords: Foundations of physics; foundations of mathematics; foundations of science; ontology; epistemology; empiricalism. Date: 19 January 2018; 17 May 2018; LATEX-ed 18 May 2018. Purpose: Essay written for the FQXi 2018 essay contest:What is “fundamental”? What is “fundamental”? 2 Just what we view as “fundamental” is a pragmatic decision based, at least partially, on",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S3",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "what we can calculate and on what we can measure. (Sometimes, w hat we can easily calculate and easily measure.) Ultimately this is simply a reﬂection of the fact that science is a human endeavour, and sometimes certain topics are simp ly relegated to the “too hard” basket. This is not necessarily due to laziness, often is is a simple pragmatic decision based on what one might reasonably hope to accomplish with ﬁ nite resources. For me, it is far better to grasp the universe as it really is than to per sist in delusion, however satisfying and reassuring. —Carl Sagan In the 20th century “fundamental physics” was often viewed as b eing synonymous with special and general relativity, quantum",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S4",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "physics, and relativist ic quantum ﬁeld theory. This was a grossly simplistic, but exceedingly common, point o f view. At least one quantum ﬁeld theorist is infamous for referring to condensed m atter physics as “squalid state physics”; there were also quantum ﬁeld theorists wh o viewed the entire geometrical interpretation of general relativity as irrelevant nois e; and there was (and still is) considerable tension between some segments of the relativit y and ﬁeld theory communities. A university student attending lectures on general relativity in the morning and others on quantum mechanics in the afternoon might be forgiven fo r thinking that his professors are fools, or have neglected to communicate w ith each other for at least a",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S5",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "century. —Carlo Rovelli Foundations of quantum mechanix were for much of the 20th centu ry often quietly ignored, when not being outright suppressed — a common attitude b eing “you will come to know the rules”, sometimes summarized as the “shut up and calculate” non-interpretation of quantum physics. Indeed, as long as there were lots of viable “bash and see” scattering experiments in the pipeline, and relatively few viable experimental proposals for testing the “collapse of the wavefunc tion”, then concentrating on what is achievable was not entirely irrational. The subtlety then lies in recognizing when foundational experimental proposals are becoming viable; or when foundational theoretical approaches are becoming somewhat more mature and stable. Sometimes ﬁction gives a good window",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S6",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "into reality: Consider the ﬁctional musings of the ﬁctional physicist Shevek [1]: ...the physicists of [Einstein’s] own world had turned away from his eﬀor t and its failure, pursuing the magniﬁcent incoherencies of quantum theo ry, with its high technological yields, ... to arrive at a dead end, a catastrophic f ailure of the imagination. — Shevek circa 2500 CE What is “fundamental”? 3 The tension between quantum physics and classical general relativ ity is probably most acute when contemplating the black hole information “puzzle”. (I po int blank refuse to characterize this issue as a “paradox”.) The tension arises only by e xtrapolating two extremely useful but approximate “fundamental” concepts (cur ved space quantum ﬁeld theory and general relativistic",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S7",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "classical event horizons) into realm s where we really have no reason to trust them. God does not play dice with the universe. —Albert Einstein Not only does God play dice but ... he sometimes throws them where the y cannot be seen. —Stephen Hawking What we view as “fundamental astronomy” has also shifted radically over the course of the 20th century. The idea that nuclear reactions could power s tellar luminosity was new and radical in the 1929s; cosmology and cosmography (as scien ce) did not really exist until the 1920s. The “big bang” was not widely accepted until t he 1950s. Don’t let me catch anyone talking about the universe in my departmen t. —Ernest Rutherford Even special",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S8",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "relativistic astrophysics was largely a post-1960s phe nomenon. This aspect of the evolution of the cosmological zeitgeist was primarily driven by a n interplay between improved observational and improved calculational techn iques. Far out in the uncharted backwaters of the unfashionable end of t he western spiral arm of the galaxy lies a small unregarded yellow sun. Orbiting th is at a distance of roughly ninety-two million miles is an utterly insigniﬁcant litt le blue green planet whose ape-descended life forms are so amazingly p rimitive that they still think digital watches are a pretty neat idea. —Douglas Adams The more things change, the more they stay the same — the now 20 y ear old acceptance of the accelerating",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S9",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "universe implies, (though no-one would be so cra ss as to actually say so), that the 1950s notion of the “heat death of the universe” is b ack with a vengeance — though to make it look more respectable and up-to-date, maybe we should now re-label it as the “entropy death”: The bright sun was extinguish’d, and the stars Did wander darkling in the eternal space. —Byron What is “fundamental”? 4 At one stage the “geocentric” point of view was considered fundam ental, no longer: We have developed from the geocentric cosmologies of Ptolemy and h is forebears, through the heliocentric cosmology of Copernicus and Galileo, to the modern picture in which the earth is a medium-sized planet orbiting aro",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S10",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "und an average star in the outer suburbs of an ordinary spiral galaxy, which is itself only one of about a million million galaxies in the observable universe. —Stephen Hawking In mathematics perhaps the biggest shift in mathematical fundame ntals in the 20th century was initiated by the G¨ odel incompleteness results — eﬀect ively demonstrating the limitations of the axiomatic framework: Kurt G¨ odel ... proved that the world of pure mathematics is inexhau stible. No ﬁnite set of axioms and rules of inference can ever encompass th e whole of mathematics. Given any ﬁnite set of axioms, we can ﬁnd meaningfu l mathematical questions which the axioms leave unanswered. This dis covery ... came at ﬁrst as an",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S11",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "unwelcome shock to many mathematicians. It des troyed ... the hope that they could solve the problem of deciding by a systema tic procedure the truth or falsehood of any mathematical statemen t. ... G¨ odel’s theorem, in denying ... the possibility of a universal algorithm to settle all questions, gave ... instead, a guarantee that mathematics can nev er die. ... there will always be, thanks to G¨ odel, fresh questions to ask and f resh ideas to discover. —Freeman Dyson This in turn connects back to Wigner’s “unreasonable eﬀectiveness of mathematics” when applied to physics (or any other scientiﬁc endeavour for that matter): Philosophy [nature] is written in that great book which ever is before our eyes —",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S12",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "I mean the universe — but we cannot understand it if we do not ﬁrst learn the language and grasp the symbols in which it is written. The book is written in mathematical language, and the symbols are triangles, cir cles and other geometrical ﬁgures, without whose help it is impossible to comp rehend a single word of it; without which one wanders in vain through a dark laby rinth. —Galileo Galilei What is “fundamental”? 5 There cannot be a language more universal and more simple, more fr ee from errors and obscurities ... more worthy to express the invariable rela tions of all natural things [than mathematics]. [It interprets] all phenomena b y the same language, as if to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S13",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "attest the unity and simplicity of the plan of the univ erse, and to make still more evident that unchangeable order which presid es over all natural causes. —Joseph Fourier As far as the laws of mathematics refer to reality, they are not cer tain; and as far as they are certain, they do not refer to reality. —Albert Einstein In biology, the mid-century revolution in molecular biology (speciﬁcally the discovery of RNA and DNA) completely rewrote our ideas of what was fundamen tal biology — with “reverse engineering” of the genetic code eventually leading to the development of bio-informatics as an almost-stand-alone discipline bridging biology, m athematics, and computer science. That there are still fundamental and foundat ional issues",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S14",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "at play here can be seen from the relative “vagueness” of the deﬁnition of a gen e — if a segment of genetic code seems to do something useful, we will call it a gene. Th is deﬁnition somehow lacks the “precision” that most mathematicians or theore tical physicists would be comfortable with, but at least for the time being, it is certainly pra gmatically useful. The beauty in the genome is of course that it’s so small. The human gen ome is only on the order of a gigabyte of data ... which is a tiny little database . If you take the entire living biosphere, that’s the assemblage of 20 million species or so that constitute all the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S15",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "living creatures on the planet, and you have a genome for every species the total is still about one petabyte, th at’s a million gigabytes — that’s still very small compared with Google or the Wikiped ia and it’s a database that you can easily put in a small room, easily trans mit from one place to another. And somehow mother nature manages t o create this incredible biosphere, to create this incredibly rich environment o f animals and plants with this amazingly small amount of data. —Freeman Dyson One particularly diﬃcult issue when working on foundations or fundam entals in any ﬁeld is that one quickly encounters the crackpot fringe; the noise/ signal ratio is often distressingly high. A",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S16",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "key point to keep ﬁrmly in mind is that (crackpot) ̸= (wrong). There are crackpots who are (often accidentally) correct, and t here are people who are wrong on some issue without being in any way crackpot. Detecting a c rackpot has more to do with the style (and internal logical incoherence) of the argum ents being used, than the actual technical points being raised. What is “fundamental”? 6 How is it that hardly any major religion has looked at science and conclu ded, “This is better than we thought! The universe is much bigger than ou r prophets said, grander, more subtle, more elegant?” Instead they say, “N o, no, no! My god is a little god, and I",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S17",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "want him to stay that way.” —Carl Sagan While our views on what is fundamental change with the times — this sho uld not be taken as an excuse for not doing the hard work. It is distressingly e asy to redeﬁne any problem away using linguistic tricks — one should be very careful t o make sure one is doing more than just playing linguistic tricks. Developing a forma lism that is so badly designed and implemented that one cannot even formulate the question you were originally interested in does not mean you have actually solved the que stion. There is a long-standing joke in the theoretical physics community regardin g the “redeﬁnition group” — like the “renormalization group”",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S18",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "it is actually a semi-group — t he ﬂow is one-way and inverse operations need not necessarily exist. In app lying the “redeﬁnition group” one simply successively redeﬁnes concepts and notions unt il the answer you have turns into the answer you want. For instance, some segments of the theoretical physics community are now greatly enamoured of “post-empirical science”, a quite remarkable oxymo ron. In fact, if one looks more carefully at what the philosophers of science are actually saying, they seem to be arguing for “semi-empirical theory veriﬁcation” — if you canno t directly test the theory of interest, then look around the edges, ﬁnd some “paralle l” theories (models) slightly diﬀerent from what you are really interested in,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S19",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "but close eno ugh that there is at least some overlap, and then empirically test those “parallel” mode ls. Semi-empirical techniques along these lines then still tie into Popper’s notion of “fals iﬁability”. I would argue that “falsiﬁability” should be an aspiration, not necessarily th e be-all and end-all of the deﬁnition of science. There is nothing wrong with a temporary tactical retreat from falsiﬁability, while one is putting one’s house in order — but the ret reat should be both temporary and tactical, not an open-ended admission of defe at. (If the temporary tactical retreat takes up a signiﬁcant fraction of one’s professio nal lifetime, then properly speaking it is neither tactical not temporary, one should re-think t he",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S20",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "matter.) In summary, simply because science is a human endeavour, the prec ise details of what we consider to be fundamental will unavoidably change with the times . On this topic at least, it is perhaps safer to stick to general themes, such as th e quantum-to-gravity interface, and avoid excessive precision. — ### — What is “fundamental”? 7 Acknowledgments Supported via the Marsden Fund, administered by the Royal Society of New Zealand. Some reading [1] Ursula Le Guin,The Dispossessed, (Harper, 1974). This is one of the few novels to make a research physicist the central character, and do so in a subtle and convincing manner. [2] Roger Penrose, The emperor’s new mind, (Oxford, 1989). [3] Roger Penrose, Shadows of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S21",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "the mind, (Oxford, 1994). [4] Roger Penrose, The road to reality, (Alfred Knopf, 2004). [5] Eugene Wigner, “Remarks on the mind-body question”, in: Irving John Good (Isadore Jacob Gudak),The Scientist Speculates, (Heinemann, London, 1961) [6] “Has anyone seen that bastard Schr¨ odinger?” [7]Quantum questions: Mystical writings of the world’s great physicists, edited by Ken Wilbur, (Shambhala, Boston, 1984 & 2001) [8] John Stewart Bell,Speakable and unspeakable in quantum mechanics, (Cambridge, England, 1987 and 2013) [9] Matt Visser, “Which number system is “best” for describing empirical reality?”, FQXi 2012 essay contest: “Questioning the foundations. Which of our basic physical assumptions are wrong?”, arXiv:1212.6274 [math-ph] [10] Matt Visser, “The utterly prosaic connection between physicsand mathematics”, FQXi 2015 essay contest: “Trick or truth:",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1805_06617v1:S22",
      "paper_id": "arxiv:1805.06617v1",
      "section": "abstract",
      "text": "The mysterious connection between physics and mathematics”, arXiv:1703.00571 [physics.hist-ph] [11] Matt Visser, “From mindless mathematics to thinking meat?”, FQXi 2017 essay contest: “Wandering towards a goal: How can mindless mathematical laws give rise to aims and intention?”, arXiv:1707.08727 [physics.hist-ph]",
      "page_hint": null,
      "token_count": 39,
      "paper_year": 2018,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.974184876310424,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    }
  ],
  "extraction_meta": {
    "extractor": "pypdf",
    "two_column_applied": false,
    "ocr_applied": false,
    "pages_total": 7,
    "empty_pages": 0,
    "empty_page_pct": 0.0,
    "page_stats": [
      {
        "page": 1,
        "chars": 956,
        "empty": false
      },
      {
        "page": 2,
        "chars": 2717,
        "empty": false
      },
      {
        "page": 3,
        "chars": 2193,
        "empty": false
      },
      {
        "page": 4,
        "chars": 2157,
        "empty": false
      },
      {
        "page": 5,
        "chars": 2732,
        "empty": false
      },
      {
        "page": 6,
        "chars": 2768,
        "empty": false
      },
      {
        "page": 7,
        "chars": 1587,
        "empty": false
      }
    ],
    "quality_score": 0.9742,
    "quality_band": "good"
  }
}