{
  "paper": {
    "paper_id": "arxiv:2103.04077v3",
    "title": "Show Me What You Can Do: Capability Calibration on Reachable Workspace for Human-Robot Collaboration",
    "authors": [
      "Xiaofeng Gao",
      "Luyao Yuan",
      "Tianmin Shu",
      "Hongjing Lu",
      "Song-Chun Zhu"
    ],
    "year": 2021,
    "venue": "arXiv",
    "source": "arxiv",
    "abstract": "Aligning humans' assessment of what a robot can do with its true capability is crucial for establishing a common ground between human and robot partners when they collaborate on a joint task. In this work, we propose an approach to calibrate humans' estimate of a robot's reachable workspace through a small number of demonstrations before collaboration. We develop a novel motion planning method, REMP, which jointly optimizes the physical cost and the expressiveness of robot motion to reveal the robot's reachability to a human observer. Our experiments with human participants demonstrate that a short calibration using REMP can effectively bridge the gap between what a non-expert user thinks a robot can reach and the ground truth. We show that this calibration procedure not only results in better user perception, but also promotes more efficient human-robot collaborations in a subsequent joint task.",
    "pdf_path": "data/automation/papers/arxiv_2103.04077v3.pdf",
    "url": "https://arxiv.org/pdf/2103.04077v3",
    "doi": null,
    "arxiv_id": "2103.04077v3",
    "openalex_id": null,
    "citation_count": 0,
    "is_open_access": true,
    "sync_timestamp": "2026-02-20 17:50:38.454059+00:00"
  },
  "snippets": [
    {
      "snippet_id": "Parxiv_2103_04077v3:S1",
      "paper_id": "arxiv:2103.04077v3",
      "section": "body",
      "text": "IEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED JANUARY , 2022 1 Show Me What You Can Do: Capability Calibration on Reachable Workspace for Human-Robot Collaboration Xiaofeng Gao1, Luyao Yuan1, Tianmin Shu 2, Hongjing Lu 3, Song-Chun Zhu 4",
      "page_hint": null,
      "token_count": 39,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S2",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "do with its true capability is crucial for establishing a common ground between human and robot partners when they collaborate on a joint task. In this work, we propose an approach to calibrate humans’ estimate of a robot’s reachable workspace through a small number of demonstrations before collaboration. We develop a novel motion planning method, reachability- expressive motion planning (REMP), which jointly optimizes the physical cost and the expressiveness of robot motion to reveal the robot’s reachability to a human observer. Our experiments with human participants demonstrate that a short calibration using REMP can effectively align a non-expert user’s estimation of the robot’s reachability with its true capacity. We show that this calibration procedure not only results in better user",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S3",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "perception, but also promotes more efﬁcient human-robot collaborations in a subsequent joint task. * Index Terms—Human-Aware Motion Planning, Human Fac- tors and Human-in-the-Loop, Human-Robot Collaboration I. I NTRODUCTION O NE of the main challenges in Human-Robot Interaction is that the capacity of the robot perceived by the human partner may not be consistent with its actual capacity [1], [2], [3]. Such discrepancy may lead to overuse or misuse of the robot. Particularly, in an ad-hoc teaming setting where humans do not have prior experience with their robot partners, the consequence caused by such discrepancy could be detrimental to the team collaboration [4]. In this work, our key insights to address this challenge are two-fold: i) humans’ perception of the capability",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S4",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "of a robot can be calibrated by observing its behavior, e.g., robot demonstrat- ing its motion trajectories in pursuit of certain goals, and ii) Manuscript received: September 9, 2021; Revised December 26, 2021; Accepted January 12, 2022. This paper was recommended for publication by Editor Gentiane Venture upon evaluation of the Associate Editor and Reviewers’ comments. This work was supported by DARPA XAI N66001-17-2-4029. 1Xiaofeng Gao and Luyao Yuan are with UCLA Center for Vision, Cognition, Learning, and Autonomy (VCLA), Los Angeles, CA 90095, USA (e-mail: xfgao@ucla.edu, yuanluyao@ucla.edu) 2Tianmin Shu is with Department of Brain and Cognitive Sciences, Mas- sachusetts Institute of Technology, Cambridge, MA 02139, USA (e-mail: tshu@mit.edu) 3Hongjing Lu is with UCLA Department of Psychology, Los Angeles, CA",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S5",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "90095, USA (e-mail: hongjing@ucla.edu) 4Song-Chun Zhu is with Beijing Institute for General Artiﬁcial Intelligence (BIGAI), Beijing 100080, China, with School of Artiﬁcial Intelligence and Institute for Artiﬁcial Intelligence, Peking University, Beijing 100871, China, and also with Department of Automation, Tsinghua University, Beijing 100871, China (e-mail: sczhu@bigai.ai) Digital Object Identiﬁer (DOI): see top of this page. *Code and demos are available at https://xfgao.github.io/calib2022ral/. calibrating the perceived robot capability improves the quality of subsequent human-robot collaboration. We focus on a case study as shown in Figure 1, where a human user and a robot share the same workspace, and they must take turns picking up all objects as fast as possible. As the robot can only reach part of the workspace due",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S6",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "to its mechanical limits, the human partner needs to pick up the objects that the robot can not reach to achieve maximum efﬁciency in completing this joint task. We introduce capability calibration as shown in Figure 1b, where we allow the robot to show a small number of demonstrations. After watching each demonstration, the human can estimate the robot’s capability accordingly. The goal is to come up with motion plans to pragmatically demonstrate the robot’s capability. To achieve a sample-efﬁcient calibration, we propose reachability-expressive motion planning (REMP), a novel planning algorithm that models perceived robot capability as a human’s belief over a robot’s reachable workspace, and inte- grates the belief update into motion planning by introducing an additional cost in",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S7",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "trajectory optimization. As a result, REMP can generate a series of expressive trajectories for different robots to showcase their reachability to users. We conducted a user study in which participants i) ﬁrst observed several robot demonstrations, then ii) estimated where the robot could reach, and iii) proceeded to work with the same robot in a joint task: picking up all objects in the shared workspace as fast as possi- ble. We ﬁnd that i) REMP signiﬁcantly increases the accuracy of humans’ reachability estimation, ii) the subsequent human- robot collaboration beneﬁts from a successful calibration, iii) users perceive the robot as more predictable and reliable. II. R ELATED WORK Perceived robot capability. Various works have studied how humans perceive a robot’s",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S8",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "capability, differentiating between social and physical capabilities [5]. In prior work, social capabilities were deﬁned as a robot’s ability to communicate and interact with humans [6], and physical capabilities were deﬁned on a set of tasks a robot can successfully perform [7], such as lifting different objects on the table [8], [9], searching and ﬁreﬁghting in various weather and ﬁre conditions [10]. In these works, robots’ capabilities of different tasks are estimated separately based on experience counts of action outcomes – a higher success rate indicates a stronger capability in a task [11]. Since the capability modeled in these works are highly task dependent, the user’s knowledge of a robot’s capability in one task can not be easily generalized to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S9",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "the arXiv:2103.04077v3 [cs.RO] 27 Jan 2022 2 IEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED JANUARY , 2022 (a) Inaccurate capability estimation can lead to failure in collaboration. (b) In this example, the human is supposed to pick up the white and the yellow cubes and let the robot collect the red and the green ones. Fig. 1: (a) Consider a collaborative table clearing task, where the robot has a limited capability and cannot reach the yellow and white objects. Inaccurate estimation of the robot’s reachable workspace would harm collaboration: users who incorrectly estimate that the robot can reach the yellow object would assign it to the robot, resulting in a worse teaming performance. (b) We propose capability calibration, where",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S10",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "the robot uses its motion to demonstrate its capability before collaboration. knowledge of its capability in other tasks. In contrast, our work focuses on physical capabilities that serve as a basis for a robot to achieve success in a wide range of tasks. In particular, we focus on reachability, which is one of the most fundamental physical capabilities for robots. By understanding a robot’s reachability, users can better assess its overall capability in various tasks where reaching is involved. Given an arbitrary task, the user can decide whether the robot can successfully perform it based on perceived reachability. Robot expressive motions. When deploying robots in real- world settings that are beyond factory environments, functional motions only designed to accomplish tasks",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S11",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "are inadequate for human users to correctly understand the robots and establish effective collaborations [12]. It is equally important to convey the rationality and intent of a robot through its motion [13], [14]. To generate such motions, prior work formulated and optimized the legibility of trajectories via functional gradient descent [15], [16]. Similar ideas were also adopted to study robots’ expression of emotion [17] and style [18]. To express robot (in)capability, prior work used repetitive motions, either generated by simple heuristics [19] or hand-crafted for each task [20]. In contrast, [21] proposed a trajectory optimization- based method that maximizes the similarity between motions and would-be successful executions. Our work takes one further step in this direction: we i) model how",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S12",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "humans update their beliefs of the capability of a robot given the observed robot motions and ii) integrate the belief update process into trajectory optimization to generate new motions that can optimally improve humans’ beliefs. III. C APABILITY CALIBRATION We propose a capability calibration framework (as shown in Figure 1b) to align a human user’s understanding of a robot’s capability with the ground truth, where the user can watch a small number of demonstrations of her robot partner before they work together. In this section, we introduce our approach to generate such demonstrations that can efﬁciently reveal the robot’s reachability. We show how this calibration could be applied to collaboration in Section IV. A. Calibrating Reachable Workspace In this sub-section,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S13",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "we deﬁne the reachability calibration task. In Section III-B, we describe how human belief would be updated before a new trajectory can be generated. In section III-C, we propose REMP, which enables the robot to generate one trajectory showing its reachable workspace based on a simulated human belief that models what the human has already known about the robot. In Section III-E, we reify our capability calibration framework by combining REMP and task planning. We begin with some notations. The robot’s ground truth reachability is deﬁned as f : Xws →{0,1}, i.e. whether a target position x in the workspace Xws is reachable by the end-effector according to the robot’s kinematic constraints. Meanwhile, we assume the human is maintaining a",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S14",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "belief bt h : Xws →[0,1], modeling how likely a target is reachable after observing a robot trajectory ξt 1:N ∈Ξ with length N at time t ∈{1...T}. After observing all the robot demonstrations, human’s ﬁnal belief would become bT h = τ(b0 h,Z), with τ denoting the belief transition from the initial guess b0 h to the ﬁnal bT h with all seen demonstrations Z = ξ1:T . In addition, we deﬁne Xrs ⊆Xws as the robot’s reachable workspace. φee : Q →Xrs is the forward kinematic function of the end-effector, generating its position given a conﬁguration. Using notations above, we can formalize capability calibra- tion as an optimizing problem over a set of trajectories, Z, GAO et al.:",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S15",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "CAPABILITY CALIBRATION ON REACHABLE WORKSPACE FOR HUMAN-ROBOT COLLABORATION 3 Fig. 2: Simulated human estimation of robot A’s reachability map, after observing each demonstration generated by Algorithm 2, measured by Intersection of Union (IoU) between the human estimation and the ground truth. Robot A is a 2-link arm with link lengths 0.1. whose cardinality may not necessarily be known in advance. The goal is to reduce the mismatch between the robot’s ground truth capability and the user’s ﬁnal belief: argmin Z∈Ξ∗ Cost(Z) (1) s.t. ∑ x∈Xws ⏐⏐⏐τ ( b0 h(x),Z ) −f (x) ⏐⏐⏐ < ε, where Ξ∗ uses the Kleene star to represent all possible sequences of robot motions, Cost(·) : Ξ∗→R is a function to evaluate the overall cost",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S16",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "for trajectories. The condition means the user has a reachability estimation close enough to the robot’s true capability. One intuitive cost is the total length of all the trajectories in Z, optimizing which is equivalent to minimizing the cardinality of Z when the trajectories all have similar length. In this paper, we maintain the homogeneity of trajectories by further regulating the start conﬁgurations of all trajectories to be in a set of conﬁgurations S ⊂Q0 and target positions in a set of positions G ⊂Xrs. Due to the size of motion space, an exact solution to eq. (1) is intractable. Thus, we adopt an incremental update: we keep generating new trajectories ξt until the user’s belief is sufﬁciently aligned with",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S17",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "the robot’s capability. Every time we want to expand Z, we ﬁrst select a pair of starting conﬁguration and target position (qt ,xr) ∈S×G and then generate a motion using it. We term the former as the task planning problem and the latter as motion planning. B. Human Belief Model Our objective is to make people without any knowledge about robotics easily understand the true capacities of a robot. Thus, our human belief model attempts to capture what a novice user may think about a robot’s reachability after watching its trajectories. We assume human updates its belief on an interested point x in the workspace after observing a new robot trajectory ξ. Intuitively, if a point is close to the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S18",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "visited positions in an observed trajectory, the human observer would consider it more likely to be reachable. We model the belief update process as an iterative Bayesian inference beginning from a uniform prior: τ(bt ,ξt )(x) =bt+1 h (x) ∝ bt h(x)p(ξt |x) (2) and p(ξt |x) = e−γd(φ(ξt ),x), where d(φ(ξ),x) captures the distance between the trajectory ξ and the interested position Algorithm 1: REMP 1 Given a target position xr and a starting conﬁguration qt , human belief bt ; 2 Generate trajectory ξt based on bt h, qt , Equation (4) ; 3 Update human belief bt+1 h using ξt , Equation (2) ; 4 return bt+1 h , ξt x. The hyperparameter γ deﬁnes how much",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S19",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "the human ex- trapolates the observed trajectory to the points nearby: a large γ means that such extrapolation mainly happens to the point which is very close to the trajectory. In particular, we use the end-effector position φee as the feature, and compute the squared euclidean distance between the interested position and the closest end-effector position in the trajectory: d(φ(ξ),x) =min i ||φee(ξi)−x||2. (3) The design of our distance function is motivated by the fact that, given a trajectory, it is straightforward for users to focus on the robot’s end-effector which is central to the task, while trying to estimate its reachable workspace. C. REMP: Reachability-Expressive Motion Planning Expressing robot reachability is more than randomly mov- ing the end-effector to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S20",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "somewhere in its reachable workspace. Our insight is that it is essential to understand what the human already knows or does not know about the robot, so that every demonstration can communicate as much information to the human as possible. We believe this can be formulated as an optimization problem: ﬁnding a new trajectory that would minimize the misalignment between the ground truth reachability and human’s updated estimation. We capture the misalignment using a cost function c(ξ,bt h, f ) and formulate the optimization problem as the following: ξt = argmin ξ c(ξ,bt h, f )+ 1 λ N ∑ i=1 ||ξi+1 −ξi||2, subject to φee(ξn) =xr,collision-free(ξ). (4) The ﬁrst term is an expressiveness cost and the second term is",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S21",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "a smoothness cost commonly seen in trajectory optimization. The trajectory at the t-th step is generated by minimizing the sum of the two costs, subjecting to a constraint that requires the end effector to reach a target position xr at the end of the trajectory. Assuming each point in the trajectory contributes to the cost independently, we design the cost function based on a value 4 IEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED JANUARY , 2022 vi(ξi,bt h, f ), which represents the degree of alignment between human’s estimation and the robot’s ground truth reachable workspace: cb(ξ,bt h, f ) =α N ∑ i=1 vi(ξi,bt h, f ) = α N ∑ i=1 eβ ( bt h(φee(ξi))−f (φee(ξi)) )",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S22",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "(5) A small value vi suggests that the human observer is underestimating the robot’s capability at ξi. In that case, we want to facilitate calibration by encouraging the robot to move to ξi. On the other hand, we would see a large vi if the human is over-estimating the capability. In that case, it is beneﬁcial for the robot to avoid reaching points near ξi. The hyperparameter α and β control how aggressive the trajectory would be in expressing the capability. We call this cost function cccb, which captures human updated belief. Note that the intuition is if the observer previously underestimates the reachability of a point x, bt h(x) −f (x) will be negative and give low cost for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S23",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "trajectories covering x. Hence, trajectories passing through underestimated points are more likely to be chosen. Trajectories including overestimated points, on the contrary, have larger costs and are less likely to be selected. Static human model. Our key intuition is the human would update its belief of the robot’s reachability after observing each trajectory. To test it, we also design a ﬁxed cost function as baseline, assuming an underlying uniform belief model ∀x, bstatic (x) =b0. The corresponding cost function under the assumption of a static human model is cccs. Note that this baseline generates functional motions that solely aim to ﬁnish the physical task of reaching the target. We envision that in reality, users may also learn from these physical",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S24",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "motions the robot’s capability by interacting with the robot on some tasks, but such learning is not as efﬁcient as the learning in a dedicated calibration phase. D. Generating Reachability-Expressive Trajectories Implementation. We implemented our framework using TrajOpt [22] on two kinds of simulated robots in OpenRA VE [23], including a manipulator with 2 links and a PR2 robot. For the 2-link arm, we manipulated its joint limits and link lengths to allow it to have a variety of two-dimensional reachable workspaces. These serve as testing cases for our framework, as we want to study how well the framework copes with reachable workspaces of different sizes and shapes. For the PR2 robot, we didn’t do such manipulations since the goal",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S25",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "here is to see how practical it is to apply the framework to real robot manipulators. Without loss of generality, we focus on the right arm of the PR2 robot. In practice, we use grid search to ﬁnd hyperparameters that generate trajectories to maximize the accuracy of reachability estimation in simulation, as described in Section IV-C. Qualitative behaviors. Figure 2, Figure 3a and Figure 3b show the trajectories generated by the cost functions cb and cs for the robots by running REMP iteratively using the updated belief, following Algorithm 2. As both cb and cs assume a uniform belief on the robot’s reachable workspace at the beginning, the ﬁrst trajectories generated by these Algorithm 2: REMP-T 1 Given a list",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S26",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "of target position and starting conﬁguration pairs (x,q)1:T and human belief bh; 2 for t = 1,..., T do 3 bh,ξt = REMP(xt ,qt ,bh) 4 return bh,ξ1:T Algorithm 3: Calibration on Reachable Workspace 1 Given a set of target positions G, starting conﬁgurations S, initial human belief b0; 2 for t = 1,2,..., do 3 ∀x, b0 h(x) ←b0; 4 Let σ(ζ) =∑x∈Xws ⏐⏐ f (x)−REMP-T(ζ,b0 h)[bh] ⏐⏐; 5 ζ∗ t ←argminζ∈(G×S)t σ(ζ) ; 6 σt ←σ(ζ∗ t ); 7 if σt −σt−1 < ε then 8 return REMP-T(ζ∗ t ,b0 h) cost functions are almost identical. Starting from the second trajectories, we ﬁnd that the ones generated using cb can cover a large part of the robot’s reachable",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S27",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "workspace. On the contrary, trajectories generated by cs are more sensitive to the physical cost. Overall, It is clear that REMP accommodates human belief at each time step and tries to traverse uncovered regions to better express the robot’s reachability. E. Planning for Start and Target Pairs We have shown how REMP can generate an expressive trajectory given a starting conﬁguration and a target position. For a better capability calibration, we also want to optimize the number of trajectories as well as the sequence of starting conﬁgurations and target positions. As outlined in algorithm 3, this could be achieved by Task and Motion Planning (TAMP) [24], where the plans of start and target pairs come from task planning and the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S28",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "trajectories for a given pair comes from REMP. In algorithm 3, we solve (1) in an incremental manner. Namely, we keep increasing the cardinality of Z until user’s belief is aligned with the robot’s actual capability. For each size of Z, we ﬁnd the best sequence of starting conﬁgurations from S and target positions from G (line 5 of algorithm 3). To avoid trajectories that are too short or uninformative, we set S as the set of conﬁgurations near the neutral conﬁguration of the robot and G as the set of positions far away from the neutral end effector positions: S = {q,∀q |q −qneutral |< a1} (6) G = {x,∀x min q∈S |x −φee(q)|> a2} (7) Finding Z incrementally,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S29",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "despite giving the exact optimum, can be time consuming. In practice, rather than demonstrating to humans constantly until converge, we can pre-deﬁne T to a reasonable number and ﬁnd the optimal set of trajectories. In algorithm 4, we assume ﬁxed number of trajectories. We start from a uniform prior for the human belief, and update the belief w.r.t. Eq. (2). Figure 4a depicts an example to optimize 4 trajectories that start from different conﬁgurations GAO et al.: CAPABILITY CALIBRATION ON REACHABLE WORKSPACE FOR HUMAN-ROBOT COLLABORATION 5 (a) Robot B is a 2-link arm with link lengths 0 .13 and 0 .07. (b) Robot C is a PR2 robot. In this work, we consider the reachable workspace of its right arm.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S30",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "Fig. 3: Visualization of the robot reachable workspace and the trajectories generated by cost function cb (belief ) and cs (static). (a) and (b) show the results for Robot B and Robot C respectively. It can be seen that the belief trajectories cover broader regions of the reachable workspace and new trajectories tend to visit areas that haven’t been covered by their predecessors. The red dots, corresponding to Figure 5, represent the points we use to query the users in our experiments. Algorithm 4: Calibration with Fixed T 1 Given a set of target positions G = {x1,..., xN}, number of trajectories T, starting conﬁguration set S, initial human belief b0; 2 ∀x, b0 h(x) ←b0, δ ←∞; 3 for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S31",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "κ ∈T −combination(G ×S) do 4 bh ←b0 h; 5 for t ←1 to T do 6 bh, ˆξt ←REMP(κt (G),κt (S),bh); 7 σ = ∑x∈Xws |bh(x)−f (x)|; 8 if σ < δ then 9 δ ←σ; 10 ξ1:T ←ˆξ1:T ; 11 return ξ1:T and reach different targets. Note that algorithm 4 plans by enumerating all possible combinations, but any stochastic planning approaches can be used to further accommodate resource constraints and task scalability. IV. A PPLYING REMP TO HUMAN -ROBOT COLLABORATION In this section, we discuss how to apply REMP to human- robot collaboration after the calibration. A. Collaborative Table Clearing We design a human-robot collaboration task in a table clearing scenario, where some objects are scattered on a",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S32",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "table and a robot can assist the human with the object collection. The human and the robot take turns picking up the objects. In each step, the human collects ﬁrst and the robot collects one of the remaining objects. The human can reach all of the objects, while the robot can only reach a subset of them. To ﬁnish the task as quickly as possible, the human and the robot need to split the work wisely, so that, in each round, the robot has some objects to pick up. The reward is calculated by the number of objects picked up and the time penalty. B. Human and Robot Policy After observing robot expressive demonstrations and up- dating the belief with",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S33",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "Eq. (2), the human is assumed to act in an approximately rational way with respect to the current estimation of the robot capability, bt h. We use a Boltzmann noisily-rational human decision model [25], assuming the human is more likely to help the robot with its unreachable objects based on the human’s current reachability estimation. Since we want to emphasize the effect of the calibration, we use a simple uniform robot policy in the simulation, i.e., it would randomly pick up objects it can reach, and do nothing if no objects are reachable. C. Simulation Results Using the behavior model described in the previous sections, we simulated with 3 robots A, B and C with different con- ﬁgurations and reachability:",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S34",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "(i) A is a 2-link arm where each link is of equal length, (ii) B is a 2-link arm where the length of its ﬁrst link (0.13) is larger than the length of the second (0.07), (iii) C is a PR2 robot. The belief and static methods in the legend correspond to the deﬁnition in Section III-B. In addition, we implemented a traversal baseline, where the robot moves its end-effector to traverse the workspace to demonstrate its reachability. From the starting position, the 6 IEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED JANUARY , 2022 (a) Trajectories generated by task and mo- tion planning and the simulated reachabil- ity estimation given observed trajectories. (b1) Simulated reachability estimation accuracy, measured by",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S35",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "Intersection of Union between the human reachability estimation and the ground truth. Higher value indicates better estimation. (b2) Simulated human-robot collaboration per- formance measured by averaged rewards ac- quired by the group. Every point on the curves for traversal is the mean of 100 trajectories. Fig. 4: (a) Combining REMP with task planning, we can optimize the starting and target positions for better calibration. (b) Simulation results of reachability estimation and collaboration performance. Starting and target positions are chosen greedily. (a) 36 points for 2-link arms. (b) 25 points for PR2. Fig. 5: To evaluate users’ estimation of the robot’s reachable workspace, we sample query points in the workspace and ask users to select points that they think the robot’s",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S36",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "end effector can reach. These points correspond to the red dots in Figure 3a and Figure 3b. end effector moves to unreached waypoints in its reachable workspace one by one. The number of waypoints we sampled corresponds to the number of trajectories in belief and static. Figure 4b1 and Figure 4b2 shows the quantitative results of capability calibration and human-robot collaboration. The result suggests that as the robot shows more demonstrations, the human has a better understanding of its capability and collaborates with it more effectively for all baselines. Looking at the sample efﬁciency, we notice that without modeling human belief changes, the improvement is quite slow and limited: a large number of demonstrations need to be observed before calibration",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S37",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "is achieved. On the contrary, trajectories generated by our proposed REMP algorithm keep providing new information to the user. As a result, the user’s estimation accuracy increases much faster for belief compared to the baselines. There is ﬂuctuation when many trajectories are shown, due to the limited memory of our human model. V. U SER STUDY As we have shown the effectiveness of REMP in simulation, we now turn to investigate how much it helps users work with TABLE I: Survey statements to evaluate reachability, pre- dictability, reliability and trust toward robots. 1. It is easy to tell where the robot’s hand can reach. 2. The robot behaves in a predictable manner. 3. I can rely on the robot to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S38",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "function properly despite its limited capability. 4. I trust the robot. robots in a user study. This study was certiﬁed as exempt from IRB review per 45 CFR 46.104 category 3 by the UCLA Institutional Review Board on 9/4/2020. A. Experiment Design Participants. We recruited 202 participants (37% Female, median age 34) from Amazon Mechanical Turk. Materials. During the study, participants interact with the three robots in the simulation as described in Section IV-C. We measure how well participants can understand the robot’s capability and how such understanding can help them in the collaboration, as well as their self-reported perception of the robot. To measure capability understanding, we ask users to choose positions that they think the robot can reach",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S39",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "from a number of object queries, as shown in Figure 5. We record their selections and compare them with the ground truth. For collaboration task performance , we use the accumulated reward of the team as a measure. To measure the perception of the robot , we ask participants to rate statements listed in Table I on a 7-point Likert scale labeled from ”strongly agree” to ”strongly disagree”, after they have ﬁnished interaction with a robot. Inspired by [26], the statements shown in Table I are designed to evaluate their subjective understanding of the robot in different aspects, including reachability, predictability, reliance and trust. Calibration task. In the calibration task, the participant would be randomly assigned to an experiment group,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S40",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "and observe T demonstrations. Based on the simulations results in Fig- ure 4b1, we believe showing more demonstrations would gen- erally lead to a better calibration. Considering the limited time of participants in our online study, however, we cannot use GAO et al.: CAPABILITY CALIBRATION ON REACHABLE WORKSPACE FOR HUMAN-ROBOT COLLABORATION 7 (a) Intersection of Union between the human reachability estimation and the ground truth. A higher value indicates better estimation. (b) The human-robot team performance in the collaboration task. A higher value indicates a higher reward. (c) Users’ ratings toward the Likert state- ments in table I. A higher rating indicates higher conﬁdence. Fig. 6: User study results. Here we report means and standard errors. * indicates statistical signiﬁcant",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S41",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "pairs ( p < .05). an arbitrarily large T. From simulation, we witness the most signiﬁcant improvement during the ﬁrst 4 trajectories, thus we control the number of demonstrations T = 4 in practice. After seeing all demonstrations, participants are asked to estimate the robot’s reachable workspace by choosing positions that they think the robot can reach from a number of object queries, as shown in Figure 5. Collaboration task. In the collaboration task, participants are asked to perform an online table clearing task together with the same robot they have just been calibrated. As discussed in Section IV-A, the task required the team to clear all four objects on the table. During each time step, the participant would pick",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S42",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "up an object ﬁrst before the robot makes its decision. The team would get rewarded based on how fast they take all the objects. Since two of the objects cannot be reached by the robot, to get the maximum accumulated reward (+2), the participant needs to pick up objects that cannot be reached by the robot. Failure to do so would result in the team getting a lower reward (0). Experiment conditions. Like simulations, we varied types of motion users observed in the user study, i.e., the belief, static and traversal methods deﬁned in Section IV-C. Design. The robot types are within-subject: participants in- teracted with all three robots. Demonstrations are between- subject: participants only saw demonstrations from one of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S43",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "the three experiment conditions when interacting with a robot. Procedure. After a brief introduction, each participant is asked to interact with three robots A, B and C in random order. The purpose is to see how robot’s physical conﬁgurations affect capability perception. During the interaction with each robot, the participants would ﬁrst go through a calibration task before collaborating with the same robot on the table clearing task. Hypotheses. We hypothesized the capability calibration framework beneﬁts the users in the following aspects: H1: Participants going through capability calibration in the belief condition would have a better understanding of the robot’s capability, compared to those in the other conditions. H2: Teams in the belief condition would perform better in the collaboration",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S44",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "tasks than those in the other conditions. H3: Participants in the belief condition would have a more positive perception of the robot, compared to those in the other conditions. B. Result and Analysis Capability understanding. We ﬁrst analyzed the accuracy of the user’s estimation of the robot’s reachable workspace, by computing the intersection of union (IoU) between their re- sponses and the ground truth. We performed a Kruskal–Wallis H-test of the IoUs using the type of motion independent variables. As a result, we found a signiﬁcant effect for the mo- tion (χ2(2,603) =113.52, p < .001). A post-hoc analysis with Mann-Whitney U test revealed that all three conditions are different from each other, with belief signiﬁcantly better than static (p",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S45",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "< .001) and traversal (p < .001). This conﬁrms our hypothesis H1. Figure 6a shows the accuracy of participants’ reachability estimation w.r.t different robots. On average,belief performs 65% better than static and 32% better than traversal. Compared to the simulation results in Figure 4, the user study result follows relatively the same order for different conditions. Task performance. We also analyzed the collaboration task performance. A Kruskal–Wallis H-test indicates that there is a statistically signiﬁcant effect of the accumulated rewards between conditions ( χ2(2,603) =22.62, p < .001). The post- hoc Mann-Whitney U test showed a signiﬁcant difference between belief and static (p < .001). This partially supports our hypothesis H2. We didn’t observe a signiﬁcant difference between belief and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S46",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "traversal. Figure 6b shows the task per- formance for different robots in three conditions. The Pearson correlation coefﬁcient between reachability estimation and collaboration performance is r = .203 with p-value smaller than 0.001, indicating a positive correlation. This validates that calibrating perceived robot capability beneﬁts the collaboration performance. Surprisingly, users in the traversal condition have a slightly higher reward when collaborating with the PR2 robot compared with those in static, even if their reachability estimation is less accurate, although the difference is not signiﬁcant. This is probably due to the stochastic nature of the traversal baseline and speciﬁc object locations in our collaboration task. Perception of robots. Finally, we analyzed participants’ perception toward robots. Running a Kruskal–Wallis H-test, we found",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S47",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "signiﬁcant effects for reachability ( χ2(2,603) = 20.39, p < .001) and predictability ( χ2(2,603) =11.30, p = .003). The post-hoc Mann-Whitney U test revealed signiﬁ- cant difference between belief and traversal for reachability 8 IEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED JANUARY , 2022 (p < .001) and predictability ( p < .001), conﬁrming H3. Overall, users tended to prefer belief over static, and static over traversal. This is unexpected for reachability, considering the fact that users are actually better at predicting robots’ reachability in traversal than in static. The Pearson correlation coefﬁcient between reachability rating and prediction accuracy is r = .109, indicating a weak positive correlation. Similarly, we observe a weak correlation r = .019 between",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S48",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "self-reported reliance and users’ actual ability to rely on the robot during collaboration. This suggests that there may be a discrepancy between the users’ self-reported capability understanding and what they actually know about the robot. In summary, we found that users in the belief condition had the most accurate estimation of the robots’ capability, and reported the robots in this condition as the most reliable, the most predictable, and the easiest to understand among all three conditions. Moreover, users working with the belief robots achieved a higher reward than those working with the static robots did. These objective and subjective results together suggest that our approach has an overall advantage for improving humans’ understanding of robots as well as the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S49",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "quality of collaboration over the baselines. VI. C ONCLUSION We have proposed an expressive robot motion planning algorithm, REMP, which can generate informative trajectories by integrate human belief update into trajectory optimiza- tion. Our experiments show that our approach can efﬁciently calibrate a user’s perception of a robot’s reachability and consequently improve human-robot collaboration. In this work, we focused on the robot’s spatial reachability. As reaching is one of the most basic tasks in human-robot in- teraction, we believe understanding reachability would greatly help users understand robot capacities in more complex tasks. Thus we view our work as a successful ﬁrst step towards a more general capability calibration setting. In the future, it is possible to extend REMP for other",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S50",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "capabilities. Our current work treats predictability and reliability as separate measures from trust. Considering the multidimensional nature of trust, better instruments can be used for a more comprehensive trust measure [27]. Also, due to online experiment constraints, we only investigated the reachability calibration problem on a 2D plane. We intend to generalize our algorithm to 3D environment in future work. REFERENCES [1] T. A. Stoffregen, K. M. Gorday, Y .-Y . Sheng, and S. B. Flynn, “Perceiv- ing affordances for another person’s actions.” Journal of Experimental Psychology: Human Perception and Performance, vol. 25, no. 1, p. 120, 1999. [2] A. Powers and S. Kiesler, “The advisor robot: tracing people’s mental model from a robot’s physical attributes,” in Proceedings of the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S51",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "1st ACM SIGCHI/SIGART conference on Human-robot interaction, 2006, pp. 218–225. [3] S. R. Fussell, S. Kiesler, L. D. Setlock, and V . Yew, “How people anthro- pomorphize robots,” in 2008 3rd ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 2008, pp. 145–152. [4] S. V . Albrecht and P. Stone, “Reasoning about hypothetical agent behaviours and their parameters,” in Proceedings of the 16th Conference on Autonomous Agents and MultiAgent Systems , ser. AAMAS ’17. Richland, SC: International Foundation for Autonomous Agents and Multiagent Systems, 2017, p. 547–555. [5] E. Cha, A. D. Dragan, and S. S. Srinivasa, “Perceived robot capability,” in 2015 24th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 2015, pp. 541–548. [6] M. F.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S52",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "Jung, J. J. Lee, N. DePalma, S. O. Adalgeirsson, P. J. Hinds, and C. Breazeal, “Engaging robots: easing complex human-robot teamwork using backchanneling,” in Proceedings of the 2013 conference on Computer supported cooperative work, 2013, pp. 1555–1566. [7] F. A. Robinson, M. Velonaki, and O. Bown, “Smooth operator: Tuning robot perception through artiﬁcial movement sound,” in Proceedings of the 2021 ACM/IEEE International Conference on Human-Robot Interaction, 2021, pp. 53–62. [8] S. Nikolaidis, S. Nath, A. D. Procaccia, and S. Srinivasa, “Game- theoretic modeling of human adaptation in human-robot collaboration,” in Proceedings of the 2017 ACM/IEEE international conference on human-robot interaction, 2017, pp. 323–331. [9] M. Chen, S. Nikolaidis, H. Soh, D. Hsu, and S. Srinivasa, “Plan- ning with trust for",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S53",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "human-robot collaboration,” in Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction, 2018, pp. 307–315. [10] Y . Xie, I. P. Bodala, D. C. Ong, D. Hsu, and H. Soh, “Robot ca- pability and intention in trust-based decisions across tasks,” in 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 2019, pp. 39–47. [11] J. Lee, J. Fong, B. C. Kok, and H. Soh, “Getting to know one another: Calibrating intent, capabilities and trust for human-robot collaboration,” arXiv preprint arXiv:2008.00699, 2020. [12] G. Venture and D. Kuli ´c, “Robot expressive motions: a survey of generation and evaluation methods,” ACM Transactions on Human- Robot Interaction (THRI), vol. 8, no. 4, pp. 1–17, 2019. [13] D. Szaﬁr, B. Mutlu, and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S54",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "T. Fong, “Communication of intent in assis- tive free ﬂyers,” in Proceedings of the 2014 ACM/IEEE international conference on Human-robot interaction, 2014, pp. 358–365. [14] G. Lemasurier, G. Bejerano, V . Albanese, J. Parrillo, H. A. Yanco, N. Amerson, R. Hetrick, and E. Phillips, “Methods for expressing robot intent for human–robot collaboration in shared workspaces,” ACM Transactions on Human-Robot Interaction (THRI), vol. 10, no. 4, pp. 1–27, 2021. [15] A. Dragan and S. Srinivasa, “Generating legible motion,” 2013. [16] F. Stulp, J. Grizou, B. Busch, and M. Lopes, “Facilitating intention prediction for humans by optimizing robot motions,” in 2015 IEEE/RSJ international conference on intelligent robots and systems (IROS) . IEEE, 2015, pp. 1249–1255. [17] M. L. Felis, K. Mombaur, and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S55",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "A. Berthoz, “An optimal control approach to reconstruct human gait dynamics from kinematic data,” in2015 IEEE- RAS 15th International Conference on Humanoid Robots (Humanoids). IEEE, 2015, pp. 1044–1051. [18] C. K. Liu, A. Hertzmann, and Z. Popovi ´c, “Learning physics-based motion style with nonlinear inverse optimization,” ACM Transactions on Graphics (TOG), vol. 24, no. 3, pp. 1071–1081, 2005. [19] M. N. Nicolescu and M. J. Mataric, “Learning and interacting in human- robot domains,” IEEE Transactions on Systems, man, and Cybernetics- part A: Systems and Humans, vol. 31, no. 5, pp. 419–430, 2001. [20] L. Takayama, D. Dooley, and W. Ju, “Expressing thought: improving robot readability with animation principles,” in Proceedings of the 6th international conference on Human-robot interaction, 2011, pp.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S56",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "69–76. [21] M. Kwon, S. H. Huang, and A. D. Dragan, “Expressing robot incapa- bility,” in Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction, 2018, pp. 87–95. [22] J. Schulman, J. Ho, A. X. Lee, I. Awwal, H. Bradlow, and P. Abbeel, “Finding locally optimal, collision-free trajectories with sequential con- vex optimization.” in Robotics: science and systems, vol. 9, no. 1. Citeseer, 2013, pp. 1–10. [23] R. Diankov, “Automated construction of robotic manipulation pro- grams,” Ph.D. dissertation, USA, 2010. [24] L. P. Kaelbling and T. Lozano-P ´erez, “Hierarchical task and motion planning in the now,” in 2011 IEEE International Conference on Robotics and Automation. IEEE, 2011, pp. 1470–1477. [25] O. Morgenstern and J. V on Neumann, Theory of",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_2103_04077v3:S57",
      "paper_id": "arxiv:2103.04077v3",
      "section": "abstract",
      "text": "games and economic behavior. Princeton university press, 1953. [26] M. Madsen and S. Gregor, “Measuring human-computer trust,” in 11th australasian conference on information systems, vol. 53. Citeseer, 2000, pp. 6–8. [27] B. F. Malle and D. Ullman, “A multidimensional conception and measure of human-robot trust,” in Trust in Human-Robot Interaction. Elsevier, 2021, pp. 3–25.",
      "page_hint": null,
      "token_count": 54,
      "paper_year": 2021,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9550823357435655,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    }
  ],
  "extraction_meta": {
    "extractor": "pypdf",
    "two_column_applied": false,
    "ocr_applied": false,
    "pages_total": 8,
    "empty_pages": 0,
    "empty_page_pct": 0.0,
    "page_stats": [
      {
        "page": 1,
        "chars": 5938,
        "empty": false
      },
      {
        "page": 2,
        "chars": 4507,
        "empty": false
      },
      {
        "page": 3,
        "chars": 4699,
        "empty": false
      },
      {
        "page": 4,
        "chars": 5718,
        "empty": false
      },
      {
        "page": 5,
        "chars": 3461,
        "empty": false
      },
      {
        "page": 6,
        "chars": 4313,
        "empty": false
      },
      {
        "page": 7,
        "chars": 5463,
        "empty": false
      },
      {
        "page": 8,
        "chars": 8125,
        "empty": false
      }
    ],
    "quality_score": 0.9551,
    "quality_band": "good"
  }
}