{
  "paper": {
    "paper_id": "arxiv:1905.08979v1",
    "title": "Anchor-Less Producer Mobility Management in Named Data Networking for Real-Time Multimedia",
    "authors": [
      "Inayat Ali",
      "Huhnkuk Lim"
    ],
    "year": 2019,
    "venue": "arXiv",
    "source": "arxiv",
    "abstract": "Information-centric networking (ICN) is one of the promising solutions that cater to the challenges of IP-based networking. ICN shifts the IP-based access model to a data-centric model. Named Data Networking (NDN) is a flexible ICN architecture, which is based on content distribution considering data as the core entity rather than IP-based hosts. User-generated mobile contents for real-time multimedia communication such as Internet telephony are very common these days and are increasing both in quality and quantity. In NDN, producer mobility is one of the challenging problems to support uninterrupted real-time multimedia communication and needs to be resolved for the adoption of NDN as future Internet architecture. We assert that mobile nodes' future location prediction can aid in designing efficient anchor-less mobility management techniques. In this article, we show how location prediction techniques can be used to provide an anchor-less mobility management solution in order to ensure seamless handover of the producer during real-time multimedia communication. The results indicate that with a low level of location prediction accuracy, our proposed methodology still profoundly reduces the total handover latency and round trip time without creating network overhead.",
    "pdf_path": "data/automation/papers/arxiv_1905.08979v1.pdf",
    "url": "https://arxiv.org/pdf/1905.08979v1",
    "doi": null,
    "arxiv_id": "1905.08979v1",
    "openalex_id": null,
    "citation_count": 0,
    "is_open_access": true,
    "sync_timestamp": "2026-02-20 17:55:18.077496+00:00"
  },
  "snippets": [
    {
      "snippet_id": "Parxiv_1905_08979v1:S1",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "Research Article Anchor-Less Producer Mobility Management in Named Data Networking for Real-Time Multimedia Inayat Ali 1,2 and Huhnkuk Lim 1,2 1Korea Institute of Science and Technology Information (KISTI), Daejeon, Republic of Korea 2University of Science and Technology (UST), Daejeon, Republic of Korea Correspondence should be addressed to Huhnkuk Lim; hklim@kisti.re.kr Received 1 February 2019; Revised 5 April 2019; Accepted 17 April 2019; Published 13 May 2019 Academic Editor: Yuh-Shyan Chen Copyright © 2019 Inayat Ali and Huhnkuk Lim. (X_his is an open access article distributed under the Creative Commons AttributionLicense,whichpermitsunrestricteduse,distribution,andreproductioninanymedium,providedtheoriginalworkis properly cited. Information-centricnetworking(ICN)isoneofthepromisingsolutionsthatcatertothechallengesofIP-basednetworking.ICN shifts the IP-based access model to adata-centric model. NamedData Networking(NDN) is a ﬂexibleICN architecture, which is based on content distribution considering data as the core entity rather",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S2",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "than IP-based hosts. User-generated mobile contents for real-time multimedia communication such as Internet telephony are very common these days and are increasing both in quality and quantity. In NDN, producer mobility is one of the challenging problems to support uninterrupted real-time multimedia communication and needs to be resolved for the adoption of NDN as future Internet architecture. We assert that mobile node’s futurelocationpredictioncanaidindesigningeﬃcientanchor-lessmobilitymanagementtechniques.Inthisarticle,weshowhow location prediction techniques can be used to provide an anchor-less mobility management solution in order to ensure seamless handover of the producer during real-time multimedia communication. (X_he results indicate that with a low level of location prediction accuracy, our proposed methodology still profoundly reduces the total handover latency and round trip time without creating network overhead. 1.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S3",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "Introduction Mobile devices have transformed into multimedia com- puters owing to the multitude of mobile applications and diverse features, such as cameras, messaging, online con- tent sharing, and online mobile gaming. (X_hese smart featuresofmobiledevicesandthehumanneedsofcreating and sharing contents in real-time have enabled mobile devices to play the roles of content providers and content consumers at the same time. (X_he exponential growth in dataproductionanditsneedfordisseminationisbecoming a cumbersome issue in current network architecture. (X_he existing Internet model is not built to combat this growing production and dissemination of data. Moreover, many attempts were made to withstand this issue, which resulted in peer-to-peer (P2P) overlays on the IP network and content distribution network (CDN) [1]. (X_hese attempts are still very feeble to ensure smooth network",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S4",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "operation. According to a prediction by CISCO Visual Networking Index(VNI)[2],globaltraﬃcwillinﬂateto3.3ZBperyear, or 278Exabytes per month by 2021, thus raising more disputes for the current state of the practice network ar- chitecture and its protocols. Many proposals have been witnessed in recent years for a scalable and reliable future Internet architecture [3–6]. Among these proposals, information-centric networking (ICN) has gained much attention. ICN is a data-oriented network,wheretheinformationisretrievedfromtheInternet by naming the data, not the end hosts. Data objects are in- dependent of location unlike the IP address in the traditional network. (X_his novel Internet architecture has addressed the challenges faced by the current Internet architecture in- cluding scalability, addressing, name resolution, security, privacy, routing, and mobility. Among the ICN approaches, NamedDataNetworking(NDN)[7]isaveryactive,agile,and enterprising one.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S5",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "NDN operation is based on Interest/Data Hindawi Mobile Information Systems Volume 2019, Article ID 3531567, 12 pages https://doi.org/10.1155/2019/3531567 packets, where a consumer (data requester) sends an Interest packet containing the name of the required data. (X_he NDN ForwardingInformationBase(FIB)helpsforwardtheInterest packet towards the data named in the Interest packet and retrieve the data in one or more Data packets. NDN also uses in-network caching for faster data access; hence the data can be retrieved from the producer or the cache of the NDN router in the network. Many research challenges in NDN including naming, name resolution, routing, security for large-scale data,and mobility need to be resolved for NDN to win the race of future Internet architecture. (X_he number of mobile devices and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S6",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "the data they generated have drastically increased overtime[8, 9]. Mobilitymanagementisbecoming moresalientbecauseofthedevicetransformationintoasmart gadget that rapidly creates and shares content in real time. (X_herefore, device mobility management needs much atten- tionfromtheresearchcommunity.AsaresultofNDNdesign principles, consumer mobility is natively supported by NDN as a change in the physical location of the consumer does not aﬀect the NDN data plane. (X_here is no need for signalling from network to heal from consumer mobility but only In- terest retransmission by the consumer for the data that have notyetbeenreceivedworkswell.Handlingproducermobility is a challenging task and needs to update the network data plane to successfully recover from outages due to producer mobility. AfewproducermobilitymanagementschemesforICN have been proposed for real-time services. However, there is still room to design sophisticated algorithms to handle",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S7",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "producer mobility eﬃciently. (X_he work in [10, 11, 12] has reactive approaches towards mobility management where thepacketsareredirectedafterthehandovercompletesand notiﬁcation is received from the producer. (X_hese ap- proachessuﬀerfrompathstretchproblemlikeinMobileIP for mobility management in IP networking. Moreover, thesereactiveapproachesencountermorecontentretrieval delaythanproactiveapproaches.(X_heconceptofredirecting packets towardthenewlocationwasﬁrst introducedinthe traditionalIPnetwork(MobileIP[13])tosupportmobility. However,inmobileIP,allthepacketshavetoberedirected by the old access point towards the new location until the communication session ends, thus causing path stretch problem for the entire session. (X_he techniques used in [14, 15] use a proactive caching approach to minimize the Interest retransmission during a handover. (X_he scheme in [14] assumes that the request pattern is known and the future requested content is proactively pushed to the network caches ahead of handover to satisfy the Interest during the handover. However, the mechanism in [15]",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S8",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "pushes the content to network cache based on content popularity. However, these approaches cannot be applied in real-time communication, where the contents are pro- duced in real-time after the Interest packets are received. Proactive caching techniques assume that the data are already extant and pushed to the network cache before receivinganInterestforthosedata,whichisnotthecasein real-time communication. Real-time data are the data that are generated and delivered immediately after they are requested. (X_he data generated in Internet telephony, messaging, and online gaming are examples of real-time data, and the above proactive caching techniques for mobility management will not support these applications, which account for a signiﬁcant amount of Internet traﬃc today. To solve the problems associated with the above techniques, i.e., path stretch and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S9",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "long delay due to re- active approaches and lack of support for real-time communication in proactive caching approaches, we, in this article, propose a proactive mechanism that is the ﬁrst attempt to exploit location prediction techniques for anchor-less producer mobility management in order to ensure seamless handover of the producer during real- time multimedia communication. (X_he proposed meth- odology is based on the prediction of the future location of a moving producer and proactively redirecting the Interests to the new access point (nAP) before the handover completes. (X_he proposed methodology is the ﬁrsttoexploitlocationpredictiontechniquesinNDNfor mobility management. Our scheme reduces both the handoverlatencyandtheroundtriptimewithoutcausing network overhead. (X_he mechanism also does not suﬀer from the path stretch problem. Moreover, it does not assume that",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S10",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "the data are already extant; instead, the data are generated in real-time and forwarded after the In- terest packets are intelligently delivered to the producer after the handover. (X_herestofthepaperisstructuredasfollows:InSection 2,webrieﬂyoﬀeraninsightintoNDNmobilityandrelated work. In Section 3, we describe the proposed location prediction-based mobility management methodology in details. We providea detailed discussion of theresults and comparison with two legacy schemes in Section 4. Finally, we conclude the paper in Section 5 and present future work. 2. Insight into NDN Mobility Inthis section,wegivean overviewof operational aspects of NDN, provide problems regarding mobility, and present some related work on mobility management in NDN. 2.1.MobilityinNDN. NDN provides a new communication paradigm that revolves around the content/data. (X_he data are retrieved by data names rather than the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S11",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "IP addresses of themachinesthathostthedata.Oncethedataareforwarded to the network, they are cached at network routers (in- network caching)tosatisfy futurerequestsfor thesamedata with small delays. (X_his in-network caching results in faster serviceaccessandresistscongestion.Twodatastructuresare used by NDN routers to aid packets forwarding, i.e., Forwarding Information Base (FIB) and Pending In- terestTable(PIT).FIBispopulatedbyroutingprotocolsand diﬀerent forwarding strategies, and it is used to forward Interest packets towards the data. PIT keeps the records of interfaces on which theInterest packetsare received andthe datanamesrequestedbythoseInterests.PITensuresthatthe Data packets follow the reverse path of the Interest packets. 2 Mobile Information Systems A third data structure called Content Store (CS) is used at routers to cache data for satisfying future Interests. Upon receiving an Interest in the router if the requested data are available in the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S12",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "router cache, they will satisfy the Interest without forwarding it to the next hop based on FIB. (X_he Interest packet is forwarded to the next hop based on FIB entry if the data are not available in router cache. Before forwarding the Interest packets, its incoming interface and data name is stored in the PITfor data forwarding. When a Datapacketisreceivedatarouter,itwillbeforwardedtothe interface in the PIT entry against this data name. (X_he data will be dropped if there is no entry against this data name in the PIT. (X_he operation in the NDN router is explained in Figure 1. Mobility is an essential feature of future Internet technology. NDN supports mobility and reduces the complexitiesofmobilitysupportintheIP-basednetwork. Mobility can be of two types, i.e.,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S13",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "consumer mobility and producer mobility. NDN naturally supports consumer mobility by Interest retransmission and in-network caching. If a consumer after requesting data moves to another network, the response will be delivered to the router in the previous location, which will be cached there. Consumer at the new network will retransmit the Interestforthesamedata.Inwhichcase,theintermediate routers will immediately respond to the Interest. In case thedataarenotavailableatanyofthenetworkcaches,the Interest will hit the data producer again, and the data will be retrieved with a longer delay. Unlike consumer mo- bility, producer mobility is a complicated problem. (X_his type of mobility highly aﬀects communication. If a producermovestoanothernetwork,theInterestswillnot be delivered to it unless network converges. (X_his type of mobility cannot be tackled with Interest retransmission, as the new name",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S14",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "preﬁx of the producer will not be known to any NDN router unless network converges. (X_he communication session halts for at least the sum of handover time and the network reconvergence time as shown in Figure 2. (X_he Interest packets are discarded at the producer’s old point of attachment (oAP) (11.9 sec in Figure 2) and start delivering again to the producer at the new location after the routing update period expires and the whole network converges (13 secin Figure 2). To handle this mobility management issues, few tech- niques have been proposed to ensure seamless handover of producers during real-time streaming. Mobility management algorithms are designed to guarantee seamless handover from an old Access Point (oAP) to a new",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S15",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "Access Point (nAP) and should have the following characteristics: (i) (X_he time required to divert the route to nAP from oAP should be minimum. In other words, the handover latency should be the least possible (ii) (X_he Interest and content loss during the handover time should also be minimum 2.2. Related Work.NDN relies on Interest retransmission tohealfromnetworkoutagesowingtomobility.However, Interest retransmission is not a scalable approach when there are a large number of mobility events; also the end- to-end latency due to mobility in this approach is very high. (X_herefore, some techniques have been proposed so far to provide more robust and eﬃcient mobility man- agement schemes. (X_he schemes in the literature can be divided into three categories: rendezvous-based schemes are more",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S16",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "like DNS system in the current IP-based net- working, where a consumer sends a query to a particular node called rendezvous server to ﬁnd the location of the producer before sending an Interest. (X_he rendezvous server keeps track of the location of all nodes in the network. (X_hese techniques are easy to implement, but the drawbackisthattheycauseextra-overheadtomaintainthe location information of mobile nodes. (X_he rendezvous- based schemes need the early binding of names that aﬀect the NDN data naming. Anchor-based approaches used an anchor node that redirects the Interests to the producer at the new location. (X_he anchor node should always be kept informed of the producer’s movement. (X_hese schemes possess a single relay point (single point of failure) and suﬀer from",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S17",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "the path stretch problem. Performance eval- uation of anchor and anchor-less approaches are given in detail in [10]. (X_he anchor-less approach has no pre- speciﬁednodetohandlemobility.(X_hisapproachishardto implement,buttheschemesfollowingsuchapproachesare very eﬃcient in terms of performance. (X_he schemes in [16, 17] are anchor-based mobility management schemes. (X_he schemes proposed in [10, 11] are anchor-less mobility management schemes and suﬀer from the inherited problems from their corresponding approaches. (X_he proposed methodology in this work is based on the pre- diction of the future location of a mobile node. (X_hese location prediction techniques can be exploited to provide anchor-less mobility management that highly reduces the handover latency and round trip time even with low prediction accuracy. 3. Location Prediction-Based Mobility Management Producer mobility causes degradation in",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S18",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "the quality of service during real-time streaming. (X_he services are disrupted when a producer moves and goes out of the radio range of its oAP and connects to another access point (nAP). (X_he Interest packets are dropped at the oAP as the new hierarchical name of the producer is not updatedinthenetworkinformation.(X_hecommunication session halts until the routing update period expires and the whole network converges with this new producer name information as shown in Figure 2. In NDN, the Interest packets are forwarded using FIB entries that are being populated by routing protocols, while the Data packets follow the traces of Interest packet stored in the PIT to reach the consumer. Hence, the producer is not abletodeliverDatapacketsofitsongoingstreamingfrom its new location right",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S19",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "after the handover completes, unless it receives an Interest packet at the new location using its new hierarchical name preﬁx. (X_his drastically Mobile Information Systems 3 maximizes the handover latency and hence round-trip time (RTT). 3.1. Preliminaries. We use two types of Interest packets to implementthemobilitymanagementschemeeﬃciently.(X_he Interest types are as follows: (i) INTEREST_PU:Interestpathupdatemessageissent by a mobile node (producer) to its AP to notify it about its mobility and probable handover. (X_he packet format is shown in Figure 3(a). (ii) INTEREST_RED: Interest redirection is an Interest type in which the Interests are forwarded to the producer at new location after the handover. (X_he packet format is shown in Figure 3(b). INTEREST_RED packet changes the content name from . . ./oAP/ale1 to",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S20",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": ". . ./nAP/ale1 (since the oAP have predicted the nAP) and is forwarded based on the Packet loss during producer mobility 800 750 700 650 600 550 500 Sequence number 11 11.1 11.211.311.411.511.611.711.811.9 12 12.112.2 Time (sec) 12.312.412.512.612.712.812.9 13 13.113.213.313.413.5 Handoff latency without mobility management scheme Figure 2: Handover latency without using any mobility management. Content store (CS) Pending Interest Table (PIT) FIBInterest Forward Data Add incoming face Return or drop the interest Downstream Upstream Pending Interest Table (PIT) Content store (CS) Data Discard data Cache Forward Lookup miss Lookup hit Figure 1: Interest and Data forwarding at the NDN router. 4 Mobile Information Systems FIB entry corresponding to this new name. When an INTEREST_RED packet is received at NDN",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S21",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "router (e.g., Rtr-2 in Figure 4), it also updates the name and out goingfaceinthepreviouslyrecordedPITentryforcontent deliverytowardtheconsumer.Itisalsoaveryfrugalwayto use INTEREST_PU message to notify oAP about a mo- bility event. 3.2. Algorithm Details. (X_he mobility management can be controlledatthenetworkormobilenode.However,amore easy and eﬃcient way is to make use of both to develop more eﬃcient mobility management techniques. (X_he proposed methodology manages mobility using co- operation from both the network and the mobile node (producer). (X_he location prediction scheme comes into actionwhenthereceivedsignalstrength(RSS)dropsbelow the threshold (th� −77dBm). As the RSS drops below the th, the future location of the producer is calculated by the producer itself using the speed and direction of movement obtained from its sensors. (X_he producer sends its new location to the oAP in",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S22",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "an INTEREST_PU message as shown in Figure 4 (Step 3). (X_he INTEREST_PU message contains theX and Y coordinates of the producer’s future location. (X_he pseudocode for this is given in Figure 5. (X_he details of our prediction model are given in the following subsection. 3.2.1. Location Prediction and New AP Selection. (X_he se- lection of nAP is the very crucial and important part of this scheme. (X_here are many possible ways to select nAP; however, we use the relative distances of the producer’s predicted future location from access points. (X_he relative distance of the producer from APs is used in this work because, in our simulations, all the APs and mobile nodes usethesametransmitandreceivepower.Moreover,weused the free-space propagation model where there are",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S23",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "no path losses, and it assumes one clear line-of-sight path from the transmitter to the receiver. In such settings, the relative distanceisthefairmethodtobeconsideredandincreasethe probabilityofselectingtherightnewAP.Uponreceivingthe INTEREST_PU message from the producer, the oAP ﬁnds the nAP using the Euclidean distance formula as explained in thepseudocode in Figure 6. Here, we assumed that all the ﬁxed routers and access points know each other geographic location.ToﬁndthedistancebetweenproducerandnAPata future time (Tf), oAP should know the new location of the producer at Tf. (X_here are many methods to predict the future location of a mobile node [18, 19, 20] with diﬀerent prediction accuracy ranging from 45% to 90%. Our pre- diction model used in this paper is straightforward where to predict the location at a time (Tf), the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S24",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "producer ﬁnds its speed and direction of movement and calculates its future location coordinates at the time (Tf). (X_he producer sends its new predicted coordinates to oAP in an INTEREST_PU message. (X_he modern mobile devices come with lots of advanced hardwareandsoftwaresensorslike accelerometer, gyroscope, digital compass, GPS, and speedometer. (X_hese sensors can easily calculate the speed and direction of movement of the mobile device (producer). (X_he producer constantly checks its RSS after it starts a movement. (X_he connection becomes unreliable after the signal strength drops than a predeﬁned threshold (here th� −77dBm) and the node starts searching for reliable signals from other APs for handover. Before the handover, the producer gets its speed and direction from the sensors at that particular",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S25",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "time and calculates its future coordinates and sends them in an INTEREST_PU message to the oAP. (X_he new speed at a particular time is determined by Vnew � min max vold + Δv, 0􏼂 􏼃 , vmax􏼈 􏼉, if p ≤ps, 0, otherwise, 􏼨 (1) where vold is the old speed obtained from the producer device sensors andΔv is the change in speed after time (t), Δv � vnew −vold, and it is uniformly distributed on [−3, 3] km/hr.vmax istheprespeciﬁedmaximumspeed(30km/hrin our simulation) of a mobile node.p is the uniformly dis- tributed probability between [0, 1], and ps is threshold probability (ps � 0.5), which determines the probability of producer movement. (X_he direction of the movement is also uniformly distributed and",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S26",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "is given by ϕnew � ϕold + Δϕ, (2) where ϕnew isthenewdirectionaftertime(t)and ϕold isthe old direction. Δϕ is the change in the direction and is uniformly distributed on [−π/4, π/4]. Euclidean distance between producer and AP is an eﬃcient method to select Name X-coordinates (new predicted position) Y-coordinates (new predicted position) Nonce Interest_PU (value = 0) (a) Name Selector (order preference, publisher ﬁlter etc..) Nonce Guiders (scope, interest life time) Interest_RED (value = 1) (b) Figure 3: Interest packet types. (a) INTEREST_PU. (b) INTEREST_RED. Mobile Information Systems 5 Finding and sending future location coordinates to oAP Possible event: Received signal strength (RSS) drops than threshold (th = –77 dBm). (1) Case event (2) If RSS ≤ th: (3) Get speed",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S27",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "(vnew) and direction (ϕnew) (4) Calculate future coordinates (x p, yp) using current speed and direction (5) Construct INTEREST_PU message (6) Send INTEREST_PU to oAP Figure 5: Pseudocode for path update message generation. New AP (nAP) Selection by old AP (oAP) Possible events: = Arrival of INTEREST_PU message at oAP, ∂ = arrival of nAP new reachable prefix notification from producer at oAP (wrong prediction). (1) Case events (2) When : (3) Get predicted coordinates (x p, yp) from INTEREST_PU message (4) Predict nAP: (5) Dist i= (AP i,x– xp)2 + (AP i,y– yp)2 (6) AP i= min (Dist i) (7) nAP = AP i (8) Return nAP (9) Redirect Interests toward nAP (10) Store copies of Interests for small",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S28",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "time (ts) (12) if ∂: (13) Redirect Interests again based on nAP prefix information in ∂ (14) Discard the stored Interests packets (15) else: (16) Do nothing (17) Discard the stored packets after time t s Figure 6: Pseudocode for new access point selection. Rtr-1 Rtr-2 Cons-1 ale 1 ale 1 oAP nAP AP 1: Interest sent path before handover 2: Content received path before handover 3: RSS ≤ th INTEREST_PU sent (location update messa ge sent to oAP) 4: Find nAP Redirect Interests to nAP 5: Redirected Interests received At producer’s new location 6: Content received after handover NDN router 1 NDN router 2 Figure 4: Location prediction-based mobility management scheme. 6 Mobile Information Systems the new access point",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S29",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "in our simulation. Because we have considered free-space propagation model and same transmit and receive power at all nodes, however in a realisticscenariohavingdynamicpathlosses,onecanalso consider other parameters to improve the accuracy. (X_he predictionaccuracycanfurtherbeimprovedbyleveraging machinelearningtechniquestoprocessthehistorydataof mobility and predict the possible handover. (X_he perfor- mance of prediction can also be enhanced by considering various other parameters in prediction decision such as received signal strength from each access point (AP) and the number of available channels with each AP. Con- sidering the other parameters may improve the selection of nAP at a cost of network overhead that will be created by the routing updates (to share RSS and channels in- formation)betweenthepotentialfuturenewaccesspoints (e.g., nAP1 and nAP2 in Figure 7) and oAP as shown in Figure",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S30",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "7. Subsequently, predicting the nAP of the pro- ducer,theoAPcontinuouslychecksthereachabilityofthe producer. (X_he Interests are delivered to the producer as long as it is reachable, and the producer satisﬁes each Interest with the required content. (X_he oAP redirects the Interest packets to nAP when the producer becomes unreachable (Step 4 in Figure 4). (X_he oAP also stores one copyofeachpendingInterestforasmalltimets toredirect it later, in case, the nAP prediction goes wrong. Herets is set a little more than the RTTin our simulation to ensure the time required for nAP to notify the oAP after the handover. After the handover, if the nAP does not receive an Interest packet, it will notify its new reachable preﬁx to the oAP via a broadcast. If the oAP",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S31",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "does not receive any notiﬁcationfromthenAP,itwillassumethatthenAPwas predicted right and the Interest packets have successfully been redirected to it, or it will assume that the producer has completely disconnected. In both cases, the stored Interest packets will be removed after timets. (X_he pseu- docode for nAP selection and redirecting the Interests towards it is given in Figure 6. (X_he nAP is anticipated to haveproducerconnectedtoitaftersuccessfulhandoverat layer 2. We have set the layer 2 handover delay (L2) to 100ms. Layer 2 handover delay is the time it takes by a node to disassociate itself from one AP (e.g., oAP in Figure 7) and establish a connection with another AP (e.g., nAP1 in Figure 7). 3.2.2. Interest Redirection to nAP.(X_he redirected Interests are forwarded in",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S32",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "a separate Interest packet type called INTEREST_RED. INTEREST_RED packet changes the content hierarchical name from. . ./oAP/ale1 to. . ./nAP/ ale1 (since the oAP has predicted the nAP) and is for- warded based on the FIB entry corresponding to this new name. (X_he intermediate NDN routers upon receiving the redirected Interest update the previous PIT entry for that name preﬁx and also notify the FIB about the changes for upcomingInterests.(X_heintermediateroutersthenforward the INTEREST_RED packets according to the longest preﬁx matching based on FIB towards the nAP. (X_he INTEREST_RED packets after reaching the nAP are buﬀered for some time and then forwarded to the producer immediately after the handover completes, and its connection establishes with the nAP. If the nAP pre- diction",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S33",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "goes wrong, and the producer at the new location does not receive the Interest packets, it publishes its newnamepreﬁxbybroadcastingit.(X_heoAPafterreceiving this new name preﬁx assumes that the nAP is predicted wrong and forwards the Interests to this correct new lo- cation of the producer according to the longest preﬁx matching based on FIB. In this method, the pre- handoverInterestforwardingtothenAPhighlyreducesthe handover latency and overall RTT from consumer to the producer. (X_he Interest packets path to the producer before handover is Consumer ⟶AP ⟶Rtr1 ⟶Rtr2 ⟶ oAP ⟶Producer (Figure 4). (X_he Data packets follow the reverse path of the Interest packets. (X_he path for the Interest packets that were in transit before updating the FIBs of the intermediate routers after handover isConsumer ⟶AP",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S34",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "⟶Rtr1 ⟶Rtr2 ⟶oAP ⟶Rtr 2 ⟶nAP ⟶Producer. (X_he Data packets path after handover will always be Producer ⟶nAP ⟶Rtr2 ⟶ Rtr1 ⟶AP ⟶Consumer. (X_he scheme does not suﬀer from path stretch problem. Only the Interest packets that were sent before forwarding the redirected Interests suﬀer from path stretch. 4. Results and Discussion We have simulated the following fat-tree backhaul net- work that resembles a real ISP topology as shown in Figure8usingtheNS-2simulator.(X_hescenarioconsistsof 4 mobile producers and two stationary consumers, where eachconsumeriscontinuouslysendingrequestsfordatato thetwoproducersfortheentiredurationofthesimulation. Wehaverepeatedthesimulation100times,andtheresults are averaged over many runs. (X_he producers randomly move, and handover can occur to any adjacent cell. We Prod oAP nAP2 nAP1 oAP Range nAP1 Range nAP2 Range Connected Strong RSS Weak RSS Figure 7: Access point selection.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S35",
      "paper_id": "arxiv:1905.08979v1",
      "section": "body",
      "text": "Mobile Information Systems 7 have 16cells with full wireless coverage (WiFi 802.11n), where the producers and consumers are located in dif- ferent cells initially. (X_he 2D view of cells and the initial position of the nodes are shown in the ﬁgure. In the proposed location prediction-based mobility management",
      "page_hint": null,
      "token_count": 48,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S36",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "dicted before ﬁnding the nAP. (X_he oAP does not drop the incoming Interests during the handover time. Instead, oAP immediately forwards the Interests to nAP. Here RTT/2 (≈25ms) (delay experienced by INTEREST_RED fromoAPtonAP)iscompletelyeliminatedbyoverlapping it with Layer 2 handover delay(L2) of 100ms as described in Figure 9. It is clear that the Interest packets sent during the(L2) handover delay time are delivered to the producer imme- diately after 100ms. (X_he Interest packets are not waiting for any notiﬁcation from producer or network after the handover. (X_he following equation gives the total handover latency in this scheme: Hp � L2 + α, Hp ≈L2, (3) where α is very small and covers the propagation time of Interests from nAP and producer after",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S37",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "the handover and a little delay in predicting the actual handover incident.Hp is the total handover latency, andL2 is the layer 2 handover delay. (X_he equationHp � L2 is the optimal mobility man- agement at the network layer as it eliminates the handover delayatthenetworklayer.(X_hehandoverlatencyweobtained in our simulation is 109ms for location prediction-based",
      "page_hint": null,
      "token_count": 52,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S38",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "134ms in zone ﬂooding and 150ms in Interest forwarding [12] as shown in Figure 10(a) and 10(b), respectively. (X_he better performance is because the Interest packets are for- warded to the new location (nAP) before the handover completes as the nAP is already predicted. In the Interest forwarding scheme, after the producer attached to the nAP, it sends an update message to oAP, and the oAP then Core Backhaul Edge Access 1 2 3 4 56 7 8 9 10 11 12 13 14 15 16 Prod-3 Cons-1Prod-1 Prod-4Prod-2 11 2 3 4 5 6 7 8 9 10 1612 13 14 15 1 Cons-1 Prod -2 Prod-4 Prod-1 Prod-3 2D view ICN router ICN AP Consumer Producer Cons-2 Cons-2",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S39",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "Figure 8: Fat-tree backhaul network topology. Layer 2 handover delay = 100ms 1 25 100 RTT/2 Interests redirection Time in milliseconds Figure 9: Overlapping of L2 handover delay and Interest re- direction delay. 8 Mobile Information Systems redirects the following Interests towards the producer at the new location, which causes the extra latency of RTT as shown in Table 1. In zone ﬂooding scheme, the APs are divided into zones. (X_he consumers start multicasting the Interest to all the APs in the zone after the handover occurs. (X_he extra latency RTT/2 is caused by sending handover notiﬁcation to consumers by the producer. (X_he AP to which the producer is connected replies with the contents, while the remaining APs ignore the",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S40",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "received multicast. We also ﬁnd the total RTT between consumer and producer. (X_he total RTT experienced by the packets sent exactly at the time of handover (RTTh) in the location prediction based scheme is given by the equation below and shown by the peak value in Figure 11. RTTis deﬁned as the total time it takes to send an Interest packet and receive the corresponding Data packet: RTTh � L2 + RTTt, (4) 800 750 700Sequence number 650 600 550 500 Handover latency =L2 +α Handover latency =L2 + RTT/2 134ms 109ms 11 11.1 11.211.311.411.511.611.711.811.9 12 12.112.2Time (sec) 12.312.412.512.612.712.812.9 13 Handover latency with location prediction-based scheme Handover latency with zone forwarding scheme (a) 800 750 700Sequence number 650 600 550",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S41",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "500 Handover latency =L2 +α Handover latency =L2 +R T T 150ms 109ms 11 11.1 11.211.311.411.511.611.711.811.9 12 12.112.2 Time (sec) 12.312.412.512.612.712.812.9 13 Handover latency with location prediction-based scheme Handover latency with interest forwarding scheme (b) Figure 10: Handover latency in (a) location prediction and zone ﬂooding scheme and (b) location prediction and interest forwarding scheme. Mobile Information Systems 9 where RTTt is the average round trip time between con- sumer and producer before handover. (X_he RTT during handover is highly reduced to 139ms, and RTT in Interest forwarding schemeis 160ms,while in zoneﬂooding, RTTis 144ms, almost similar to our scheme. However, the zone ﬂoodingschemecreatesaveryhighnetworkoverheadasitis based on sending multiple copies of Interests to all APs in a zone.(X_hereforethezoneﬂoodingschemeisnotscalable.On the contrary, the location",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S42",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "prediction-based scheme creates nonetworkoverhead.RTTduetopathstretchintheInterest forwarding schemeis shown in Figure 11, whilethe location prediction-based scheme does not suﬀer from the path stretch problem. Figures 12(a) and 12(b) show average handover latency indiﬀerentschemeswithvaryingpercentageofaccuracyin prediction. Since the prediction cannot be 100% right, Figure12(a)showsthatwithaverylowpredictionaccuracy of 50%, location prediction based method substantially reducestheaveragehandoverlatency,yetkeepingexcellent content to the Interest ratio as shown in Figure 12(b). RTT andhandoverlatencyforzoneﬂoodingarequitesmall,but its content to the Interest ratio is also very small because of its multicasting nature, and it cannot be regarded as the best solution. Moreover, our proposed approach signiﬁ- cantly reduces average handover latency, RTT, and maintains an outstanding content to Interest ratio as ev- identfromthesimulationresults.On thecontrary,Interest forwardingschemehasagoodContenttoInterestratio,but it has big RTT, handover latency, and suﬀers from path stretch. 5.",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S43",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "Conclusion and Future Work In NDN, the producer mobility is one of the strenuous and challenging tasks during real-time streaming. (X_he handover latency constitutes the delay caused by dissociation and reassociationofamobilenodetooAPandnAP,respectively (L2 delay), and the delay caused by network convergence time. In this work, we have exploited location prediction for producer mobility management to show its impact on the design of such mobility management techniques. (X_he sim- ulation results have shown that using location prediction techniques for mobility management can signiﬁcantly re- duce the total handover latency to approximately equal to layer 2 handover delay by eliminating the delay caused by network convergence. With a minimal prediction accuracy of 50%, the methodology tends to perform better, which shows the beneﬁts",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S44",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "of using location prediction for producer mobility management. It also reduced end-to-end RTT without creating any network overhead. (X_he results of this mobility management approach may turn out as the base knowledge for the design of a sophisticated location pre- diction technique for mobility management. As of future work, we plan to design an eﬃcient location prediction Peak RTT in interest forwarding scheme Proposed location prediction-based scheme Peak RTT for packets affected due to mobility Peak RTT in zone flooding scheme RTT due to path stretch in interest forwarding scheme There is no path stretch overhead in proposed scheme and zone flooding 200 40 50 60 70 80 90 100 110 120 130 140 150 160 170 230 260 290",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S45",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "320 350 380 Sequence number Round trip time (ms) 410 440 470 500 530 560 590 End-to-end RTT of location prediction-based scheme End-to-end RTT of interest forwarding scheme End-to-end RTT of zone flooding scheme Figure 11: Round trip time comparison of the three mobility management schemes. T able1: Handover latency comparison. Scheme Handover latency Remarks Interest forwarding Hp ≈L2 +RTT RTT between producer old location and new location is added which varies with topology and other network parameters Zone ﬂooding Hp ≈L2 +RTT/2 RTT/2 is added here which also varies as RTT varies Location prediction based (proposed) Hp ≈L2 RTTis completely eliminated with our proactive approach (Figure 9) 10 Mobile Information Systems technique and apply it in our proposed methodology",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S46",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "for mobility management in NDN. Data Availability No data were used to support this work. Moreover, the simulation code is available from the authors upon request. Conflicts of Interest (X_he authors declare that they have no conﬂicts of interest. References [1] L. Zhang, A. Afanasyev, J. Burke et al., “Named data net- working,” ACM SIGCOMM Computer Communication Re- view, vol. 44, no. 3, pp. 66–73, 2014. [2] CISCO Visual Networking Index (VNI),Cisco Visual Net- working Index: Forecast and Methodology, 2016–2021, White Paper, CISCO Visual Networking Index (VNI), Cisco, TX, USA, 2017. [3] V. Jacobson, D. K. Smetters, J. D. (X_hornton, M. F. Plass, N. H. Briggs, and R. L. Braynard, “Networking named con- tent,” inProceedings of the 5th International Conference",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S47",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "on EmergingNetworkingExperimentsandTechnologies,pp.1–12, ACM, New York, USA, December 2009. [4] T. Koponen, M. Chawla, B.-G. Chun et al., “A data-oriented (and beyond) network architecture,” ACM SIGCOMM Computer Communication Review, vol. 37, no. 4, pp.181–192, 2007. [5] https://www.4wardproject.com. [6] D. Lagutin, K. Visala, and S. Tarkoma,Publish/Subscribe for Internet: Valencia FIA book, Vol. 4, PSIRP Perspective, Amsterdam, Netherlands, 2010. [7] http://www.named-data.net. [8] H. Sundmaeker, P. Guillemin, P. Friess, and S. Woelﬄ ´e, “Vision and challenges for realizing the internet of things, cluster of European research projects on the internet of things,”European Commision, vol. 3, no. 3, pp. 34–36, 2010. [9] CISCO Visual Networking Index (VNI),Cisco Visual Net- working Index: Forecast and Methodology, 2014–2019, White Paper, CISCO Visual Networking Index (VNI), Cisco, TX, USA,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S48",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "2015. [10] D.-H. Kim, J.-H. Kim, Y.-S. Kim, H.-S. Yoon, and I. Yeom, “End-to-end mobility support in content centric networks,” International Journal of Communication Systems, vol. 28, no. 6, pp. 1151–1167, 2015. [11] J. Lee, S. Cho, and D. Kim, “Device mobility management in content-centric networking,” IEEE Communications Maga- zine, vol. 50, no. 12, pp. 28–34, 2012. [12] D. Han, M. Lee, K. Cho, T. Kwon, and Y. Choi, “Publisher mobilitysupport incontent-centric networks,”in Proceedings of the International Conference on Information Networking 2014 (ICOIN2014), pp. 214–219, IEEE, Phuket, (X_hailand, February 2014. [13] C. E. Perkins, “Mobile IP,”IEEE Communications Magazine, vol. 35, no. 5, pp. 84–99, 1997. [14] H. Farahat and H. S. Hassanein, “Proactive caching for producer mobility management in named",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S49",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "data networks,” in Proceedings of the IEEE 13th International Wireless Com- munications and Mobile Computing Conference (IWCMC), pp. 171–176, Valencia, Spain, June 2017. [15] T. Woo, H. Park, S. Jung, and T. Kwon, “Proactive neighbor pushing for enhancing provider mobility support in Content-Centric Networking,” inProceedings of the 2014 Sixth International Conference on Ubiquitous and Future Networks(ICUFN),pp.158– 163,IEEE,Shanghai,China,July 2014. [16] F. Hermans, E. Ngai, and P. Gunningberg, “Global source mobility in the content-centric networking architecture,” in Proceedings of the 1st ACM workshop on Emerging Name- Oriented Mobile Networking Design—Architecture, Algo- rithms, and Applications (NoM ’12), pp. 13–18, Hilton Head, SC, USA, June 2012. [17] Y. Luo, J. Eymann, and A. Timm-Giel, “Mobility support for content centric networking,” Telecommunication Systems, vol. 59,",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S50",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "no. 2, pp. 271–288, 2015. [18] H. Abu-Ghazaleh and A. S. Alfa, “Application of mobility prediction in wireless networks using markov renewal the- ory,”IEEE Transactions on Vehicular Technology, vol. 59, no. 2, pp. 788–802, 2010. [19] N. Samaan and A. Karmouch, “A user centric mobility prediction approach based on spatial conceptual maps,” in 160 155 150 145 140 135 130 125 120 115 110 105Average handover latency (ms) 10 20 30 40 50 60 70 80 90 100 nAP prediction accuracy (%) Location prediction-based scheme Interest forwarding scheme Zone flooding scheme (a) 10 20 30 40 50 1.2 1.1 1 0.9 0.8 0.7 0.6 0.5C to l ratio Handover events Location prediction-based scheme (50% prediction accuracy) Location prediction-based scheme (0%",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S51",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "prediction accuracy) Interest forwarding scheme Zone flooding scheme (b) Figure 12: (a) Average handover latency. (b) Content to interest ratio. Mobile Information Systems 11 Proceedings of the IEEE International Conference on Com- munication (ICC), vol. 2, pp. 1413–1417, Seoul, Korea, May 2005. [20] H.-W.Ferng,W.-Y.Kao,S.David,C.-L.Liu,H.-Y.Chen,and H.-Y. Gu, “A dynamic resource reservation scheme with mobility prediction for wireless multimedia networks,” in Proceedings of the IEEE 60th Vehicular Technology Conference (VTC2004-Fall.2004),vol.5,pp.3506–3510,AtlanticCity,NJ, USA, October 2004. 12 Mobile Information Systems Computer Games Technology International Journal of Hindawi www.hindawi.com Volume 2018 Hindawi www.hindawi.com Journal of Engineering Volume 2018 Advances in Fuzzy Systems Hindawi www.hindawi.com Volume 2018 International Journal of Reconﬁgurable Computing Hindawi www.hindawi.com Volume 2018 Hindawi www.hindawi.com Volume 2018 Applied Computational Intelligence and Soft Computing Advances",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S52",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "in Artificial Intelligence Hindawi www.hindawi.com Volume 2018 Hindawi www.hindawi.com Volume 2018 Civil Engineering Advances in Hindawi www.hindawi.com Volume 2018 Electrical and Computer Engineering Journal of Journal of Computer Networks and Communications Hindawi www.hindawi.com Volume 2018 Hindawi www.hindawi.com Volume 2018 Advances in Multimedia International Journal of Biomedical Imaging Hindawi www.hindawi.com Volume 2018 Hindawi www.hindawi.com Volume 2018 Engineering Mathematics International Journal of Robotics Journal of Hindawi www.hindawi.com Volume 2018 Hindawi www.hindawi.com Volume 2018 Computational Intelligence and Neuroscience Hindawi www.hindawi.com Volume 2018 Mathematical Problems in Engineering Modelling & Simulation in Engineering Hindawi www.hindawi.com Volume 2018 Hindawi Publishing Corporation http://www.hindawi.com Volume 2013 Hindawi www.hindawi.com The Scientific World Journal Volume 2018 Hindawi www.hindawi.com Volume 2018 Human-Computer Interaction Advances in Hindawi www.hindawi.com Volume 2018 Scienti/f_ic Programming",
      "page_hint": null,
      "token_count": 120,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    },
    {
      "snippet_id": "Parxiv_1905_08979v1:S53",
      "paper_id": "arxiv:1905.08979v1",
      "section": "method",
      "text": "Submit your manuscripts at www.hindawi.com",
      "page_hint": null,
      "token_count": 5,
      "paper_year": 2019,
      "paper_venue": "arXiv",
      "citation_count": 0,
      "extraction_quality_score": 0.9405915543493892,
      "extraction_quality_band": "good",
      "extraction_source": "native"
    }
  ],
  "extraction_meta": {
    "extractor": "pypdf",
    "two_column_applied": false,
    "ocr_applied": false,
    "pages_total": 13,
    "empty_pages": 0,
    "empty_page_pct": 0.0,
    "page_stats": [
      {
        "page": 1,
        "chars": 4008,
        "empty": false
      },
      {
        "page": 2,
        "chars": 6146,
        "empty": false
      },
      {
        "page": 3,
        "chars": 6094,
        "empty": false
      },
      {
        "page": 4,
        "chars": 1382,
        "empty": false
      },
      {
        "page": 5,
        "chars": 4734,
        "empty": false
      },
      {
        "page": 6,
        "chars": 1576,
        "empty": false
      },
      {
        "page": 7,
        "chars": 5036,
        "empty": false
      },
      {
        "page": 8,
        "chars": 2393,
        "empty": false
      },
      {
        "page": 9,
        "chars": 1691,
        "empty": false
      },
      {
        "page": 10,
        "chars": 3866,
        "empty": false
      },
      {
        "page": 11,
        "chars": 4336,
        "empty": false
      },
      {
        "page": 12,
        "chars": 455,
        "empty": false
      },
      {
        "page": 13,
        "chars": 1504,
        "empty": false
      }
    ],
    "quality_score": 0.9406,
    "quality_band": "good"
  }
}